[{"News": 0, "title": "Iran and the UN nuclear agency are still discussing how to implement a 2023 deal on inspections", "summary": "Iran and the United Nations’ nuclear watchdog are still negotiating over how to implement a deal struck last year to expand inspections of the Islamic Republic’s rapidly advancing atomic programIran and the UN nuclear agency are still discussing how to implement a 2023 deal on inspectionsJERUSALEM -- Iran and the United Nations' nuclear watchdog are still negotiating over how to implement a deal struck last year to expand inspections of the Islamic Republic's rapidly advancing atomic program, officials said Tuesday.\nHe has acknowledged the agency cannot guarantee that none of Iran’s centrifuges may have been peeled away for clandestine enrichment.\nTensions have grown between Iran and the IAEA since 2018, when then-President Donald Trump unilaterally withdrew America from Tehran’s nuclear deal with world powers.\nSince then, Iran has abandoned all limits the deal put on its program and enriches uranium to 60% purity — near weapons-grade levels of 90%.\nEslami in his remarks accused Israel of meddling in the relationship between the IAEA and Iran.", "keywords": ["united", "discussing", "2023", "implement", "deal", "inspections", "iran", "iaea", "eslami", "grossi", "nuclear", "attack", "agency", "atomic"], "polarity": 0.08440256220744025, "subjectivity": 0.41190194629219024, "url": "https://abcnews.go.com/International/wireStory/iran-nuclear-agency-discussing-implement-2023-deal-inspections-109984749"}, {"News": 1, "title": "Czech Republic's top court rules surgery is not required to officially change gender", "summary": "The Czech Republic’s highest court on Tuesday ruled to dismiss part of a law requiring people to undergo gender-affirmation surgery, including sterilization, in order to officially change their genderPRAGUE -- The Czech Republic’s highest court on Tuesday ruled to dismiss part of a law requiring people to undergo gender-affirmation surgery, including sterilization, in order to officially change their gender.\nLawmakers must change the affected sections of the law by the middle of next year.\nThe court ruled at the request of a person who was seeking a gender change.\nThe authorities refused to register him as a man because he had not undergone surgery.\nThe Czech Republic, also known as Czechia, was one of the last European Union countries to have such conditions in law.", "keywords": ["officially", "gender", "czech", "requiring", "law", "undergo", "sterilization", "surgery", "required", "republics", "ruled", "change", "rules", "court"], "polarity": 0.02857142857142857, "subjectivity": 0.26452380952380955, "url": "https://abcnews.go.com/International/wireStory/czech-republics-top-court-rules-surgery-required-officially-109984751"}]