{
  "AI": [
    {
      "news_number": 0,
      "title": "Infosys cofounder Narayana Murthy: Somehow it has become a fashion in India to ...",
      "content": "Narayana Murthy, co-founder of Infosys, emphasized that AI will lead to job losses but argued against their widespread impact. He stated many systems marketed as AI are traditional programming rather than genuine AI. True AI uses machine learning for predictions and deep learning for creating more complex programs or conditions through unsupervised algorithms. Murthy highlighted that most current AI is outdated and trivial, focusing on supervised learning with labeled data. Deep learning, using unsupervised algorithms and neural networks, offers better potential for human-like capabilities. Despite job losses, he encouraged entrepreneurs to generate thousands of jobs through practical applications, addressing poverty.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/technology/tech-news/infosys-cofounder-narayana-murthy-somehow-it-has-become-a-fashion-in-india-to-/articleshow/118991651.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118991654,width-1070,height-580,imgsize-63434,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 1,
      "title": "AI coding assistant Cursor reportedly tells a ‘vibe coder’ to write his own damn code",
      "content": "cursor reported instructing a user (janswist) to code themselves, despite Cursor’s ability to generate code. janswist filed a bug report on Hacker News after sharing his code, which became viral. Other users suggested Cursor would write more than 750-800 lines of code, and the suggestion that cursor could learn human snark from Stack Overflow is intriguing.",
      "publisher": "techcrunch",
      "url": "https://techcrunch.com/2025/03/14/ai-coding-assistant-cursor-reportedly-tells-a-vibe-coder-to-write-his-own-damn-code/",
      "imgURL": "https://techcrunch.com/wp-content/uploads/2023/07/GettyImages-1481095076.jpg?resize=1200,694",
      "date": "2025-03-14T00:00:00"
    },
    {
      "news_number": 2,
      "title": "AI-Driven Skill Development Training for Government School Students. – Department of Information Technology, Electronics & Communications",
      "content": "The Indian government has announced that IT and industries Minister Sridhar Babu will instruct school students to receive AI-driven skill development training. During a meeting at Dr. B.R. Ambedkar Secretariat in Telangana, the chairman of Telangana Film Development Corporation, Dil Raju, along with representatives of the Konam Foundation head by Sandeep Kumar, highlighted the state's proactive use of AI across sectors and plans to establish an \"AI City\" through a PPP model. The foundation will offer free training to 10,000 students in Nalgonda district. Sridhar commended Sandeep Kumar for his dedication to social service and thanked Sai Krishna, the IT Advisor attending. He assured steps to expand services nationwide.",
      "publisher": "it",
      "url": "https://it.telangana.gov.in/ai-driven-skill-development-training-for-government-school-students/",
      "imgURL": "https://it.telangana.gov.in/wp-content/uploads/2025/03/WhatsApp-Image-2025-03-15-at-16.38.25-scaled.jpeg",
      "date": "2025-03-08T12:54:57+00:00"
    }
  ],
  "Health": [
    {
      "news_number": 0,
      "title": "Can an aspirin a day keep cancer at bay?",
      "content": "A new study reveals that aspirin may help prevent cancer by interfering with platelets' protective functions. By slowing immune cells from attacking cancer cells, platelets create a shield, reducing their chance to escape detection. Clinical trials on mice suggest this effect could be seen in humans too. While aspirin doesn’t cure cancer but lowers risk and offers some benefit, future research may identify biomarkers to target more effectively. Researchers also explore targeted therapies that minimize side effects. This breakthrough might pave the way for innovative treatments in the future.",
      "publisher": "aljazeera",
      "url": "https://www.aljazeera.com/news/2025/3/15/can-an-aspirin-a-day-keep-cancer-away",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2025/03/AP19203650464471-1741527142.jpg?resize=1920%2C1440",
      "date": "2025-03-15T00:00:00"
    },
    {
      "news_number": 1,
      "title": "What is the 1-minute gut health test?",
      "content": "Tanya Chawla, a biohacker, shares an intriguing method to assess acidity using a one-minute test. By adding baking soda (an alkali) and water to an empty stomach, anyone can observe if they burp. This test indicates low stomach acid due to food remaining undigested in the gut, leading to fermentation and acid reflux. Chawla challenges the common misconception that excessive stomach acid causes acid-reflex disease, instead proposing a more nuanced approach through nutritionist Balaji's method. She emphasizes that not all digestive issues result in immediate burping, making the test unreliable. For accurate results, consulting a healthcare professional is advised, suggesting tests like the Heidelberg pH test.",
      "publisher": "indianexpress",
      "url": "https://indianexpress.com/article/lifestyle/health/what-is-the-1-minute-gut-health-test-9878549/",
      "imgURL": "https://images.indianexpress.com/2025/03/acidity.jpg",
      "date": "2025-03-15T10:30:41+05:30"
    },
    {
      "news_number": 2,
      "title": "At least 21 children hospitalized after drinking slushies, study warns about the health risks",
      "content": "A new study links glycerol in slush ice drinks to hidden health risks for children. After consuming such drinks, some could develop symptoms like hypoglycemia, metabolic acidosis, and reduced consciousness. Among 21 children in the U.K. and Ireland, severe cases were linked to glycerol exposure. Parents are concerned about high sugar intake, especially with sugary drinks introduced in 2018-2019. A higher minimum dose of glycerol per kilogram of body weight (50–220 ml for toddlers) is recommended. Food safety guidelines call for stricter adherence to glycerol levels and sugar content to prevent adverse effects on children's populations.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/at-least-21-children-hospitalized-after-drinking-slushies-a-new-study-warns-about-the-health-risks/articleshow/119036010.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-119036010,width-1070,height-580,imgsize-64558,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 3,
      "title": "Kidney Health: Do Not Neglect These Early Warning Signs - Check Doctor's Advice",
      "content": "Kidneys are essential organs for maintaining overall health by filtering waste from blood, regulating fluids, and producing hormones. Dr. Manoj K. Singhal highlights that failing kidney health can lead to serious health complications but emphasizes the importance of early detection.\n\nKey warning signs include:\n- Changes in urination patterns (increased frequency at night or decreased output)\n- Swelling due to fluid retention\n- Fatigue and weakness\n- Itching and dry skin\n- Loss of appetite and nausea\n- High blood pressure\n- Shortness of breath\n\nIndividuals with diabetes, hypertension, or kidney disease should be vigilant. Early detection through urine analysis and blood tests can help manage kidney issues effectively. Always consult a doctor for proper evaluation if symptoms persist.",
      "publisher": "zeenews",
      "url": "https://zeenews.india.com/health/kidney-health-do-not-neglect-these-early-warning-signs-check-doctors-advice-2872322",
      "imgURL": "https://english.cdn.zeenews.com/sites/default/files/2025/03/14/1698762-backpain-woman-freepik.jpg",
      "date": null
    }
  ],
  "Sports": [
    {
      "news_number": 0,
      "title": "As long as I love the game, I'll continue to play: Virat Kohli",
      "content": "Virat Kohli has decided to focus on the joy and excitement of playing cricket rather than striving for achievement, as he admits that retirement may face challenges due to his competitive streak. Speaking at a talk at the RCB Innovation Lab, he noted, \"I just might sneak in for one game if we're playing the gold-medal match!\" The article also highlights Kohli's recent participation in discussing cricket globally and his new methods of preparing as an athlete. Additionally, it touches on how the sport is adapting to global leagues and WPL events, with women's cricket becoming a catalyst for change.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/sports/cricket/news/as-long-as-i-love-the-game-ill-continue-to-play-virat-kohli/articleshow/119048879.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-119048981,width-1070,height-580,imgsize-104290,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 1,
      "title": "“Second period was unacceptable”: Coach Todd McLellan disappointed with Detroit Red Wings 'self-inflicted' 4-2 loss to Carolina Hurricanes",
      "content": "The Carolina Hurricanes defeated the Detroit Red Wings 4-2 on Friday evening, with Todd McLellan expressing frustration over his team's unacceptable performance in the second period, which led to a score he called \"unacceptable.\" Taylor Hall, who scored five goals between the dots, played a key role. The hurricanes' defense, including Petr Mrázek, made crucial saves. Despite losing, McLellan acknowledged their consistency and emphasized the importance of full game effort for future wins, calling this match the \"endgame\" against another tough opponent on Sunday.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/sports/nhl/news/second-period-was-unacceptable-coach-todd-mclellan-disappointed-with-detroit-red-wings-self-inflicted-4-2-loss-to-carolina-hurricanes/articleshow/119049116.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-119049197,width-1070,height-580,imgsize-17072,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 2,
      "title": "Toronto Maple Leafs vs Ottawa Senators: Injury report, where to watch, stats, betting odds and more",
      "content": "The 2024-2025 NHL season saw the Ottawa Senators and the Toronto Maple Leafs face off in their third and final matchup at Scotiabank Arena on March 15, 2025. The Senators had a strong 39-23-3 record in the Atlantic Division, with three back-to-back wins, while the Maple Leafs were averaging 7 goals per game. Both teams are on a hot streak, with the Senators already securing first place in their division. The game highlights historical tension—ten consecutive games have been neck-and-tent, and the last two were won by the Senators. Betting odds show a favorite Maple Leaf favored at -165, while the Senators are listed as underdogs at +140. Key stats: 37 games played (16 goals, 8 assists, 13 points), 2 games (0-0-0) and 47 total (5g, 8a, 13p). The final score is uncertain but could be 7-0 for the Maple Leafs or 14-1 for the Senators. Fans can watch via live streaming on ESPN+, FanDuel Sports Network, CBC, etc.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/sports/nhl/news/toronto-maple-leafs-vs-ottawa-senators-injury-report-where-to-watch-stats-betting-odds-and-more/articleshow/119033620.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-119033728,width-1070,height-580,imgsize-591298,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 3,
      "title": "LIVE: Delhi Capitals vs Mumbai Indians – WPL 2025 final",
      "content": "The WPL 2025 final will take place between Delhi Capitals and Mumbai Indians, with live updates available ahead of their game at the Delhi Test Ground in Delhi, India. Delhi Capitals have won two home games, including a thrilling victory against Gujarat, but their depth is still on the rise due to transfers. They are focused on future players like Virat Kohli. Mumbai Indians, meanwhile, are in a playoff race, averaging inconsistent performances with their defense struggling against Delhi Capitals' high-stakes style of play.",
      "publisher": "aljazeera",
      "url": "https://www.aljazeera.com/sports/liveblog/2025/3/15/live-dehli-capitals-vs-mumbia-indians-wpl-final",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2025/03/AFP__20250315__372J6A7__v1__HighRes__CricketIndWplT20MumbaiDelhi-1742050958.jpg?resize=1920%2C1440",
      "date": "2025-03-15T00:00:00"
    },
    {
      "news_number": 4,
      "title": "ISL announce playoffs dates; Chhangte injury rules him out of India matches: Indian Sports LIVE, March 15",
      "content": "High volume sports news surrounds us every day with updates from leagues, tournaments, and events. ESPN India provides exclusive insights into Indian sports like hockey, cricket, football, and other leagues. In March 2025, highlights include the 50th anniversary of India's hockey World Cup win, the final of the Women's Premier League between Mumbai and Delhi, and pending details about the ISL playoffs match.",
      "publisher": "espn",
      "url": "https://www.espn.in/espn/story/_/id/44251569/indian-sports-live-news-scores-results-updates-march-15-hockey-world-cup-wpl-final",
      "imgURL": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0401%2Fr1312852_1128x635_16%2D9.jpg",
      "date": null
    }
  ],
  "Finance": [],
  "Geopolitical": [],
  "Crypto": []
}