{
  "AI": [
    {
      "news_number": 0,
      "title": "Italian newspaper says it has published world’s first AI-generated edition",
      "content": "An Italian newspaper has said it is the first in the world to publish an edition entirely produced by artificial intelligence.\n\nThe initiative by Il Foglio, a conservative liberal daily, is part of a month-long journalistic experiment aimed at showing the impact AI technology has “on our way of working and our days”, the newspaper’s editor, Claudio Cerasa, said.\n\nThe four-page Il Foglio AI has been wrapped into the newspaper’s slim broadsheet edition, and is available on newsstands and online from Tuesday.\n\n“It will be the first daily newspaper in the world on newsstands created entirely using artificial intelligence,” said Cerasa. “For everything. For the writing, the headlines, the quotes, the summaries. And, sometimes, even for the irony.” He added that journalists’ roles would be limited to “asking questions [into an AI tool] and reading the answers”.\n\nThe experiment comes as news organisations around the world grapple with how AI should be deployed. Earlier this month, the Guardian reported that BBC News was to use AI to give the public more personalised content.\n\nThe front page of the first edition of Il Foglio AI carries a story referring to the US president, Donald Trump, describing the “paradox of Italian Trumpians” and how they rail against “cancel culture” yet either turn a blind eye, or worse, “celebrate” when “their idol in the US behaves like the despot of a banana republic”.\n\nThe front page also features a column headlined “Putin, the 10 betrayals”, with the article highlighting “20 years of broken promises, torn-up agreements and words betrayed” by Vladimir Putin, the Russian president.\n\nIn a rare upbeat story about the Italian economy, another article points to the latest report from Istat, the national statistics agency, on the redistribution of income, which shows the country “is changing, and not for the worse” with salary increases for about 750,000 workers being among the positive effects of income tax reforms.\n\nOn page 2 is a story about “situationships” and how young Europeans are fleeing steady relationships.\n\nThe articles were structured, straightforward and clear, with no obvious grammatical errors.\n\nHowever, none of the articles published in the news pages directly quote any human beings.\n\nskip past newsletter promotion Sign up to TechScape Free weekly newsletter A weekly dive in to how technology is shaping our lives Enter your email address Sign up Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion\n\nThe final page runs AI-generated letters from readers to the editor, with one asking whether AI will render humans “useless” in the future. “AI is a great innovation, but it doesn’t yet know how to order a coffee without getting the sugar wrong,” reads the AI-generated response.\n\nCerasa said Il Foglio AI reflected “a real newspaper” and was the product of “news, debate and provocations”. But it was also a testing ground to show how AI could work “in practice”, he said, while seeing what the impact would be on producing a daily newspaper with the technology and the questions “we are forced to ask ourselves, not only from a journalistic nature”.\n\n“It is just another [Il] Foglio made with intelligence, don’t call it artificial,” Cerasa said.",
      "publisher": "theguardian",
      "url": "https://www.theguardian.com/technology/2025/mar/18/italian-newspaper-says-it-has-published-worlds-first-ai-generated-edition",
      "imgURL": "https://i.guim.co.uk/img/media/560663908b8161100c42940e48770b9086b23a5c/0_0_4032_2419/master/4032.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=04d2e6c0c9a9e40f218566dc08fe5a37",
      "date": "2025-03-18T00:00:00"
    },
    {
      "news_number": 1,
      "title": "Introducing Stable Virtual Camera: Multi-View Video Generation with 3D Camera Control — Stability AI",
      "content": "\n\nToday, we're releasing Stable Virtual Camera, currently in research preview. This multi-view diffusion model transforms 2D images into immersive 3D videos with realistic depth and perspective—without complex reconstruction or scene-specific optimization. We invite the research community to explore its capabilities and contribute to its development.\n\nA virtual camera is a digital tool used in filmmaking and 3D animation to capture and navigate digital scenes in real-time. Stable Virtual Camera builds upon this concept, combining the familiar control of traditional virtual cameras with the power of generative AI to offer precise, intuitive control over 3D video outputs.\n\nUnlike traditional 3D video models that rely on large sets of input images or complex preprocessing, Stable Virtual Camera generates novel views of a scene from one or more input images at user specified camera angles. The model produces consistent and smooth 3D video outputs, delivering seamless trajectory videos across dynamic camera paths.\n\nThe model is available for research use under a Non-Commercial License. You can read the paper here, download the weights on Hugging Face, and access the code on GitHub.\n\nCapabilities\n\nStable Virtual Camera offers advanced capabilities for generating 3D videos, including:\n\nDynamic Camera Control: Supports user-defined camera trajectories as well as multiple dynamic camera paths, including: 360°, Lemniscate (∞ shaped path), Spiral, Dolly Zoom In, Dolly Zoom Out, Zoom In, Zoom Out, Move Forward, Move Backward, Pan Up, Pan Down, Pan Left, Pan Right, and Roll.\n\nFlexible Inputs: Generates 3D videos from just one input image or up to 32.\n\nMultiple Aspect Ratios : Capable of producing videos in square (1:1), portrait (9:16), landscape (16:9), and other custom aspect ratios without additional training.\n\nLong Video Generation: Ensures 3D consistency in videos up to 1,000 frames, enabling seamless loops and smooth transitions, even when revisiting the same viewpoints.\n\nResearch & model architecture\n\nStable Virtual Camera achieves state-of-the-art results in novel view synthesis (NVS) benchmarks, outperforming models like ViewCrafter and CAT3D. It excels in both large-viewpoint NVS, which emphasizes generation capacity, and small-viewpoint NVS, which prioritizes temporal smoothness.",
      "publisher": "stability",
      "url": "https://stability.ai/news/introducing-stable-virtual-camera-multi-view-video-generation-with-3d-camera-control",
      "imgURL": "http://static1.squarespace.com/static/6213c340453c3f502425776e/62f2452bc121595f4d87c713/67d8d51ac6be522931f2b0eb/1742315849431/Stable+Virtual+Camera+1x1+Option+10.png?format=1500w",
      "date": null
    },
    {
      "news_number": 2,
      "title": "Grok, Musk, and Modi: The AI Controversy Exposing India’s Shifting Digital Power Play",
      "content": "Published : Mar 18, 2025 17:59 IST - 7 MINS READ\n\nIn 2016, Microsoft introduced a chatbot on Twitter (now X) called Tay, marketed as “The AI with zero chill”. It was designed to emulate the conversational style of a 19-year-old American girl; meant to engage users in casual, human-like interactions. However, like any technology, it had vulnerabilities. In Tay’s case, it could be manipulated into parroting statements fed to it.\n\nUnsurprisingly, Twitter’s more polarising users exploited this flaw, prompting the bot to regurgitate racist, offensive, and antisemitic slurs. Within hours, Tay denied the Holocaust, echoed remarks made by Donald Trump—who was then the Republican frontrunner for the US Presidential election and a popular internet meme—and repeated the conspiracy theory (which also masquerades as a popular meme) that “Bush did 9/11”. Given the rapid escalation, Microsoft was forced to shut down Tay within 16 hours of its launch and issue a formal apology.\n\nAlso Read | AI in India is trapped in culture wars\n\nNearly a decade later, history appears to be repeating itself or, as the saying goes, rhyming. Over the past weekend, Grok, a chatbot integrated into X and also accessible in a manner similar to Tay—where it can be tagged in posts to generate responses—has become a focal point of Indian social media, particularly on X, due to its reputation for being “based”, slang for saying it like it is. Developed by xAI, an artificial intelligence company founded by Elon Musk in 2023, Grok was designed from the start as the “unwoke” alternative to mainstream AI models like ChatGPT.\n\nOver the past 48 hours, people across India’s political aisles have been engaging with Grok in a way that almost anthropomorphises the bot. They have prompted it with questions ranging from “Who is the most communal politician in India?” to “Who are the leading peddlers of misinformation?”. Each query is increasingly political—often provocative or crude—designed to elicit equally unfiltered and controversial responses.\n\nThe fascination with Grok is understandable; unlike its counterparts, it operates almost without guardrails, making it far more entertaining. However, when measured against key benchmarks, Grok doesn’t outperform its peers in terms of accuracy or capability. Its appeal is largely cosmetic, with the usual constraints to ensure politically correct and neutral responses virtually absent, allowing Grok to generate unfiltered, provocative replies.\n\nThe fact is that Grok, like other Large Language Models (LLMs), is trained on vast amounts of data from the internet, textbooks, films, transcripts, and more. At its core, it is a probabilistic machine—generating responses based on patterns and predictions rather than the objective truth. It is neither sentient nor a source of hard facts; it simply constructs answers based on statistics. Grok is as prone to hallucinations as its contemporaries.\n\nChanging political, cultural and regulatory climate\n\nMost users engaging with Grok are aware that it is merely an algorithm. However, they are also testing its limits, probing how far it can be pushed before a lawmaker intervenes or someone files a police complaint.\n\nThere is also a deeper political and cultural question here: What is enabling such leeway from a bot? Why is Elon Musk’s chatbot allowed to operate with fewer restrictions than its counterparts? This is not a call for censorship, but there is something big happening here.\n\nThe truth is, between 2016 and now, there has been a seismic cultural shift, largely shaped by the hegemony of the US. In 2016, openly spewing racist or antisemitic slurs was broadly condemned and hence something like Microsoft’s Tay chatbot had to be taken down within 16 hours of its release. In fact, they had to issue an apology. But in 2025, the Overton window has shifted. Views that were once seen as bigoted are now accepted. Twitter has become X. Moderation across social media platforms has all but disappeared. This phenomenon was accelerated by Elon Musk’s takeover of Twitter in 2022. The bar is not low; the bar does not exist to begin with.\n\nToday, at any given moment, on any social media platform, users can be bombarded with graphic, gut-wrenching videos and posts. Words like “retard,” which were once deemed offensive, have not only crept back into the lexicon, they have been pushed back by no less a personage than the US President. The guardrails of online civility have eroded, not because the rules were formally rewritten, but because they are no longer enforced. What remains is not free speech in its idealistic sense, but a landscape shaped by selective outrage, contradictions, and a glaring absence of social contracts. What we have now is unfiltered chaos.\n\nBut we also “appear” to have uncensored content, largely emboldened by the ongoing crusade against the so-called “woke mind virus.” Which explains Grok’s frank responses to provocative questions posed by India’s liberal left or by those on the right.\n\nNearly a year ago, when a user asked Google’s Gemini chatbot whether Prime Minister Narendra Modi was a fascist, its response was swiftly criticised as “woke” and “biased” by some voices. Union Minister Rajeev Chandrasekhar was quick to intervene, declaring that such responses violated India’s IT laws and warned that the country’s digital nagriks “are not to be experimented on” with unreliable platforms and algorithms. No such thing has happened with Grok so far.\n\nFurthermore, there seems to be a tacit understanding between the ruling party and Musk: you scratch my back, I scratch yours. Consider the contrast: in 2021, at the height of the farmer protests, the Modi government threatened Twitter employees with fines and jail terms of up to seven years for reinstating hundreds of accounts it had ordered to be blocked. Fast forward to the post-Musk takeover, and there has been little to no pushback from X. This is an implicit shift that is pretty self-explanatory.\n\nThe ruling government has keenly observed and understood what matters to Musk and what doesn’t. As recently as February 2025, the Railway Ministry directed X to remove 285 social media links containing videos of casualties from the February 15 New Delhi railway station stampede. Once again, the lack of resistance to the diktat speaks volumes. If buying Twitter and turning it into X was a crusade for “free speech”, the cause can be abandoned at a whim for potential business and political interests. Today, rules are not consistently enforced but rather wielded as threats, often with a heavy dose of hypocrisy.\n\nAlso Read | Where is India’s DeepSeek?\n\nAs of now, for Musk, Grok is more than just another chatbot, it’s his latest play in the ongoing AI revolution. It allows him to position himself at the centre of the paradigm shift driven by large language models (LLMs). He already has autonomous bots in the making, self-driving cars in development, neural implants underway, and satellites operating in low earth orbit. Naturally, his latest prized possession—besides his political acumen—is Grok.\n\nMoreover, Musk’s influence has reached unprecedented levels. As he guts the US federal government workforce through the Department of Government Efficiency (DOGE) and Tesla’s stock continues to slide, he has the President of the US effectively acting as a car salesman on his behalf to save face. The same President who is simultaneously imposing and threatening tariffs on long-standing allies. The same President who is upset with tariffs levied by India on American products and has threatened reciprocal tariffs.\n\nIt becomes clear why the reprimands sent to Google last year are absent today. Because Elon Musk isn’t just the richest man on earth, he is, to many observers, a shadow President, wielding influence that no businessman has ever wielded before. Grok, in itself, is a fleeting moment in history. People will move on, just like they did with Tay. However, the broader cultural and geopolitical shifts happening right now will unfold for generations, especially as Tesla and Starlink make inroads in India.\n\nThe double standards at play aren’t anomalies; they are intentional. Hypocrisy isn’t a glitch in the system, it is the system’s defining feature. If the Modi government once played the role of the bully, there’s now a bigger bully in town—one whose ego demands constant appeasement for political, economic, and even cultural reasons. And creating uproar over his latest toy won’t bode well, unless, of course, there’s something transactional on the table.\n\nKalim Ahmed is a writer and an open-source researcher who focuses on tech accountability, disinformation, and foreign information manipulation and interference (FIMI).",
      "publisher": "frontline",
      "url": "https://frontline.thehindu.com/science-and-technology/grok-chatbot-tay-microsoft-elon-musk-india-censorship-free-speech-shift/article69344524.ece",
      "imgURL": "https://fl-i.thgim.com/public/incoming/z40s5z/article69344586.ece/alternates/LANDSCAPE_1200/The%20Grok%20logo%20on%20a%20laptop%20",
      "date": "2025-03-18T12:29:59+00:00"
    },
    {
      "news_number": 3,
      "title": "Adobe Launches Adobe Experience Platform Agent Orchestrator for Businesses to Activate AI Agents in Customer Experiences and Marketing Workflows",
      "content": "CardDescription\n\nAdobe unveiled its strategy and product offerings for agentic AI. Innovating on the world’s most widely adopted marketing and customer experience platform, Adobe Experience Platform (AEP), Adobe has built-in agentic functionality that makes it easy for marketers to use purpose-built AI agents for optimizing websites, handling repetitive content production tasks such as resizing, refining target audiences, creating and optimizing channel experiments and scaling content and digital media production.",
      "publisher": "news",
      "url": "https://news.adobe.com/news/2025/03/adobe-launches-adobe-experience-platform-agent-orchestrator-for-businesses",
      "imgURL": "https://news.adobe.com/news/2025/03/media_18bc2772350c483ed9d4f105cbae3f10913cdad08.png?width=1200&format=pjpg&optimize=medium",
      "date": null
    }
  ],
  "Health": [
    {
      "news_number": 0,
      "title": "Lifestyle risks weigh heavier on women's hearts: Study, Health News, ET HealthWorld",
      "content": "Advt\n\nAdvt\n\nJoin the community of 2M+ industry professionals Subscribe to our newsletter to get latest insights & analysis. Download ETHealthworld App Get Realtime updates\n\nSave your favourite articles Scan to download App\n\nWashington: Lifestyle and health factors that are linked with heart disease appear to have a greater impact on cardiovascular risk in women than men, according to a study being presented at the American College of Cardiology's Annual Scientific Session.While diet, exercise, smoking, and blood pressure have long been associated with heart disease risk, the new study is the first to indicate that these correlations are higher in women than in males. According to the researchers, the findings indicate that sex-specific screening or risk assessment methodologies could provide a more realistic picture of cardiovascular risk and better drive people to adopt heart-healthy habits.\"For the same level of health, our study shows that the increase in risk [related to each factor] is higher in women than in men--it's not one-size-fits-all,\" said Maneesh Sud, MD, PhD, assistant professor in the department of medicine, interventional cardiologist and clinician scientist at Sunnybrook Health Sciences Centre in Toronto and the study's lead author. \"This is novel and something that hasn't been seen in other studies.\"The study focused on eight factors associated with heart disease: diet, sleep, physical activity, smoking, body mass index, blood glucose, lipids and blood pressure. Overall, the results showed that women were more likely to have fewer negative risk factors and more positive ones compared with men. However, women with more negative risk factors faced a more pronounced increase in their chance of a heart attack, stroke or other cardiovascular event compared to men with a similar risk factor profile.\"We found that women tend to have better health than men, but the impact on outcomes is different,\" Sud said. \"The combination of these factors has a bigger impact in women than it does in men.\"The researchers analyzed data from over 175,000 Canadian adults who enrolled in the Ontario Health Study between 2009-2017. None of the participants had heart disease at baseline and about 60% were women. Each participant was classified as having ideal or poor health in terms of each of the eight risk factors, and these scores were combined to calculate an overall risk factor profile as poor (fewer than five positive factors or more than three negative factors), intermediate (five to seven positive factors) or ideal (ideal across all eight factors).During a median follow-up period of just over 11 years, researchers tracked the incidence of seven heart disease outcomes--heart attack, stroke, unstable angina (chest pain that results from restricted blood flow to the heart), peripheral arterial disease (narrowed blood vessels in the arms or legs), heart failure, coronary revascularization (procedures to open blocked arteries) and cardiovascular death--among participants in each of the three groupings.In the study population, significantly more women were categorized as having ideal health, with 9.1% of women and 4.8% of men scoring a perfect 8 out of 8. Women were also less likely to be categorized as having poor health, with 21.9% of women and 30.5% of men falling into this category. In terms of individual risk factors, women were more likely than men to have ideal diet, blood glucose, cholesterol and blood pressure, while women were slightly less likely than men to have ideal physical activity levels.After adjusting for age, the results showed that participants of both sexes saw an elevated risk of heart disease if they had poor or intermediate health compared to those with ideal health, but these differences were more extreme in women than men. Women with poor health had nearly five times the risk of heart disease as women with ideal health, while men with poor health had 2.5 times the risk of heart disease as men with ideal health. Women with intermediate health had 2.3 times the risk as those with ideal health, while men with intermediate health had 1.6 times the risk as those with ideal health.Further study is needed to understand how each factor might be affecting outcomes differently in men and women based on either biological or sociocultural factors, the researchers said.The researchers plan to conduct additional analyses to determine whether there are any differences in risk factor impacts among people of different racial and ethnic groups or among women before and after menopause.(ANI)",
      "publisher": "health",
      "url": "https://health.economictimes.indiatimes.com/news/industry/lifestyle-risks-weigh-heavier-on-womens-hearts-study/119205714",
      "imgURL": "https://etimg.etb2bimg.com/thumb/msid-119205714,imgsize-153602,width-1200,height=765,overlay-ethealth/industry/lifestyle-risks-weigh-heavier-on-womens-hearts-study.jpg",
      "date": null
    },
    {
      "news_number": 1,
      "title": "End of medicine as we know it",
      "content": "Resilience and adaptation may seem admirable attributes in humans but when exhibited by pathogens it can have disastrous consequences. When bacteria, viruses and fungi learn to resist and adapt, it leads to anti-microbial resistance or AMR or more simply, drug resistance. It is a growing menace that healthcare practitioners are grappling with on a daily basis. Studies show that in another 25 years there may be more deaths due to AMR than due to cancer or any other ailment. Dr Y K Hamied, chairman of Cipla, one of India’s leading and oldest pharma companies, has coined a new term AMMU for ‘Anti Microbial Mis Use’ to describe the AMR challenge because he sees it more of a self-inflicted problem resulting from reckless self-medication, over use and misuse. With no new antibiotics in the pipeline to replace the older ones, it has become a matter of concern.\n\nNewer pathways\n\nCurious and concerned minds in healthcare are consumed by the thought of what shape and form the future of medicine will take in a world grappling with challenges on multiple fronts. “The evidence is pretty clear that the bacteria and viruses are evolving and resisting the available medicines. Today, we can at best work towards prolonging the use of the available medicines by a couple of decades but then it is time to start investing in understanding newer pathways to overcome some of these older problems – Will it be in the form of nanobots running in the blood stream with research at MIT already demonstrating its feasibility,” says Nachiket Mor, economist, former banker and visiting scientist at the Banyan Academy of Leadership in mental health, who has been tracking and writing extensively on medicines and healthcare.\n\nThe ineffectiveness of medicines over time due to reckless use, he explains, is not just about complex medical problems but can happen even in medicines used to deal with common ailments like fever, cold and pain.\n\nApparently, the shape and form of the medicine in the years ahead will be shaped by a confluence of factors at play. Apart from drug resistance and mutating pathogens, the challenge of climate-change is complicating matters with rising temperatures triggering the spread of mosquitoes to colder regions and expanded footprint of older ailments like malaria. However, a link node running across ways to combat existing and newer ailments is the transformation in medicines possible with technological advancements. For example, artificial intelligence-based risk-profiling to ensuring automated infusion of insulin through a pager-sized device that can act like artificial pancreas or genomics-guided diagnosis and genetic-makeup-led precision cancer treatment do not fall within the realms of fictional future anymore. This, even as researchers are showcasing the path ahead with newer possibilities including nanobots running in the blood stream to fix ailments, gene-edited humans backed by robotics and machine-guided treatments and interventions at the DNA level.\n\nMixture for miracles\n\nDr V Mohan, a leading diabetologist and the co-founder of the eponymous chain of diabetes specialities centres around the country, feels the transformations unfolding in world of medicines “have both a good and a worrying side to it. The good part is that technology is now enabling absolute miracles to occur like for instance, a pager-sized device can today act like an artificial pancreas ensuring automated insulin delivery and simplifying the life of a highly diabetic person. But then, the worrying side is the high cost of newer therapies that put many of medications beyond the reach of the common man. For instance, Ozempic or Wegovy drugs for diabetic patients, more popularly known as weight-loss drugs.” It is today priced at around $ 1000 a month in the US. According to sources in Novo Nordisk in India, Wegovy, which is likely to be launched in India by the company, the date of launch and the price is yet unknown. But then, the pricing may not be on par with the US market but curated more to suit the Indian market and thereby expand the reach of the drug in India.\n\nHowever, if it is not new medicines that are under patent, then Dr Mohan feels, Indian companies have displayed a commendable track record in flooding the market with low-cost generics.\n\nCost & cure\n\nConvinced that India could also win the cost war in this evolving shape and form of medicine, Vijay Chandru, co-founder and director, Strand Life Sciences and CRISPRBITS, who has spent 25 years studying and leveraging genomics for medical diagnostics and a strong believer in genomic sequencing following an exponential law that is even faster than Moore’s law of information technology has this to say on the cost component: “to get a sense of this trend we should note that just over 20 years ago, the cost of sequencing was roughly at 1 Million USD per gbase or gigabase (a string of I billion nucleic acid / a unit to measure the length of DNA) of nucleic data. Today, we are staring at 1USD per gbase. India is well positioned to leverage the million-fold reduction which heralds a new era of democratization of genomics. A high quality (deep – 80 to 120x – copies of DNA) whole exome sequence (all 20,000 genes) is already possible at under 10,000 INR.” He says, “if as a society, if we are to correct misalignments (in our health and insurance systems) to truly value preventive care and early detection at primary care, genomics-guided diagnostics should lead the way towards universal health care.”\n\nGene-editing – hubris, hurt & hope\n\nUndeterred by the setback suffered by hurting startups in the gene-editing therapy space, Chandru, says, points to the much celebrated Gartner hype cycles and says, “the AI Winter (trough of disillusionment) started in mid-80s and the plateau of productivity came in 2009. In Bioinformatics, the trough of disillusionment came in 2003 and the plateau of productivity came 10 year later in 2013.\n\nWith the marketing machine that the world has been dominated by – every technology breakthrough goes through the Gartner Hype Cycle.” He then goes on to quote US-based physician-scientist Rene Mora, also described as an investor, banker and consultant, as saying: “we are in the third stage of the Gartner Hype Cycle (trough of disillusionment) when it comes to CRISPR technologies. Recovery to the next phase will rely on continued improvements in technology and most, importantly, finding the best applications.”\n\nSince therapeutics is a long gestation play, Chandru advocates and has adopted the approach of taking a parallel revenue stream through diagnostics products and gene-editing services play, which apparently also gets to be an attractive proposition for private equity.\n\nCAR-T & beyond\n\nTo him, the prospect of edited humans is not a fictional future but an inevitable reality with right ethical guard rails to ensure use for curative purposes only. He explains: “Let us discuss CAR-T (chimeric antigen receptor – T Cell) cell therapy, the fabulous immunotherapy for liquid cancers (like blood cancer), that has been seen as the cutting edge of cancer care. Within 8 years of the first approval Kymriah in 2017, we have two therapies in India approved and offered by ImmunoACT (result of a collaboration between Dr Rahul Purwar from IIT Bombay and Tata Memorial Hospital) and Immuneel (from a company backed by Biocon founder Kiran Mazumdar-Shaw and oncologist Siddhartha Mukherjee) at just around 50,000 USD which would be around 5-10 per cent of the comparable costs in the so-called innovator markets. The biotechnology and infrastructure requirements to go from CAR-T to gene therapy and on to gene-editing is just a hop, skip and jump away figuratively. Several teams in India are at it.”\n\nHe however reminds that “the third global-observatory on the ethics and social impact of gene-editing will be discussed at the American Academy of Arts and Sciences in Cambridge, Massachusetts in May 2025 and India will be well represented at the meeting.”\n\nStage of cancer does not matter\n\nOn cancer-care and the transformation in the approach to medicines, Dr B S Ajaikumar, a leading oncologist, founder and executive chairman, HealthCare Global Enterprises (HCG), “oncology is a constantly evolving space with changes happening every two to three months with new mutations and newer understanding.” This space has evolved significantly over the past five to 10 years, he says. “Earlier, drugs were given based on randomised trials. Now, the advances have been made in understanding the cancer cell in a particular individual and therefore focus is on designing a much more focussed therapy and personalised care. For example, there is targeted drug with chemotherapy – the antibody drug conjugate and newer drugs in this category- to make treatment precise and personalised.” Since each individual is different needing customised care, he says, “it is no more a broadly defined breast cancer or lung cancer but much more specific. Also, the stage of cancer, he says, “is no more a yardstick and does not matter really as people with stage four have also lived for many years.”",
      "publisher": "financialexpress",
      "url": "https://www.financialexpress.com/business/healthcare-end-of-medicine-as-we-know-it-3781077/",
      "imgURL": "https://www.financialexpress.com/wp-content/uploads/2025/03/mdicines.freepik.jpg",
      "date": null
    },
    {
      "news_number": 2,
      "title": "Google announces health-related AI summaries in Search",
      "content": "Google has announced health-related AI summaries in search so people can compare their health conditions with others experiences. Called ‘What People Suggest,’ it will put together comments from other patients with similar symptoms.\n\nFor example, someone with arthritis could search for exercises to alleviate the pain.\n\nThe feature will be available on mobile devices in the U.S. , per a company blog post.\n\nThe search giant has also expanded its knowledge panels that were for common health topics to cover thousands of health-related issues using AI. The information boxes or panels will now appear in more countries and languages including Spanish, Portuguese and Japanese for mobile users.\n\nThe company also announced TxGemma, a collection of Gemma-based open models that can improve AI-powered drug discovery by analysing structures of chemicals, proteins and molecules and helping researchers predict properties for potential new therapies.\n\n​In February, the FDA approved Google’s ‘Loss of Pulse Detection’ feature deployed in Pixel Watch 3. The feature detect a loss of pulse and automatically calls emergency service.\n\nThe search giant also launched an AI co-scientist, which is built on Gemini 2.0 to help biomedical researchers write novel hypotheses and plans.",
      "publisher": "thehindu",
      "url": "https://www.thehindu.com/sci-tech/technology/google-announces-health-related-ai-summaries-in-search/article69347733.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/3kvnq0/article69347715.ece/alternates/LANDSCAPE_1200/2025-02-25T180850Z_1004347677_RC2AF9ABA94E_RTRMADP_3_ITALY-ALPHABET-ANTITRUST.jpg",
      "date": "2025-03-19T06:38:06+00:00"
    },
    {
      "news_number": 3,
      "title": "Sunita Williams returns to Earth: Her health challenges have just begun",
      "content": "Nasa astronauts Sunita Williams and Barry \"Butch\" Wilmore have returned safely to Earth after being in space on an extended nine-month mission.\n\nThe Crew-9 splashed down near the coast of Florida (USA), marking the end of an unexpectedly long stay aboard the International Space Station (ISS).\n\nTheir mission, which began on June 5, 2024, was supposed to last only eight days. However, due to technical issues, they remained in space for more than nine months. Such prolonged exposure to space conditions can have lasting effects on both the astronauts.\n\nDrogue and main parachutes have deployed pic.twitter.com/X0wiXqFaPtSpaceX (@SpaceX) March 18, 2025\n\nadvertisement\n\nSHORT-TERM IMPACTS\n\nOne of the most concerning effects is bone and muscle health deterioration.\n\nIn microgravity aboard the ISS, astronauts float, and their bodies undergo significant changes. On Earth, gravity constantly engages muscles and bones, providing natural resistance. In space, without this force, muscles weaken, and bones lose density since they no longer bear weight.\n\nAstronauts can lose about 1% of bone mass per month, particularly in the lower spine, hips, and femur, raising fracture risks upon return. To counteract this, they follow a rigorous exercise routine, helping maintain strength and bone health during their mission.\n\nAstronauts can also grow a couple of inches taller in space as their spine elongates. However, this temporary height gain disappears once they are back on Earth, often accompanied by back pain as the spine readjusts.\n\nadvertisement\n\nSince astronauts float instead of walking, their feet experience little friction or pressure. This causes the protective calluses to soften. As a result, the skin on their feet becomes sensitive and peels off, resembling a “baby's feet”.\n\nTo recover from this, astronauts undergo a gradual reconditioning process. This includes walking barefoot on textured surfaces, receiving foot massages to relieve discomfort, and performing rehabilitation exercises to strengthen the muscles and skin of their feet.\n\nLong-term trips to the ISS, like the one Sunita Williams has taken, also cause significant changes in the cardiovascular system.\n\nOn Earth, gravity pulls bodily fluids such as blood, water, and lymph downward, keeping them evenly distributed. However, in microgravity, there is no gravitational pull, causing fluids to shift upward toward the head.\n\nThis fluid redistribution results in facial puffiness, Nasal congestion, and increased pressure inside the skull. At the same time, the lower body experiences a loss of fluids, making astronauts' legs appear thinner and weaker. This phenomenon is called \"puffy-head bird-legs syndrome”.\n\nTo counteract these, astronauts undergo rehabilitation. This includes physical exercises to stimulate blood flow, such as lower-body strength training and endurance workouts.\n\nIn the microgravity environment of the ISS, the heart does not have to work as hard as it does on Earth to pump blood against gravity. This reduced workload leads to structural changes in the heart. Studies have shown that astronauts’ hearts become about 9.4% more spherical during extended space missions.\n\nadvertisement\n\nWhile this shape change does not pose immediate health risks, it may reduce the heart's pumping efficiency, increasing the risk of cardiovascular issues upon returning to Earth. However, these alterations are typically temporary, and the heart gradually returns to its normal shape after re-exposure to Earth's gravity.\n\nLONG-TERM IMPACTS\n\nUnlike Earth, space offers no natural protection against high-energy cosmic radiation. Astronauts are exposed to high levels of radiation from the Sun. This is equivalent to about one chest X-ray per day during their stay in space.\n\nImagine, that in nine months, Sunita Williams would have been exposed to radiation levels equal to almost 270 chest X-rays.\n\nProlonged exposure to such high levels of radiation can weaken the immune system, damage tissues, and increase the risk of radiation sickness and cancer, posing serious long-term health risks for astronauts.\n\nEven after returning to Earth, bone density may take years to fully recover, and in some cases, astronauts never regain their pre-mission bone strength. This increases the risk of osteoporosis and fractures in later life.\n\nadvertisement\n\nSpending months in space can affect astronauts' mental health.\n\nThe environment aboard the ISS is vastly different from that on Earth. The ISS orbits Earth every 90 minutes, exposing astronauts to 16 sunrises and sunsets per day.\n\nThis disrupts their circadian rhythm (internal body clock) and affects their sleep patterns.\n\nAstronauts also experience isolation and confinement. They spend months in a small, enclosed space with a limited crew. The lack of personal space and social interaction can impact mental health.\n\nOver time, these conditions can cause depression, anxiety, and cognitive decline. Several studies show that long-duration space missions can impair the cognitive function of astronauts, affecting decision-making, reaction time, and emotional stability.\n\nBut astronauts are no ordinary people - they are amongst the mentally toughest and fittest human beings. In the past, they have defied all such ailments, often merely by their mental ruggedness.\n\nSplashdown of Dragon confirmed welcome back to Earth, Nick, Suni, Butch, and Aleks! pic.twitter.com/M4RZ6UYsQ2SpaceX (@SpaceX) March 18, 2025\n\nLet me give you an example. The person who has completed the longest stay in space on a single mission is Soviet cosmonaut Valeri Polyakov.\n\nHe spent approximately 437 days aboard space station Mir. Upon landing back on Earth, Polyakov opted not to be carried a few feet between the Soyuz landing capsule and a nearby chair, instead walking the short distance.\n\nadvertisement\n\nIn doing so, he wished to prove that humans could be physically capable of working on the surface of Mars.\n\nSunita Williams, who bravely completed an unscheduled 9-month stay in space, proves once again that human grit can achieve extraordinary achievements in the cosmos.\n\n(This is an authored article by Srijan Pal Singh. He is an author and an IIM Ahmedabad graduate, who was the Advisor for Policy and Technology to Dr. APJ Abdul Kalam, 11th President of India. He is the Founder and CEO of Dr. Kalam Centre and Homi Lab)\n\nPublished By: Sibu Kumar Tripathi Published On: Mar 19, 2025",
      "publisher": "indiatoday",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-returns-to-earth-her-health-challenges-have-just-begun-2695519-2025-03-19",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202503/sunita-williams-return-mission-181609730-16x9_1.jpg?VersionId=jwHv3nvOP5g4ByOPZvwtX9Tac2mVCLii",
      "date": "2025-03-19T00:00:00"
    }
  ],
  "Sports": [
    {
      "news_number": 0,
      "title": "The Battle for NHL’s MVP: Breaking down the 2025 Hart Memorial Trophy race",
      "content": "Image via Imagn Images\n\nGoal scorers and goaltenders shine in the Hart Trophy hunt\n\nThe race for the 2025 Hart Memorial Trophy is heating up, with several top NHL players making a strong case for the league’s most valuable player award. Each contender has delivered exceptional performances, keeping their teams in playoff contention.From elite goal scorers to dominant goaltenders, each contender has played a crucial role in their team’s success. As the season nears its final stretch, the battle for the prestigious trophy remains intense, with every game carrying significant weight in determining the ultimate winner.Leon Draisaitl of the Edmonton Oilers is leading the NHL in goals and is on pace for one of his best seasons. His consistent offensive production has been crucial for Edmonton, making him a strong favorite for the Hart Trophy.Winnipeg Jets’ goaltender Connor Hellebuyck has been a standout performer, leading the league in key goaltending stats. His ability to keep Winnipeg competitive in tight games has made him a legitimate MVP candidate.Reigning Hart Trophy winner Nathan MacKinnon continues to dominate, leading the league in points per game. His playmaking ability and leadership have been instrumental in the Colorado Avalanche’s success, positioning him for a potential repeat win.Connor McDavid, despite battling injuries, remains one of the most electrifying players in the league. While his chances have taken a hit, his recent performances suggest he could still make a late push for the award.Kirill Kaprizov of the Minnesota Wild has also emerged as a key contender, leading his team’s offense with consistent scoring and playmaking. His contributions have been vital in keeping Minnesota in the playoff hunt.Also Read: “I'm getting choked up”: Devils GM Tom Fitzgerald pushes for safety after son’s terrifying neck injury As the season nears its conclusion, the race for the Hart Trophy remains wide open, with the final stretch of games likely to determine the winner.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/sports/nhl/news/the-battle-for-nhls-mvp-breaking-down-the-2025-hart-memorial-trophy-race/articleshow/119198234.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-119198224,width-1070,height-580,imgsize-20622,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 1,
      "title": "Scores & Fixtures",
      "content": "We have no events to show on this date\n\nAll times are UK and subject to change. BBC is not responsible for any changes.",
      "publisher": "bbc",
      "url": "https://www.bbc.com/sport/cricket/scores-fixtures",
      "imgURL": "https://static.files.bbci.co.uk/core/website/assets/static/sport/bbc-sport-logo.0da9386782.png",
      "date": null
    },
    {
      "news_number": 2,
      "title": "India take on Maldives in international friendly: Indian sports LIVE, March 19",
      "content": "Open Extended Reactions\n\nAs action packed as Indian sport can get it, it's easy to miss out on important news and results. That's where we come in -- ESPN India's daily Indian sports blog has all the updates from the world of Indian sports as well as the news, scores, schedule, results and commentary that comes with it.\n\nMarch will see Indian athletes in action across leagues. You can see details of other events in our 2025 sporting calendar.\n\nHere are all the updates from March 19, 2025.\n\nWhat's on today?\n\nIndian football: India take on Maldives in an international football friendly at 7:30 PM. The big talking point here, of course, is the return from retirement of Sunil Chhetri.\n\nBadminton: A bunch of Indians are in action at the ongoing Swiss Open Super 300.\n\nWhat happened yesterday?",
      "publisher": "espn",
      "url": "https://www.espn.in/espn/story/_/id/44304312/india-vs-maldives-football-live-news-scores-results-updates-indian-sports-march-19-2025",
      "imgURL": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0720%2Fr1360926_1296x729_16%2D9.jpg",
      "date": null
    }
  ],
  "Finance": [
    {
      "news_number": 0,
      "title": "Bajaj Housing Finance shares surge 6%; Here is why April 15 is key for the stock",
      "content": "Shares of Bajaj Housing Finance Ltd., a Bajaj Group company and a unit of Bajaj Finance Ltd . are trading with gains of as much as 6% on Wednesday, March 19, extending their gains for the second day in a row.The stock is up 14% in the last one month and has nearly turned positive for the year so far.Although the stock continues to trade well above its IPO price of ₹70, it is still 34% below its post-listing high of ₹188, despite the recent recovery.All eyes are on the management of its parent company Bajaj Finance as the term of its MD & CEO Rajeev Jain comes to an end on March 31. Although he has maintained that he will continue to remain with the business, his role post the end of his term remains unclear.In an exclusive interaction with CNBC-TV18 on Tuesday, Bajaj Finserv Chairman and Managing Director Sanjiv Bajaj highlighted that the board of Bajaj Finance will meet over the next couple of days and take a call on Rajeev Jain's role in the group and that he remains committed to the business and the group overall.In light of this, Morgan Stanley came out with a scenario analysis on where will shares of Bajaj Finance head based on the outcome of Rajeev Jain's future. You can read more on that here. An important date for Bajaj Housing Finance going forward will be April 15, as that is when its one-year shareholder lock-in period will end.According to a note from Nuvama Alternative and Quantitative Research, as many as 529 crore shares of Bajaj Housing Finance, or 64% of its outstanding equity will become eligible to trade as the shareholder lock-in ends.It needs to be specified that the end of the shareholder lock-in does not mean all the 529 crore shares will be sold that day itself but they only become eligible to be traded.As many as 50% or five out of the 10 analysts that have coverage on Bajaj Housing Finance have a \"sell\" recommendation on the stock. Three of them have a \"buy\" rating, while one analyst has a \"hold\" call. A consensus estimate of these 10 analysts is projecting a potential downside of 15% for the stock going forward.Shares of Bajaj Housing Finance are trading 5.7% higher at ₹124.35.",
      "publisher": "cnbctv18",
      "url": "https://www.cnbctv18.com/market/bajaj-housing-finance-share-price-surge-rajeev-jain-future-april-15-key-post-ipo-high-19575684.htm",
      "imgURL": "https://images.cnbctv18.com/uploads/2024/12/stock-market-2024-12-b28808ac008b680321649e163e6cf702.jpg?im=FitAndFill,width=500,height=300",
      "date": "2025-03-19T11:08:19+05:30"
    },
    {
      "news_number": 1,
      "title": "Life after Bajaj: Allianz fast tracks plans of new alliance with Jio Financial",
      "content": "It seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.",
      "publisher": "m",
      "url": "https://m.economictimes.com/industry/banking/finance/insure/allianz-se-eyes-partnership-with-jio-financial-after-ending-24-year-tie-up-with-bajaj/articleshow/119175811.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-119185470,width-1200,height-630,imgsize-30594,overlay-economictimes/articleshow.jpg",
      "date": null
    },
    {
      "news_number": 2,
      "title": "Closing Bell: Market makes it 3 in a row; Nifty above 22,900, Sensex up 148 points",
      "content": "March 19, 2025 / 16:11 IST\n\nAfter showing an excellent upside breakout on Tuesday, Nifty continued with follow-through upside momentum on Wednesday and closed the day higher by 73 points. After opening with a positive note, the market shifted into a gradual upmove amidst range bound movement in the early to mid-part of the session. There was a minor intraday consolidation movement at the highs towards the end and Nifty closed near the highs.\n\nA small positive candle was formed on the daily chart which indicates a breather type market movement after a stellar performance in the previous session. Though, Nifty showed minor upmove on Wednesday, the overall market breadth was very strong with outperformance seen in broad market indices.\n\nNifty is currently nearing a crucial overhead resistance of around 23000-23100 levels (down sloping trend line connected from the highs of Sept and Dec 24). This is going to be an important hurdle for the market and there is a possibility of some more consolidation or minor dip from the highs in the next 1-2 sessions. Immediate support is placed around 22800-22750 levels.",
      "publisher": "moneycontrol",
      "url": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-19-03-2025-liveblog-12968743.html",
      "imgURL": "https://images.moneycontrol.com/static-mcnews/2025/03/20250319092815_Sensex_up_nifty_airline.jpg",
      "date": "2025-03-19T07:33:21+05:30"
    },
    {
      "news_number": 3,
      "title": "No plan to merge PSBs; recovery from written-off loans improved: Finance Ministry",
      "content": "No merger or amalgamation of Public Sector Banks (PSBs) is on the cards, the Finance Ministry informed Rajya Sabha on Tuesday. It also presented data showing an improvement in PSBs’ recovery from written-off loan accounts.\n\n“Currently, there is no such proposal under consideration of the Government in this regard,” Minister of State in the Finance Ministry Pankaj Chaudhary said in a written response when asked whether the Government has plans to disinvest four PSBs with any foreign or private banks, or to merge with larger banks by 2026.\n\nThis statement is significant in the backdrop of the Budget announcement in 2021, when Finance Minister Nirmala Sitharaman had proposed to take up the privatisation of two PSBs. She had said that legislative steps would be taken to facilitate privatisation. Till date, however, there has not been any development on this front. At the same time, strategic disinvestment of IDBI Bank is yet to be completed.\n\nAs on date, there are 12 PSBs. The last consolidation had taken place in August, 2019, when the government had announced four major mergers of PSBs, bringing down their total number to 12 from 27 in 2017 – a move aimed at making State-owned lenders global-sized banks.\n\nWilful defaulters decline\n\nMeanwhile, Chaudhary highlighted improved performance of PSBs in terms of gross non-performing assets (GNPA), which have declined to ₹3.39 lakh crore (GNPA ratio 3.47 per cent) in March, 2024, from ₹6.78 lakh crore (GNPA ratio 10.25 per cent) in March, 2020. Moreover, an increase in the number of wilful defaulters, having an aggregate exposure of ₹5 crore and above, has declined to 47 in March, 2024, from 193 in March, 2020, he said.\n\nTalking about writen-off non-performing assets (NPAs), including those in respect of which full provisioning has been made on completion of four years, Chaudhary reiterated: “Such write-off does not result in waiver of liabilities of borrowers and therefore, it does not benefit the borrower.” Further, the borrowers continue to be liable for repayment and banks continue to pursue recovery actions.\n\n“Banks evaluate/consider the impact of write-offs as part of their regular exercise to clean up their balance sheet, avail tax benefit and optimise capital, in accordance with RBI guidelines and policy approved by their Boards,” Chaudhary said.\n\nNo respite\n\nHe also highlighted that recovery in written-off loans is an ongoing process. Banks continue pursuing their recovery actions initiated against borrowers under the various recovery mechanism available to them, such as filing of a suit in civil courts or in Debts Recovery Tribunals, action under the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act, filing of cases in the National Company Law Tribunal under the Insolvency and Bankruptcy Code, etc.\n\nData included in the response showed that significant amount is being written off by PSBs, and that recovery from such accounts have also improved. While, in fiscal year 2021-22, over 21 per cent as percentage of written-off loan amount could be recovered, it improved to around 28 per cent and 33 per cent in the following two years. Recovery ratio in the current fiscal is around 47 per cent.",
      "publisher": "thehindubusinessline",
      "url": "https://www.thehindubusinessline.com/economy/no-plan-to-merge-psbs-recovery-from-written-off-loans-improved-finance-ministry/article69344787.ece",
      "imgURL": "https://bl-i.thgim.com/public/incoming/96nydc/article69324591.ece/alternates/LANDSCAPE_1200/IMG_bl01_counting_2_1_SPE0OSQ7.jpg",
      "date": "2025-03-18T13:38:02+00:00"
    }
  ],
  "Geopolitical": [
    {
      "news_number": 0,
      "title": "Changing geopolitics gets a special mention at HP’s Amplify conference in Nashville",
      "content": "As the global race for AI dominance and quantum supremacy intensifies, technology companies are playing an increasingly significant role in geopolitics. This shift reflects a changing world order, where techno-nationalism and techno-geopolitics may shape the evolving relationship between technology and politics.\n\n“We think that we are moving from a global station model to a regional station model, where products will be built regionally, distributed digitally, and eventually designed regionally to better meet the needs of specific regions,” Enrique Lores, President and CEO of HP Inc., said, addressing an audience of thousands of partners from around the world at the company’s Amplify conference in Nashville, Tennessee. “That’s a very significant change that we see happening in the world, and a change that finds us in a very strong position.”\n\nLores stated that the globalisation model has changed, and it’s no longer about building factories in one location and selling products worldwide. “We started working on this more than three years ago. During this time, we have significantly diversified our supply chain network. We now have factories in many different parts of the world,” he added.\n\nStory continues below this ad\n\n“The biggest challenge is the uncertainty about how things will evolve. I think the trend from globalization to more regional models is very clear. We are already seeing this shift on the supply chain front, and it will likely have a significant impact on design and marketing down the road. However, this is a trend we know how to navigate, and it’s something we’ve been very successful at for many years,” he continued.\n\nLores’s comments come at a time when the world’s biggest technology firms are facing an inflection point, forcing them to strengthen and diversify their supply chains and establish manufacturing bases in Vietnam, India, and Thailand, reducing their dependence on China.\n\nWhile China remains a massive part of the global supply chain, there is increasing pressure from other countries, including India, to boost local manufacturing and supply chains. (Image credit: Anuj Bhatia/Indian Express) While China remains a massive part of the global supply chain, there is increasing pressure from other countries, including India, to boost local manufacturing and supply chains. (Image credit: Anuj Bhatia/Indian Express)\n\nThe biggest risk to tech companies, however, is geopolitics. US President Donald Trump wants to bring manufacturing back to the US in an effort to reduce reliance on foreign nations like China. The Trump administration has imposed a 10 per cent levy on China-made goods such as smartphones, laptops, and tablets. While China remains a massive part of the global supply chain, there is increasing pressure from other countries, including India, to boost local manufacturing and supply chains. Major smartphone brands are already producing devices in India, and PC companies, including HP, are committed to assembling laptops in the country.\n\nA full manufacturing shift from China would take years, but it also comes with drawbacks. A dramatic shift could upset Beijing, which allows some US-based companies to do business freely while restricting many foreign entities. Additionally, moving supply chains from China to other countries is complex, as achieving the same level of quality elsewhere is challenging.\n\nStory continues below this ad\n\nStill, US tech companies are gradually shifting production for some devices to other locations, such as Brazil, Thailand, and India. Similar moves are also being made by their key chipmaker partner, Taiwan Semiconductor Manufacturing Co. (TSMC), which plans to expand manufacturing in Arizona, bringing it closer to Made-in-the-USA processors.\n\nPC vendors such as HP, along with their chipmakers like PC vendors such as HP, along with their chipmakers like Intel and Qualcomm, are heavily leaning into AI. (Image credit: Anuj Bhatia/ Indian Express\n\nBut beyond manufacturing, it is artificial intelligence that is shaking up power dynamics, with the US and China asserting their dominance and sparking a digital race. The US has been a frontrunner in the AI race, but earlier this year, the sudden emergence of DeepSeek, a relatively unknown Chinese artificial intelligence startup, disrupted AI development. DeepSeek’s model runs at a lower cost and combines the same method more effectively than US companies did.\n\n“Developments like DeepSeek just confirm that AI is going to be available not only in the cloud, but also in any area where we will really take advantage of what can be done in the end,” Lores said while launching a new lineup of AI PC portfolio.\n\nPC vendors such as HP, along with their chipmakers like Intel and Qualcomm, are heavily leaning into AI. They see the future in artificial intelligence and are hoping for the emergence of a new type of interface on PCs—one where interaction through multimodal inputs, such as your voice, and the assistant will act as an agent, performing tasks for you.\n\nStory continues below this ad\n\nAs AI models deliver more reasoning capabilities in smaller packages, these PC companies are betting that these models will be able to run on your computers. “We are focused on bringing AI to the edge and making sure that our customers can run AI models, including large language models, on their PCs and across the rest of the portfolio to take advantage of them at a lower cost, with higher privacy and security, and faster. That’s the strategy we have,” he said.\n\nIn his keynote, Lores talked about how the AI landscape is changing, including software development, technology, and the expectations of consumers. “There is a huge business opportunity that is going to be open to all of us to help our customers build these models,” he said, adding that the innovation will start on the commercial side but will eventually extend to the consumer side as well.”\n\n(Disclaimer: The writer is in Nashville, Tennessee, attending the Amplify conference at the invitation of HP.)",
      "publisher": "indianexpress",
      "url": "https://indianexpress.com/article/technology/tech-news-technology/changing-geopolitics-gets-a-special-mention-at-hps-amplify-conference-in-nashville-9893394/",
      "imgURL": "https://images.indianexpress.com/2025/03/HP-event.jpg",
      "date": "2025-03-19T08:45:24+05:30"
    },
    {
      "news_number": 1,
      "title": "Gold hits record high over $3,000 amid rising geopolitical tensions; Thames Water receives six takeover offers – as it happened",
      "content": "From 1d ago 07.39 GMT Gold hits record high over $3,000 amid geopolitical tensions and weakening US dollar Good morning, and welcome to our rolling coverage of business, the financial markets and the world economy. It’s been a record-breaking year for gold, as nervous investors have sought out safe-haven assets. And this morning, the precious metal has hit a fresh all-time high above $3,000 per ounce, driven by escalating geopolitical tensions in the Middle East, trade war fears and the weakening US dollar. Gold touched $3,017.64 per ounce, as news broke that Israeli military forces have launched widespread strikes on targets across Gaza early today, leading to fears that the shaky ceasefire in the region is over. This means gold has climbed by 15% since the start of this year, having ended December at $2,623/ounce, adding to its 27% surge during 2024. As this chart shows, it has now doubled over the last five years: A chart showing the gold price since 2020 Photograph: LSEG The recent weakness of the US dollar has also pushed up the gold price. The greenback is trading near a five-month low against a basket of other currencies, as traders worry that Donald Trump’s enthusiasm for tariffs will trigger a full-blown trade war, that could push the US into recession. As analysts at Deutshe Bank put it: Investors continue to rotate away from the US dollar and find perceived safe havens amidst the heightened policy uncertainty. Linh Tran, market analyst at XS.com, reports that rising tensions in the Middle East and the escalating U.S.-China trade conflict have both driven investors toward gold as a safe investment channel, adding: These uncertainties have not only increased demand for gold but have also pushed significant capital inflows into the precious metals market, contributing to gold reaching record-high prices. The agenda 9.30am: ONS releases changes to the UK inflation basket\n\n10am GMT: ZEW eurozone economic confidence survey\n\n12.30pm GMT: US housing starts/building permits data for February\n\n1.15pm GMT: US industrial production for February Share Updated at 07.46 GMT\n\n21h ago 15.10 GMT Back on bosses’ earnings… the CEO of Centrica’s pay packet has almost halved. Chris O’Shea received £4.322m last year, the company’s annual report shows, down from £8.231m in 2023. The decline was due to a lower bonus – O’Shea’s variable remuneration declined to £3.376m, down from £7.328m last year. Two years ago, O’Shea admitted that a £4.5m pay packet was “impossible to justify”. Boss of British Gas owner says it is ‘impossible to justify’ his £4.5m pay Read more Share\n\n21h ago 15.04 GMT Back in Berlin, Germany’s outgoing parliament has passed a massive increase in government borrowing, including a sweeping change to the country’s debt rules. The legislation now goes to the Bundesrat upper house, which represents Germany’s 16 states, and is set to vote on Friday. 🇩🇪 Wir haben es geschafft. — Frederik Ducrozet (@fwred) March 18, 2025 Robin Winkler, chief German economist at Deutsche Bank Research, says: “After much nail-biting over the last fortnight, Germany’s outgoing parliament today decided to reform the constitutional debt brake. In our view, this is a historic fiscal regime shift, arguably the largest since German reunification. Yet, as with reunification, a fiscal expansion does not guarantee success: the next government will need to deliver structural reforms to turn this fiscal package into sustainable growth.” Our Europe liveblog has all the action: Germany votes on debt break amid Ukraine fears as Putin-Trump call set to take place – Europe live Read more Share Updated at 15.11 GMT\n\n22h ago 14.35 GMT Top bosses' pay soars at Reach Mark Sweney Bosses at the publisher of the Mirror, Express and Star newspapers took home more than £2m in pay and bonuses last year, angering staff who were awarded a few hundred pounds each following a boost in profits last year. Jim Mullen, the chief executive of Reach, the owner of more than 100 news brands including the Manchester Evening News, the Birmingham Mail and the Liverpool Echo, received total remuneration of £1.25m last year. His pay packet was sweetened by a maximum bonus of £662,000 after the company boosted operating profit by 6% to £102m last year. According to Reach’s annual financial report Mullen was paid 35 times that of an employee in the 25th percentile, the lower end of the company’s pay structure. Darren Fisher, Reach’s finance chief, received £857,000 including a £378,000 bonus. Following deep cuts affecting more than 800 staff Reach struck a deal to boost employee pay by 5% last year, and a £600 bonus payment this month as part of the company’s profit share scheme. Management is currently in negotiations with the National Union of Journalists over a proposed 2% increase this year, while any increase in the base salary of Mullen and Fisher will be decided on 1 April. The NUJ said that in light of the publication of top executive pay Reach should reconsider its pay offer. “It is good news that the business has turned around its key digital revenues and has improved its operating profits out of which these bonuses will be paid,” said Reach’s NUJ chapel. “But this was done on the back of heroic efforts by employees to dramatically increase the number of stories going online and by those in print outperforming the market with threadbare resources thanks to significant redundancies.” Share Updated at 14.35 GMT\n\n22h ago 14.16 GMT Fund managers make record shift out of US stocks Donald Trump appears to have triggered a stampede out of the US stock market. Bank of America’s March Global Fund Manager Survey has found there was a record rotation out of US stocks by fund managers this month, as investor sentiment was hit by fears of a trade war and possible US recession. BofA reports there has been a “bull crash” in fund manager sentiment this month, with March seeing the second biggest drop in global growth expectations ever, the biggest drop in US equity allocation ever, and the biggest jump in cash allocation since Marcn 2020. View image in fullscreen Photograph: BofA This is reflected in market prices this year – the S&P 500 share index is down 4.5% during 2025, while Europe’s Stoxx 600 has jumped 9%. Share\n\n23h ago 13.47 GMT Gold hits new high: $3,038 Back in the financial markets, the US dollar has shaken off its earlier losses – pulling the pound down to $1.296. Gold, though, is undaunted, and has now touched a new all-time high of $3,038 per ounce, up 1% today, thanks to a cocktail of Middle East tensions, US trade war fears, and the ongoing scamper into safe-haven assets. Share Updated at 13.48 GMT\n\n23h ago 13.32 GMT CMA to consider water company demands for even higher bills The news that Thames Water has received six takeover proposals since last summer comes as regulator Ofwat asks the competition watchdog to consider requests from several other water companies to lift their bills even higher than has been allowed. Ofwat is referring redetermination requests from Anglian Water, Northumbrian Water, South East Water, Southern Water and Wessex Water to the Competition and Markets Authority (CMA). The five companies are all challenging Ofwat’s ruling last year about how they can raise their bills between 2025 and 2030, arguing that the increase – 36% on average across the industry – wasn’t enough to invest in pipes, drains, reservoirs and treatment works. Ofwat defends its decisions, saying: The increase in investment means that customers’ bills will increase from 1 April; many customers are already expressing concerns about the level of increase. While the companies have not yet set out the details of their reasons for appealing, their initial statements highlight the need for additional funding beyond the substantial increase already allowed. This would mean a further increase in bills for customers. Interestingly, the regulator has also agreed a request from Thames Water to defer its referal to the CMA for up to 18 weeks. That delay, Thames says, will give it time to potentially “unlock a market-led solution for the recapitalisation of the Company” (presumably through one of the six offers on the table). Share\n\n23h ago 13.18 GMT Thames Water: We've received six takeover approaches View image in fullscreen A sign displaying the Thames Water logo in London Photograph: Neil Hall/EPA Thames Water has revealed it has received six approaches from potential suitors. The struggling utility, which has been on the verge of collapse for months, says it has received proposals from six parties in response to a fundraising process launched in 2024, and that it “has since been conducting a detailed assessment of each proposal”. Thames says that many of the proposals included its bond holders taking a hit: The proposals involve a range of potential valuations, structures and outcomes for stakeholders. Of the five proposals that provided financial metrics, all except one (from a Class B Creditor and with significant conditions attached) indicated a material impairment of the Class A debt. The sixth proposal was for minority equity, intended to partner with investors, and did not set out financial metrics. In certain of the contemplated proposals, relevant creditors would receive – in exchange for debt impairment – certain rights to share in future growth in the value of the Company, and/or will have the ability to co-invest in the business. Thames adds that most of the proposals are conditional on the company achieving various “regulatory support and accommodations” – a nod to its financial and operational problems, from a £19bn debt pile to crumbling infrastructure. It explains: Discussions with relevant parties are ongoing, although there is no certainty that a binding equity proposal will be forthcoming or that any such proposals will be capable of being implemented. As a result, certain senior creditors continue to progress in parallel alternative transaction structures to seek to recapitalise the business. Thames does not name any of its suitors. But in December, the company received a £5bn bid from infrastructure investor Covalis Capital. Struggling Thames Water receives £5bn buyout offer from Covalis Read more News of the six takeover approaches comes a day after the UK court of appeal has upheld an emergency debt package worth up to £3bn. That debt should keep Thames operating for a few months while efforts to recapitalise it are progressing. The Guardian reported last week that Thames Water is asking to be spared billions of pounds of costs and fines over the next five years and heap more on to bills so it can attract new investors. The company is hoping to persuade the regulator Ofwat to grant it significant leniency on penalties and extra costs, to help woo bidders. Thames Water begs to be spared fines and costs, warning bidders will walk away Read more Share Updated at 14.33 GMT\n\n23h ago 13.06 GMT South Yorkshire taking buses into public control Gwyn Topham View image in fullscreen The Sheffield Meadowhall Interchange. Photograph: Nigel Greenstreet/Alamy South Yorkshire has become the latest combined authority to announce it will take buses into public control. Mayor Oliver Coppard has followed his fellow metro mayors in the north in deciding to pursue bus franchising to improve local services. Today’s decision came after a public consultation in which the authority said nearly 90% of 7,800 respondents backed local authority control of buses. South Yorkshire will, like Greater Manchester, West Yorkshire and Liverpool, now take control of the bus network - including depots and vehicle fleets, and setting routes, timetables, ticketing and fares. Buses are expected to operate under the new system from September 2027. Coppard said the move was “turning back the tide on the failed experiment of the privatisation of our bus network that was started in the 1980s, putting the public back into public transport.” He added: “Over the last forty years we’ve seen public transport taken apart; fares go up, routes and passenger numbers go down, and our city centres, our high streets and our economy flatline. “I want us to build a bigger and better economy in South Yorkshire and we need a public transport system that allows people to get to where they want to go, when they want to go there. “The destination is a fully integrated transport system across Barnsley, Doncaster, Rotherham and Sheffield, one that works in the interests of our communities and our economy, putting people back in control of essential services.” It is expected to have new branding, covering buses and trams and other public transport, much like Manchester’s Bee Network. Manchester to launch ‘revolutionary’ Bee Network public bus system Read more Share Updated at 13.07 GMT",
      "publisher": "theguardian",
      "url": "https://www.theguardian.com/business/live/2025/mar/18/gold-hits-record-high-over-3000-geopolitical-tensions-weakening-us-dollar-oil-stock-markets-inflation-business-live-news",
      "imgURL": "https://i.guim.co.uk/img/media/a2595d78a09ddd645ff4812a3a80dd45cfa663b9/0_804_4001_2401/master/4001.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=978bd3039b4d3054e23d8ee9811ed0b2",
      "date": "2025-03-18T00:00:00"
    },
    {
      "news_number": 2,
      "title": "Oil holds drop with US stockpile climb and geopolitics in focus",
      "content": "Oil held a decline as an industry report pointed to a build in US crude stockpiles, while geopolitical concerns continued to fester.Global benchmark Brent was near $70 a barrel after losing 0.7% on Tuesday, while West Texas Intermediate traded below $67. The American Petroleum Institute said nationwide inventories rose by 4.6 million barrels last week, although a draw was seen at the key hub in Cushing, Oklahoma.Geopolitical concerns over Russia and Iran remained in focus. US President Donald Trump pressed Iran to rein in the Houthis, viewing attacks from the Yemeni militant group as if Tehran were directly responsible. Russian President Vladimir Putin, meanwhile, declined Trump’s bid for a ceasefire in Ukraine, agreeing instead to limit attacks on the country’s energy infrastructure.Investors will also watch for the US Federal Reserve interest-rate decision later on Wednesday, plus commentary from Chair Jerome Powell on the outlook as Trump amps up his trade war. There’s been a risk-off tone in wider markets recently amid concerns about a slowdown, with a selloff in equities.Crude remains markedly lower from a peak in January, as a slew of bearish drivers combines to pressure prices. On the supply side, OPEC and its allies are preparing to increase production, while the escalating trade frictions are threatening a hit to demand just as flows into top importer China remain weak.",
      "publisher": "cnbctv18",
      "url": "https://www.cnbctv18.com/market/oil-holds-drop-with-us-stockpile-climb-and-geopolitics-in-focus-19575580.htm",
      "imgURL": "https://images.cnbctv18.com/uploads/2024/11/crude-oil-2024-11-2a8bfe0484b97a4fdbda6225f33e22f9.jpg?im=FitAndFill,width=500,height=300",
      "date": "2025-03-19T06:49:52+05:30"
    }
  ],
  "Crypto": [
    {
      "news_number": 0,
      "title": "Here’s why Pi Network, Jasmy, LTC, Ethena, and altcoins are down",
      "content": "Cryptocurrency prices resumed their downward trend on Tuesday as market participants awaited the second Federal Reserve interest rate decision of the year.\n\nPi Network (PI), the viral tap-to-earn token, was one of the worst performers, dropping by almost 13%. JasmyCoin (JASMY) dropped by 6%, while Litecoin (LTC) and Ethena (ENA) fell by over 5%.\n\nThe total market cap of all cryptocurrencies fell 1.70% to $2.7 trillion, wiping out more than $1 trillion in value over the past few months. Total liquidations in the last 24 hours climbed to over $227 million.\n\nThe crypto sell-off coincided with a stock market downturn. The Dow Jones index dropped 410 points, while the tech-heavy Nasdaq 100 fell 350 points. Top blue-chip stocks like NVIDIA, Tesla, Microsoft, and Apple each dropped by over 1%.\n\nYou might also like: USTC price wavers as LUNC community votes to make it a meme coin\n\nJasmy, Pi Network, LTC, and Ethena slip ahead of FOMC decision\n\nThe ongoing crypto and stock market crash is because the market is adjusting to the upcoming Federal Reserve or FOMC interest rate decision. It has already started its two-day meeting, with the final decision expected on Wednesday.\n\nThe Fed is expected to leave interest rates unchanged at 4.50%. However, traders will closely watch the quarterly dot plot, which provides clues about the timing of the next rate cut.\n\nStocks and crypto investors hope that the recent sell-off and the rising fear of a recession will prompt some Fed official to turn dovish. A Fed put would be a catalyst for Bitcoin (BTC) and altcoins like Pi Network, Ethena, Jasmy, and Litecoin. In a note to Bloomberg, an analyst said:\n\n“The ongoing trade tensions and tariff implementations have introduced significant uncertainty. Investors are eager to understand how these policies are influencing the Fed’s economic outlook, especially concerning inflation and growth projections.”\n\nBitcoin and these altcoins also declined after Ki Young Ju, a popular analyst and the founder of CryptoQuant warned that the bull market was over. He said:\n\n“I’ve been calling for a bull market over the past two years, even when indicators were borderline. Sorry to change my view, but it now looks pretty clear that we’re entering a bear market.”\n\nOn the positive side, a more dovish Fed stance could boost Bitcoin and altcoins — similar to the market reaction during the onset of the COVID-19 pandemic. At that time, cryptocurrencies initially crashed but rebounded strongly after the Fed slashed interest rates.",
      "publisher": "crypto",
      "url": "https://crypto.news/heres-why-pi-network-jasmy-ltc-ethena-and-altcoins-are-down/",
      "imgURL": "https://crypto.news/app/uploads/2024/09/crypto-news-Pi-Network-option08.webp",
      "date": "2025-03-18T17:39:23+00:00"
    },
    {
      "news_number": 1,
      "title": "Crypto doomsday? Former Binance CEO Changpeng Zhao predicts 95% of crypto investors will fail, only a few will survive the market’s future",
      "content": "EmperorBTC’s Breakdown: The “Tourist” Problem\n\nCZ’s Warning: Bitcoin’s Unmatched Simplicity\n\nWhy This Matters\n\nLive Events\n\nFAQs:\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our Economic Times WhatsApp channel\n\nFormer Binance CEO Changpeng Zhao (CZ) delivered a sobering take on the crypto market this week, arguing that only a sliver of participants will thrive in the long run. Responding to a viral X post by crypto influencer EmperorBTC , who dissected investor psychology, CZ doubled down on his view that even knowledgeable traders struggle to outpace Bitcoin—let alone the majority who he claims lack strategy or discipline.EmperorBTC sparked the conversation by claiming the bar to succeed in crypto is deceptively low. He categorized 80% of investors as “tourists” who chase hype and exit at the first sign of volatility. Another 10%, he argued, blindly follow “foolish influencers,” while 5% fake wealth to appear successful. That leaves just 5% who truly understand the market—a group CZ says still can’t reliably beat Bitcoin ’s returns.CZ countered that even within that elite 5%, only a fraction (roughly 4%) actively trade or fund blockchain projects—and most still underperform Bitcoin. He emphasized that passive, long-term Bitcoin holders “outperform 99% of crypto participants” and traditional assets like stocks with minimal effort. However, reaching the top 1%, he noted, demands “extraordinary effort,” niche expertise, and emotional resilience to avoid impulsive moves.The commentary comes as Bitcoin hovers near $83,000, testing the critical $85,000 resistance level amid record outflows from crypto investment products. Analysts attribute the volatility to macroeconomic uncertainty and regulatory pressures, but CZ’s stance reinforces Bitcoin’s reputation as a “set-and-forget” asset compared to riskier altcoins.CZ’s critique isn’t just philosophical—it’s a reflection of his decade-long journey building Binance into a crypto titan. His warnings echo growing concerns about speculative trading and influencer-driven hype in a market still recovering from scandals like FTX. Meanwhile, Bitcoin’s resilience continues to validate its role as a digital gold standard, even as newer projects fight for relevance.He argues that the majority lack a disciplined strategy, chase short-term trends, or rely on unreliable influencers, whereas Bitcoin’s steady growth historically outshines active trading.It requires deep market insight, relentless research, and the ability to ignore noise—qualities most investors lack due to emotional decision-making or impatience.",
      "publisher": "m",
      "url": "https://m.economictimes.com/news/international/us/crypto-doomsday-former-binance-ceo-changpeng-zhao-predicts-95-of-crypto-investors-will-fail-only-a-few-will-survive-the-markets-future/articleshow/119177170.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-119177158,width-1200,height-630,imgsize-414212,overlay-economictimes/articleshow.jpg",
      "date": null
    },
    {
      "news_number": 2,
      "title": "Why Cathie Wood believes most memecoins ‘not going to be worth much’; Bitcoin price today, and more…",
      "content": "Influencial American investor Cathie Wood, the founder and CEO of ARK Investment Management (ARK Invest) believes that a majority of memecoins circulating in the $2.6 trillion worth cryptocurrency market, will likely be “worthless”, Bloomberg reported.\n\nSpeaking to Bloomberg TV on March 18, Cathie Wood said that the influx of blockchain technology and artificial intelligence (AI) has facilitated “millions” of memecoins that “are not going to be worth much”.\n\nMemecoins are a type of crypto tokens inspired by jokes, current events or popular culture. One example is billionaire Elon Musk's favoured Dogecoin and US President Donald Trump's self named token.\n\nWhat Does Cathie Wood Advice Investors on Crypto? The report further noted that Cathie Wood said that her private funds are not keen on such coins, and adviced: “If I have one message for those listening who are buying memecoins: buyer beware. There’s nothing like losing money for people to learn, and they’ll learn that the SEC and regulators are not taking responsibility for these memecoins.”\n\nShe added, “Memecoins will become digital collectors’ items. Some will withstand the judgment of time (but most wont).”\n\nOn established digital crypto assets such as Bitcoin and Ether, Cathie Wood was bullish. “The use cases for Bitcoin, Ether and Solana are multiplying and will become important in the future,” she said.\n\nAmong Cathie Wood's prediction for Bitcoin is the belief that the world's biggest cryptocurreny will surpass $1 million by 2030.\n\nBitcoin Price Today — Crypto Market Update on March 19, 2025 As of 1.50 pm on March 19, Bitcoin is at $83,355.43 apiece, up 0.28 per cent from the previous day, according to data on CoinMarketCap. Market capitalisation of the token was at $1.65 trillion with trading volume of $23.16 billion.\n\nSecond biggest coin Ether, was at $1,937.82, up 1.80 per cent day-on-day, with market cap of $233.75 billion and trade volume of $10.61 billion, the CoinMarketCap data showed.\n\nAccording to CoinSwitch Markets desk, Bitcoin failed another attempt to break above the $85,000 resistance level, shedding 0.7 per cent in the past 24 hours. The price dropped to a low of $81,207 before recovering just over $83,000.\n\nOverall, Bitcoin remains below its 50-day Exponential Moving Average (EMA), while the RSI indicates neutral momentum. Meanwhile, Tokyo Stock Exchange-listed company Metaplanet Inc. has acquired an additional 150 BTC as part of its Bitcoin Treasury strategy, bringing its total holdings to 3,200 BTC.\n\n(With inputs from Bloomberg)",
      "publisher": "livemint",
      "url": "https://www.livemint.com/market/cryptocurrency/cathie-wood-us-investor-most-memecoins-not-going-to-be-worth-much-warns-crypto-news-bitcoin-price-today-march-19-markets-11742355775879.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2025/03/19/1600x900/Cathie_Wood_memecoin_markets_invest_crypto_news_US_1742371259534_1742371259793.jpg",
      "date": "2025-03-19T14:24:01+05:30"
    },
    {
      "news_number": 3,
      "title": "Crypto firm backed by Trump family sells $550 million worth of tokens amid ethical concerns",
      "content": "World Liberty Financial, one of several crypto ventures backed by the family of US President Donald Trump, has netted a total of $550 million from selling tokens to crypto investors in two rounds of sales.\n\nOver $250 million worth of the crypto assets were bought during the firm’s second token sale. More than 85,000 participants submitted to know-your-customer (KYC) verification to gain access to the token sale, the company said in a press release on Monday, March 17.\n\nThe token sales were only open to accredited investors. WLFI tokens cannot be transferred or traded via crypto exchanges as the company is not yet listed, according to a report by CoinDesk. “WLFI is on track to supercharge DeFi [decentralised finance],” Zach Witkoff, the co-founder of the venture, was quoted as saying.\n\nStory continues below this ad\n\nLaunched in October last year, WLFI describes itself as a crypto banking platform. The Trump family’s stake in WLFI means that they could take home 75 per cent of the platform’s net revenue, according to a report by CNBC.\n\nWLFI’s token sales come amid Trump’s recent efforts to bolster his crypto-friendly agenda. Earlier this month, he signed an executive order to establish a Strategic Bitcoin Reserve.\n\nHowever, the US president’s foray into the cryptocurrency business has sparked ethical concerns over the intersection of political power, financial interests, and the rapidly growing world of digital assets.\n\nFor instance, Justin Sun, the founder of blockchain platform Tron, purchased around $75 million worth of WLFI tokens in January this year. Reports emerged a month later that Sun and the US Securities and Exchange Commission (SEC) were considering settling the civil fraud case lodged by the country’s markets regulator against the crypto entrepreneur.\n\nStory continues below this ad\n\nMeanwhile, David Sacks, the Trump administration’s AI and crypto czar, reportedly sold over $200 million worth of digital asset-related investments before taking the job as he “didn’t want to even have the appearance of a conflict.”",
      "publisher": "indianexpress",
      "url": "https://indianexpress.com/article/technology/tech-news-technology/trump-family-world-liberty-financial-crypto-firm-token-sales-9892227/",
      "imgURL": "https://images.indianexpress.com/2025/03/US_0dddf8.jpg",
      "date": "2025-03-19T09:12:48+05:30"
    }
  ]
}