{
  "AI": [
    {
      "news_number": 0,
      "title": "Infosys cofounder Narayana Murthy: Somehow it has become a fashion in India to ...",
      "content": "How Narayana Murthy defines AI\n\nNarayana Murthy agrees AI will lead to job losses, but ...\n\nNR Narayana Murthy , co-founder of Infosys , spoke at TiECon Mumbai on Wednesday, attempting to temper the overhyped buzz surrounding artificial intelligence (AI) in India. He pointed out that many systems marketed as AI were simply traditional programming. “I think somehow it has become a fashion in India to talk of AI for everything. I have seen several normal, ordinary programs touted as AI,” Murthy commented during the annual entrepreneurial conference.In a discussion with Harish Mehta, founding president of TiE Mumbai, Murthy clarified that genuine AI rests on two key pillars: Machine learning , which facilitates extensive correlation for predictions, and Deep Learning, which emulates human brain function through unsupervised algorithms.\"Frankly, most of what passes for AI these days is trivial and outdated coding,\" Murthy asserted. \"It's the unsupervised algorithms leveraging deep learning and neural networks that hold far greater promise for increasingly human-like capabilities.\"Murthy went on to add that deep learning will be able to solve, and handle what are called “unsupervised algorithms”. While machine learning by and large handles supervised algorithms because you have to give a lot of data into that, deep learning uses the data to create new branches of programs or new conditions. And then it will be able to take decisions.While recognizing that AI will displace some jobs, he emphasized its potential to boost economic growth. \"Every technology eliminates certain roles, but when applied supportively, it can expand the economy.\"Murthy also urged entrepreneurs to generate employment. \"I'm confident each of you will spawn hundreds of thousands of jobs—that’s how you tackle poverty. Handouts have never lifted any nation out of poverty,\" he concluded.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/technology/tech-news/infosys-cofounder-narayana-murthy-somehow-it-has-become-a-fashion-in-india-to-/articleshow/118991651.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118991654,width-1070,height-580,imgsize-63434,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 1,
      "title": "AI coding assistant Cursor reportedly tells a ‘vibe coder’ to write his own damn code",
      "content": "As businesses race to replace humans with AI “agents,” coding assistant Cursor may have given us a peek at the attitude bots could bring to work, too.\n\nCursor reportedly told a user going by the name “janswist” that he should write the code himself instead of relying on Cursor to do it for him.\n\n“I cannot generate code for you, as that would be completing your work … you should develop the logic yourself. This ensures you understand the system and can maintain it properly,” janswist said Cursor told him after he spent an hour “vibe” coding with the tool.\n\nSo janswist filed a bug report on the company’s product forum: “Cursor told me I should learn coding instead of asking it to generate it,” and included a screen shot. The bug report soon went viral on Hacker News, and was covered by Ars Technica.\n\nJanswist speculated that he hit some kind of hard limit at 750-800 lines of code, although other users replied that Cursor will write more code than that for them. One commenter suggested that janswist should have used Cursor’s “agent” integration, which works for bigger coding projects. Anysphere, maker of Cursor, couldn’t be reached for comment.\n\nBut Cursor’s refusal also sounded an awful lot like the replies newbie coders could get when asking questions on programming forum Stack Overflow, folks on Hacker News pointed out.\n\nThe suggestion is that if Cursor trained on that site it may have learned not just coding tips, but human snark as well.\n\n",
      "publisher": "techcrunch",
      "url": "https://techcrunch.com/2025/03/14/ai-coding-assistant-cursor-reportedly-tells-a-vibe-coder-to-write-his-own-damn-code/",
      "imgURL": "https://techcrunch.com/wp-content/uploads/2023/07/GettyImages-1481095076.jpg?resize=1200,694",
      "date": "2025-03-14T00:00:00"
    },
    {
      "news_number": 2,
      "title": "AI-Driven Skill Development Training for Government School Students. – Department of Information Technology, Electronics & Communications",
      "content": "IT and Industries Minister, Sridhar Babu, has announced that government school students will receive skill development training with the help of Artificial Intelligence (AI).\n\nHe emphasized the government’s commitment to enhancing the teaching capabilities of government school teachers in alignment with evolving technology. On Saturday, at Dr. B.R. Ambedkar Secretariat, the Chairman of Telangana Film Development Corporation, Dil Raju, accompanied by representatives of the Konam Foundation, led by Sandeep Kumar, met the minister. During the meeting, Minister Sridhar Babu highlighted the state’s proactive approach to leveraging emerging technologies across various sectors. He also revealed plans to establish an “AI City” under a Public-Private Partnership (PPP) model, which will include an AI University adhering to international standards. The minister commended the foundation’s initiative of providing free AI-driven skill development training to government school students in Nalgonda district. He assured that steps would be taken to expand these services to all government schools across the state.\n\nFurthermore, he praised Sandeep Kumar for his dedication to social service, noting that despite his successful career abroad, he continues to contribute to his hometown through the foundation’s initiatives. The event was attended by the state’s IT Advisor, Sai Krishna.",
      "publisher": "it",
      "url": "https://it.telangana.gov.in/ai-driven-skill-development-training-for-government-school-students/",
      "imgURL": "https://it.telangana.gov.in/wp-content/uploads/2025/03/WhatsApp-Image-2025-03-15-at-16.38.25-scaled.jpeg",
      "date": "2025-03-08T12:54:57+00:00"
    }
  ],
  "Health": [
    {
      "news_number": 0,
      "title": "Can an aspirin a day keep cancer at bay?",
      "content": "A new study finds that aspirin may disrupt the protective shield cancer cells use to evade the immune system.\n\nFor decades, aspirin has been known as a go-to painkiller. New research reveals how it may also help fight cancer.\n\nWhile previous research hinted at a link between aspirin use and improved cancer survival, a study published in Nature last week explains why. However, experts caution that aspirin is not a cure – and it carries risks like increased potential for internal bleeding.\n\nSo, how might aspirin keep cancer from spreading? And what does this mean for future treatments?\n\nWhat have studies found about aspirin use and cancer?\n\nRecent studies have revealed how aspirin, a widely used painkiller, may help prevent the spread of cancer, although it is unclear whether it would work the same for all types of the disease.\n\nResearchers have been exploring this link for decades. The first clinical study, published in 1988, showed that regular aspirin use significantly lowered the risk of colorectal cancer, though the underlying reason remained unclear.\n\nNow, a new study from the University of Cambridge offers more insight. It found the mechanism by which aspirin may help prevent cancer from spreading, a process known as metastasis.\n\nAdvertisement\n\nMetastasis is responsible for the majority of cancer-related deaths, as cancer cells break away from the original tumour and try to take root elsewhere​ across the body.\n\nAs these drifting cancer cells go rogue, aspirin may enhance the body’s natural ability to fight back, keeping the cancer cells from taking hold of more organs.\n\nHow can aspirin keep cancer from spreading?\n\nThe key to aspirin’s effect on cancer lies in the body’s immune system, a complex network of cells and proteins that defends against infections, diseases and harmful germs.\n\nWhen cancer cells break away from a tumour, they enter the bloodstream, where the immune system – specifically types of white blood cells known as T-cells – normally hunts them down and destroys them. However, platelets – tiny cell fragments in the blood that help with clotting – can interfere with this process.\n\nCancer takes advantage of platelets by triggering a response similar to an injury. When platelets detect the free-floating cancer cells, they rush to coat them, much like they would cover a wound to stop bleeding.\n\nThis creates a protective shield, making it harder for the immune system to recognise and attack the cancer cells. Additionally, platelets release signals that suppress T-cells, preventing them from doing their job.\n\nAspirin disrupts cancer’s attempts at trickery by reducing the production of a molecule that platelets use to suppress immune activity. With the platelets weakened, T-cells regain their ability to recognise and destroy cancer cells before they have a chance to form new tumours.\n\nAdvertisement\n\nHow could aspirin be used against cancer?\n\nThe study suggests that aspirin could be used after treatments like surgery where tumours are removed.\n\nThis is because some cancer cells may have already escaped from the tumour and begun to settle in other parts of the body, a process known as seeding, where tiny cancer cells embed themselves in new areas and may later grow into tumours.\n\nHowever, experts caution against immediately using aspirin as a cancer treatment without further research. The painkiller carries the potential for serious side effects such as internal bleeding because by weakening the platelets, it can weaken their ability to help blood clot.\n\nAspirin blocks a molecule that prods platelets to clump together. This makes the blood thinner and increases the risk of uncontrolled bleeding. This is especially dangerous in the stomach, where aspirin can irritate the lining and cause ulcers, and in the brain, where it raises the risk of a hemorrhagic stroke if a tiny blood vessel bursts.\n\nAdditionally, the study was carried out on mice, not humans, so its effects on cancer spread still need to be confirmed before it can be recommended for treatment.\n\n“Our research provides a molecular explanation for observations from clinical studies, but proper clinical validation is still needed,” Rahul Roychoudhuri, a professor in Cambridge’s Department of Pathology who was part of the Nature study, told Al Jazeera.\n\nSeveral clinical trials, such as the ADD-ASPIRIN trial in the United Kingdom, Ireland and India, are under way to determine which patients are most likely to benefit most from taking aspirin and whether it works for specific types of cancers.\n\nAdvertisement\n\nRoychoudhuri added that he does not anticipate an “immediate fast-tracked translation” of aspirin to cancer treatment.\n\nHas aspirin been used against diseases in the past?\n\nSome patients with a high genetic risk for cancer, such as those with Lynch syndrome (a condition that increases the likelihood of developing certain cancers), are already recommended aspirin as a preventive measure​ in countries such as Australia and the UK.\n\nSince the 1980s, aspirin has also been prescribed to help prevent heart attacks and strokes in people at high risk of heart disease, by reducing the ability of platelets to form harmful clots that can block blood flow to the heart or brain. This clot-preventing effect helps lower the risk of heart attacks in those with a history of cardiovascular disease.\n\nDoes this mean we are close to a breakthrough in curing cancer?\n\nNot necessarily. While aspirin may help slow or prevent the spread of cancer, it does not eliminate tumours entirely.\n\nHowever, scientists are working to identify biomarkers – measurable signs in the blood – and platelet activity to help detect individuals at risk for cancer early on.\n\n“This would allow for timely treatment with aspirin while minimising unnecessary exposure for those who do not require it,” said Paola Patrignani, a professor of pharmacology at Gabriele d‘Annunzio University in Italy.\n\nExperts say the findings could also contribute to the development of drugs that inhibit cancer spread.\n\n“Our discoveries open possibilities for developing more targeted therapies that could potentially provide the benefits without aspirin’s side effects,” Roychoudhuri said.\n\nAdvertisement\n\nPatrignani, who is involved in research funded by Cancer Research UK to investigate whether other anti-platelet drugs, like clopidogrel, might offer similar benefits, says these studies will require another three to five years to be completed.\n\nHowever, she is optimistic about where the research is heading. “We are on the verge of a significant breakthrough in cancer research. This newfound knowledge could pave the way for innovative treatments and potentially save countless lives.”\n\nWhy does a cure for cancer remain so elusive?\n\nFinding a cure for cancer remains one of the greatest challenges in medicine.\n\nAs there are many different types of cancer, each with its own characteristics and ways of spreading, it is difficult to develop a universal cure.\n\nAdditionally, tumour development is influenced by a combination of genetic predisposition and environmental factors. Studies suggest that treatment must be personalised to be truly effective.\n\nMany cancers also develop ways to hide from or suppress the immune system, making them harder to attack even with immunotherapy.",
      "publisher": "aljazeera",
      "url": "https://www.aljazeera.com/news/2025/3/15/can-an-aspirin-a-day-keep-cancer-away",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2025/03/AP19203650464471-1741527142.jpg?resize=1920%2C1440",
      "date": "2025-03-15T00:00:00"
    },
    {
      "news_number": 1,
      "title": "What is the 1-minute gut health test?",
      "content": "“The gut is at the center of our health. Healing your gut is the first step for optimising health and healthspan,” said Tanya Malik Chawla, a digital creator and “biohacker,” in an Instagram reel, and suggested taking a one-minute test to find out whether you are prone to acidity.\n\nThe test involves taking baking soda with water on an empty stomach. Baking soda (an alkali) will mix with stomach acid to produce carbon dioxide (gas), leading to burping. The time you take to burp is used as an indicator to decide whether a person has low stomach acid.\n\nIn her video, Chawla challenged a common misconception—that acidity is caused by excess stomach acid. Instead, she claimed that low stomach acid causes food to sit undigested in the gut, leading to fermentation and acid reflux (GERD).\n\nView this post on Instagram A post shared by Tanya Malik Chawla (@tanyamalikbiohacker)\n\nTo verify Chawla’s claim, we consulted Meenu Balaji, chief nutritionist at Pragmatic Nutrition, Chennai, who told us that the test is a popular home method for assessing stomach acid production.\n\nStory continues below this ad\n\n“Our stomach produces hydrochloric acid that breaks down food with other digestive enzymes. Many people experience acidity due to excess acid production, which is why antacids are commonly prescribed. However, insufficient stomach acid can also impact digestion and nutrient absorption, affecting gut health,” she said.\n\nHowever, she pointed out that burping can occur for several reasons—low or high stomach acid, small intestinal bacterial overgrowth (SIBO), eating too quickly, or swallowing too much air. Therefore, according to Balaji, burping alone is not a reliable indicator of stomach acid levels.\n\nIs the baking soda test reliable?\n\n“This is not a widely accepted, standardised diagnostic test. Some people with digestive issues burp even before eating, making it difficult to determine whether burping is caused by the baking soda or pre-existing conditions,” she said.\n\nBalaji also said that stomach acid levels vary from person to person, and fluctuate throughout the day, making it even harder to draw conclusions based solely on burping.\n\nStory continues below this ad\n\nALSO READ | From munakka to gulkand: Say goodbye to acidity with these natural remedies\n\nAccording to Balaji, the most effective way to determine stomach acid levels is to consult a doctor about your symptoms. The doctor may recommend tests such as the Heidelberg pH test for a precise assessment.\n\nDISCLAIMER: This article is based on information from the public domain and/or the experts we spoke to. Always consult your health practitioner before starting any routine.",
      "publisher": "indianexpress",
      "url": "https://indianexpress.com/article/lifestyle/health/what-is-the-1-minute-gut-health-test-9878549/",
      "imgURL": "https://images.indianexpress.com/2025/03/acidity.jpg",
      "date": "2025-03-15T10:30:41+05:30"
    },
    {
      "news_number": 2,
      "title": "At least 21 children hospitalized after drinking slushies, study warns about the health risks",
      "content": "(Pic courtesy: iStock)\n\n(Pic courtesy: iStock)\n\n(Pic courtesy: iStock)\n\nDrake Rents Entire Nightclub For Gambling & Drinking Alone, Concerning Behaviour Alarms Fans\n\nFrozen drinks, slushies , which are often kids’ favourite refreshments, especially during the summer months, pose hidden health risks, suggests a new study. At least 21 children were hospitalized over the last 15 years in the U.K. and Ireland, after drinking slush ice drinks containing glycerol.The new study published in the Archives of Disease in Childhood suggests that safety guidelines for glycerol-containing slush ice drinks require revisiting, after reviewing medical notes of 21 children who became acutely unwell shortly after drinking slushies. The children showed a cluster of symptoms linked to glycerol intoxication syndrome , soon after drinking a slush ice drink. The affected children exhibited reduced consciousness, a sudden sharp drop in blood sugar (hypoglycemia), and a build-up of acid in the blood (metabolic acidosis). The researchers noted that such symptoms occurring together is a sign of poisoning or inherited metabolic disorders.The researchers noted that brightly coloured slush ice drinks are designed to appeal to children. While the ingredients vary, most of those available in the UK and Ireland are ‘no added sugar’ or ‘sugar-free’ products and instead contain glycerol (E422, also known as glycerin). The glycerol stops the ice from fully freezing, thereby maintaining the slush effect in the absence of a high sugar content.The 21 children who consumed slushies, soon became ‘acutely unwell’ had initially been diagnosed with hypoglycemia after their arrival in emergency care. Apart from the one child referred in 2009, all the others were referred for further review between 2018 and 2024. The tests confirmed that the children had at least two of the conditions - hypoglycemia; metabolic acidosis; glyceroluria (high levels of glycerol in the urine). The affected children weThe majority of the affected children were males, aged between 2 and 7. The symptoms appeared within 60 minutes for most cases. Severe hypoglycemia was reported in 65% of affected children. Some had low potassium levels and falsely high blood fat levels. All of them recovered quickly after the treatment.The researchers noted that most of the cases took place between 2018 and 2024, “A cause of the recent apparent surge in cases may be the reduced sugar content of these drinks, secondary to two main factors: first, public health and parental concerns about high sugar ingestion, and second, the introduction of a ‘sugar tax’ on high sugar (>5%)-containing drinks in Ireland and the UK in 2018 and 2019, respectively.”They noted that such drinks sold in countries where there’s no sugar tax, contain a much higher glucose content and often don’t contain any glycerol at all.Following the findings from these cases, the UK Food Standards Agency recommended that young children (4 and under) shouldn’t be given slush ice drinks containing glycerol and that those aged 10 or younger should not have more than one. The Food Safety Authority of Ireland (FSAI) also came up with a similar guidance in 2024.However, the researchers think there must be more restrictions on such drinks . “There is poor transparency around slush ice drink glycerol concentration; estimating a safe dose is therefore not easy. It is also likely that speed and dose of ingestion, along with other aspects, such as whether the drink is consumed alongside a meal or during a fasting state, or consumed after high-intensity exercise, may be contributing factors,” the authors wrote.“Food Standards Scotland and the FSAI suggested that 125 mg/kg of body weight per hour is the lowest dose that is associated with negative health effects. For a toddler, this may equate to 50–220 ml of a slush ice drink. The standard size drink sold in the UK and Ireland is 500 ml,” they stressedThey also suggest that as these drinks don’t confer any nutritional or health benefits, “recommendations on their safe consumption therefore need to be weighted towards safety.”“To ensure safe population-level recommendations can be easily interpreted at the individual parental level, and given the variability across an age cohort of weight, we suggest that recommendations should be based on weight rather than age. Alternatively, the recommended age threshold may need to be higher (8 years), to ensure the dose per weight would not be exceeded, given normal population variation in weight,” the researchers said.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/at-least-21-children-hospitalized-after-drinking-slushies-a-new-study-warns-about-the-health-risks/articleshow/119036010.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-119036010,width-1070,height-580,imgsize-64558,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 3,
      "title": "Kidney Health: Do Not Neglect These Early Warning Signs - Check Doctor's Advice",
      "content": "Just like the heart and the liver, kidneys are vital organs and you can't live without them. So naturally, it's essential to focus on maintaining kidney health. Dr Manoj K. Singhal, Principal Director - Nephrology and Kidney Transplantation, Max Super Speciality Hospital, Vaishali, says, \"Kidneys play a vital role in maintaining overall health by filtering waste from the blood, balancing fluids, regulating blood pressure, and producing essential hormones.\"\n\nWhile kidneys are extremely crucial organs, often people fail to realise failing kidney health which can lead to serious health issues. As Dr Singhal points out, \"Kidney problems often go unnoticed in their early stages because the symptoms can be subtle. Identifying these signs early can prevent further damage and improve treatment outcomes.\"\n\nWarning Signs That Can Indicate All's Not Well With Your Kidneys\n\nRecently on March 13, World Kidney Days was observed globally to raise awareness about kidney health. Dr Manoj K. Singhal lists some key warning signs to watch out for:\n\n1. Changes In Urination Patterns\n\n\n\nOne of the earliest indicators of kidney problems is a noticeable change in urination. You might experience increased frequency, especially at night (nocturia), or a decrease in urine output. Foamy or bubbly urine, indicating protein leakage, and changes in colour — darker, cloudy, or blood-tinged — should not be ignored.\n\n2. Swelling In The Body\n\n\n\nWhen kidneys struggle to remove excess fluids, it can lead to swelling (edema), especially in the feet, ankles, hands, or around the eyes. Persistent puffiness, particularly in the morning, may indicate fluid retention due to impaired kidney function.\n\n3. Fatigue And Weakness\n\n\n\nHealthy kidneys produce a hormone called erythropoietin, which helps create red blood cells. When kidney function declines, red blood cell production drops, leading to anemia. This can cause persistent fatigue, weakness, and difficulty concentrating.\n\n4. Persistent Itching And Dry Skin\n\n\n\nKidneys help remove waste and toxins from the bloodstream. When they aren’t functioning properly, toxins can build up, causing persistent itching, dry skin, and even rashes. This could be a sign of mineral imbalances or the accumulation of waste products in the body.\n\n5. Loss Of Appetite And Nausea\n\n\n\nA buildup of toxins due to poor kidney function can lead to loss of appetite, nausea, vomiting, and a metallic taste in the mouth. These symptoms may seem minor initially but can become more pronounced as kidney disease progresses.\n\n6. High Blood Pressure\n\n\n\nThe kidneys help regulate blood pressure by balancing fluids and electrolytes. If they aren’t working correctly, blood pressure can rise. High blood pressure, in turn, can further damage the kidneys, creating a dangerous cycle.\n\n7. Shortness Of Breath\n\n\n\nIn advanced stages, fluid can accumulate in the lungs, causing shortness of breath. Additionally, anemia caused by kidney dysfunction can result in reduced oxygen levels, further contributing to breathlessness.\n\n\"If you experience any of these symptoms persistently, it’s important to consult a doctor for proper evaluation. Early detection through simple blood and urine tests can make a significant difference in managing kidney health. Individuals with diabetes, hypertension, or a family history of kidney disease should be particularly vigilant,\" says Dr Singhal. He emphasises the fact that kidney disease often goes unnoticed until significant damage has occurred, making early detection crucial. \"Recognising these signs and seeking timely medical advice can help protect your kidneys and improve long-term health outcomes,\" says Dr Singhal.",
      "publisher": "zeenews",
      "url": "https://zeenews.india.com/health/kidney-health-do-not-neglect-these-early-warning-signs-check-doctors-advice-2872322",
      "imgURL": "https://english.cdn.zeenews.com/sites/default/files/2025/03/14/1698762-backpain-woman-freepik.jpg",
      "date": null
    }
  ],
  "Sports": [
    {
      "news_number": 0,
      "title": "As long as I love the game, I'll continue to play: Virat Kohli",
      "content": "Virat Kohli\n\nsays he's not playing for 'achievement' anymore but for the joy & excitement; admits retirement call be tough because of 'competitive streak'\n\nGo Beyond The Boundary with our YouTube channel.\n\nOn the possibility of retirement:\n\nOn the Indian team's recent\n\nwin:\n\nWill Rohit Sharma win 2027 World Cup? Astrologer Lobo predicts after getting Champions Trophy bang on!\n\nOn cricket at the Olympics:\n\nOn dealing with setbacks and lack of form:\n\nOn setting fitness standards in Indian cricket:\n\nOn the WPL and growth of the women's game:\n\nBENGALURU: Virat Kohli on Saturday made it clear that retirement is not on the immediate agenda but the star batter admitted he may not be around when India tour Australia next in four years' time. In a tongue-in-cheek response to the possibility of coming out of retirement for the 2028 Olympics, the 36-year-old former India skipper, speaking at the RCB Innovation Lab's Leadership Summit here on Saturday, quipped, “I just might sneak in for one game, if we are playing the gold-medal match!” Excerpts...I'm not playing for achievement. It pretty much comes down to just the pure joy, enjoyment and love for the game. And as long as that is intact, I'll continue to play the game. I have to be honest about that with myself, because the competitive streak doesn't allow you to find the answer. I had a very interesting conversation about this with Rahul Dravid when he was coach. He said you always have to stay in touch with yourself, figure out where you are placed in your life. And the answer is not that easy, because you might be going through a lean phase, and you (may) feel like this is it, but it might not be. When it is time, he said my competitive streak would not allow me to accept it. Maybe one more. You just have to pray and hope for clarity when it comes.The only thing that we as a team have tried to do is create an environment of fun and involvement. When you go to a practice session, you're looking forward to being at the training ground with your friends. It doesn't feel like a drag, it doesn't feel like I have to get off the bus and go for another session. It's like, when are we going to get together with the boys again? Because we have so much talent today. And I think it came out beautifully. The guys adapted well to what was in front of them. We ended up winning because we adapted to the conditions much better than the others.I'm happy about the inclusion. The amount of cricket has increased, so have the number of teams. Leagues are being played all over the world. The IPL has played a massive role in that as well. It's a great opportunity for our guys. To be Olympic champions would be a magnificent feeling.I can't pinpoint one lowest point. If you ask me the intensity of how disappointed I've been, for me the most recent Australia tour would be the one that's most fresh, or for a long period of time the tour of England in 2014 was the thing that bothered me the most. But I can't look at it that way. I might not have an Australia tour again in me in four years' time. I don't have the chance to correct it. So, you have to make peace with whatever's happened in your life. How do I cope? It's just about the acceptance.There was a time when I realized that I need to change the way I'm preparing as an athlete. Motivation was something that came from within. No one had to force me to do it. India had a couple of very difficult overseas tours. And I figured out that the reason that we were falling short is because the other team was physically way fitter than us. And they were able to hold their plans and skills in pressure situations for way longer periods than we could. And that's what Test cricket is all about, who's able to stay in the battle for longer periods of time.After I became captain, we started to bring in this kind of culture into the team as well. It eventually became a fabric that went into the culture of the Indian cricket.The perception (about women's cricket) has changed massively. I think what the Indian women's cricket team has done over the last few years is that they are the ones who were the catalyst to kind of put the attention onto themselves. I literally saw it happening in a time span of 6-7 years. The way they started playing, you could see that belief and then people started engaging a lot more. And eventually it got to a place where commercials became better. Money was being infused into the women's game. And then you have the WPL. We have all seen the number of people that come and watch the games. And the standard of the games as well, be it power-hitting or skill levels and everything. This is what happens when you take a sport or even a part of a sport to that level of competition and equality.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/sports/cricket/news/as-long-as-i-love-the-game-ill-continue-to-play-virat-kohli/articleshow/119048879.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-119048981,width-1070,height-580,imgsize-104290,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 1,
      "title": "“Second period was unacceptable”: Coach Todd McLellan disappointed with Detroit Red Wings 'self-inflicted' 4-2 loss to Carolina Hurricanes",
      "content": "Credit: Getty Images\n\nTodd McLellan's frustration boils over\n\n\n\nLucas Raymond, Dylan Larkin, Todd McLellan Post Game @ CAR | March 14, 2025\n\nWhat happened during the game?\n\n\n\nWhat lies ahead for Detroit Red Wings?\n\n\n\nThe Carolina Hurricanes stretched their winning streak to six games with a dominating 4-2 win over the Detroit Red Wings on Friday evening. Detroit, struggling to remain in the playoff hunt, couldn't overcome a second-period meltdown. Red Wings coach Todd McLellan had no choice but to speak bluntly of what he called the team's 'unacceptable' play during that span.While the Red Wings exhibited glimpses of grit—particularly in a powerful third period charge—McLellan was adamant that the harm had already been inflicted. “I thought the second was the period that really hurt us. First, you have to weather this storm here. They come out real hard. We got some good saves. I thought we settled in as the period wore on. Scoring certainly helped us, but the second period was unacceptable. It wasn't just Carolina inflicted. It was self-inflicted,” he said candidly after the game.He cited poor turnovers, defensive breakdowns, and expensive mental mistakes as reasons why Detroit trailed. “It started with the very first shift, the turnover, and they scored. And now they got some momentum, some line changes, just some really dumb play on our behalf,” he said, visibly upset.Even a third-period tally by Michael Rasmussen that gave life to the Red Wings wasn't enough. McLellan felt that his team's inconsistency was their undoing. “We had a little chat between the second and third and found a way to push a little more, but obviously not enough. And if you don't play your full 60 against these top teams, you're likely going to come out on the losing end,” he conceded.A dominant second period, where they scored three goals, proved to be the difference. The Hurricanes (40-22-4) were led by the trio of Jesperi Kotkaniemi, Jack Roslovic, and Taylor Hall, who had five points between them, as they took complete control of the game, keeping Detroit (31-29-6) on their heels.Even with the loss, goalie Petr Mrázek played well, coming up with important saves and keeping Detroit in the game. McLellan recognized his efforts, adding, “I thought he was excellent. Not an easy team to play against. There are a lot of shots with a lot of traffic coming. He was very athletic and got to some rebounds that we needed him to get to. No issues there,” he said. “I thought he played an excellent game. There was a lot to like in the last two games before tonight, a lot to like in the third period here tonight.”In the meantime, Alex DeBrincat remained a beacon of light, recording his 31st goal of the season. McLellan complimented his reliability, describing him as ‘a guy we can count on every night.’ At the same time, however, he made it plain that Detroit must have more players who will rise to the occasion. “He seems to be a guy that we can count on every night. He's usually not at the scene of the crime defensively, and offen he's got some pop. He battles well,” he said.As the playoff push tightens up, Detroit simply can't let games get away. McLellan stressed the importance of playing full games: “We know what we're going to face on Sunday, or maybe we don't yet because we haven't had our pre-scout, but our attempt at a win there is going to have to be more consistent than it was here tonight. The game may be a little bit different. They play the game a little differently. But if we're not in it for 60, it doesn't matter what momentum we're talking about or what preparation we're talking about,” he said, “It's not the time of the year to play two periods. It's time to compete for three.”Also read: Alex Ovechkin Ties Jaromir Jagr for Most Game-Winning Goals in NHL History The Red Wings will seek to get back on track on Sunday against another difficult foe. Whether they have learned their lesson from this defeat is yet to be determined.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/sports/nhl/news/second-period-was-unacceptable-coach-todd-mclellan-disappointed-with-detroit-red-wings-self-inflicted-4-2-loss-to-carolina-hurricanes/articleshow/119049116.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-119049197,width-1070,height-580,imgsize-17072,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 2,
      "title": "Toronto Maple Leafs vs Ottawa Senators: Injury report, where to watch, stats, betting odds and more",
      "content": "(Image via Getty)\n\n\n\n\n\nOttawa Senators statistics for the 2024-2025 NHL season\n\nStatistics via the official NHL website:\n\nPower Play percentage - 23.4% (13th NHL rank)\n\n23.4% (13th NHL rank) Penalty Kill percentage - 77.7% (18th NHL rank)\n\n77.7% (18th NHL rank) Face-off percentage - 52.9% (4th NHL rank)\n\n52.9% (4th NHL rank) GF/GP - 2.92 (17th NHL rank)\n\n2.92 (17th NHL rank) GA/GP - 2.82 (10th NHL rank)\n\nToronto Maple Leafs statistics for the 2024-2025 NHL season\n\nStatistics via the official NHL website:\n\nPower Play percentage - 24.2% (9th NHL rank)\n\n24.2% (9th NHL rank) Penalty Kill percentage - 78.4% (16th NHL rank)\n\n78.4% (16th NHL rank) Face-off percentage - 53.3% (3rd NHL rank)\n\n53.3% (3rd NHL rank) GF/GP - 3.18 (11th NHL rank)\n\n3.18 (11th NHL rank) GA/GP - 2.95 (16th NHL rank)\n\nWhere is the NHL game between Toronto Maple Leafs and Ottawa Senators?\n\nArena:\n\nLocation:\n\nWhen is the NHL game between the Toronto Maple Leafs and Ottawa Senators?\n\nWhere can you watch the NHL game between Toronto Maple Leafs and Ottawa Senators?\n\nLive streaming -\n\nTV channel -\n\nWhat time is the NHL game between Toronto Maple Leafs and Ottawa Senators?\n\nbegins at 7 p.m. ET on Saturday, March 15, 2025.\n\nToronto Maple Leafs injury report\n\nMax Pacioretty (Injury - unrevealed)\n\nJani Hakanpaa (Injury - Knee)\n\n\n\nOttawa Senators injury report\n\n\n\nNick Cousins (Injury - Knee)\n\nTravis Hamonic (Injury - Lower Body)\n\nBrady Tkachuk (Injury - Hip)\n\nWhat are the betting odds for the Toronto Maple Leafs and Ottawa Senators?\n\nAccording to the USA Today For The Win,\n\nFavorite NHL team\n\nUnderdog NHL team\n\nOver/Under Pick -\n\nAlso Read:\n\nThe Toronto Maple Leafs will play the Ottawa Senators in an NHL game on Saturday, March 15, 2025, at 7 p.m. ET at Scotiabank Arena, Toronto, Ontario.Toronto Maple Leafs have had 39 wins, 23 losses, and 3 overtime losses in the Atlantic Division in the 2024-2025 NHL season. On the other hand, the Ottawa Senators have had 35 wins, 25 losses, and 5 overtime losses in the Atlantic Division in the 2024-2025 NHL season.In the last 10 NHL games, the Senators and Maple Leafs have had neck-to-neck scoring. The Ottawa Senators tallied 4 losses and 6 wins in the last 10 NHL games of the 2024-2025 season. Toronto Maple Leafs tallied 4 losses and 6 wins in the last 10 NHL games of the 2024-2025 season.This will be the third and final NHL game between the Maple Leafs and the Senators. The last two have been won by the Ottawa Senators. The Senators have won 5 back-to-back matches and have already occupied their place as the first wild-card team in the East. The Senators are trying so hard to break their 7-season playoff drought. The Senators are going to look forward to keeping the five-win game streak alive.Scotiabank ArenaToronto, OntarioMarch 15, 2025 - SaturdayESPN+, FuboESPN+, FanDuel Sports Network, CBC, SNO, SNP, SNW, TVAS2The coverage for the NHL game between the Toronto Maple Leafs and Ottawa SenatorsGames played - 37, Stats - 5 goals, 8 assists, 13 pointsGames played - 2, Stats - 0 goals, 0 assists, 0 pointsGames played - 47, Stats - 5 goals, 8 assists, 13 pointsGames played - 51, Stats - 0 goals, 3 assists, 3 pointsGames played - 63, Stats - 27 goals, 23 assists, 50 points- Toronto Maple Leafs ( - 165 )- Ottawa Senators ( + 140 )8.5",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/sports/nhl/news/toronto-maple-leafs-vs-ottawa-senators-injury-report-where-to-watch-stats-betting-odds-and-more/articleshow/119033620.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-119033728,width-1070,height-580,imgsize-591298,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 3,
      "title": "LIVE: Delhi Capitals vs Mumbai Indians – WPL 2025 final",
      "content": "blinking-dot Live updates Live updates,\n\nLIVE: Delhi Capitals vs Mumbai Indians – WPL 2025 final\n\nFollow our live build-up, with full team news and analysis, ahead of our comprehensive text commentary stream.",
      "publisher": "aljazeera",
      "url": "https://www.aljazeera.com/sports/liveblog/2025/3/15/live-dehli-capitals-vs-mumbia-indians-wpl-final",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2025/03/AFP__20250315__372J6A7__v1__HighRes__CricketIndWplT20MumbaiDelhi-1742050958.jpg?resize=1920%2C1440",
      "date": "2025-03-15T00:00:00"
    },
    {
      "news_number": 4,
      "title": "ISL announce playoffs dates; Chhangte injury rules him out of India matches: Indian Sports LIVE, March 15",
      "content": "Open Extended Reactions\n\nAs action packed as Indian sport can get it, it's easy to miss out on important news and results. That's where we come in -- ESPN India's daily Indian sports blog has all the updates from the world of Indian sports as well as the news, scores, schedule, results and commentary that comes with it.\n\nMarch will see Indian athletes in action across leagues. You can see details of other events in our 2025 sporting calendar.\n\nHere are all the updates from March 15, 2025.\n\nWhat's on today?\n\nHockey: It's the 50th anniversary of India's 1975 Hockey World Cup victory.\n\nCricket: Mumbai Indians and Delhi Capitals will battle for the Women's Premier League trophy in the WPL final.\n\nFootball: Updates on the ongoing ISL playoffs fiasco are awaited\n\nWhat happened yesterday?",
      "publisher": "espn",
      "url": "https://www.espn.in/espn/story/_/id/44251569/indian-sports-live-news-scores-results-updates-march-15-hockey-world-cup-wpl-final",
      "imgURL": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0401%2Fr1312852_1128x635_16%2D9.jpg",
      "date": null
    }
  ],
  "Finance": [],
  "Geopolitical": [],
  "Crypto": []
}