{
  "AI": [
    {
      "news_number": 0,
      "title": "Italian newspaper says it has published world’s first AI-generated edition",
      "content": "An Italian newspaper has claimed to be the first globally to feature a daily edition solely made of artificial intelligence. The Il Foglio AI edition, created over four pages, is part of a seven-week experiment aimed at exploring AI's impact on daily life. Editor Claudio Cerasa emphasized that journalists would mainly ask questions and read answers, while others might have limited roles.\n\nThe first issue includes a story about Donald Trump's paradox in Italy and quotes from Vladimir Putin, as well as an article highlighting 20 years of broken agreements. A rare piece discusses income tax reforms and the country’s evolving economy.\n\nIl Foglio AI reflects human news but was tested under realistic conditions to show how AI operates practically, including the impact on producing a daily newspaper. It also highlighted that AI-generated letters from readers asked if humans would be obsolete in the future. The article concludes with Cerasa noting the experiment as a real-world test of AI's practical applications.",
      "publisher": "theguardian",
      "url": "https://www.theguardian.com/technology/2025/mar/18/italian-newspaper-says-it-has-published-worlds-first-ai-generated-edition",
      "imgURL": "https://i.guim.co.uk/img/media/560663908b8161100c42940e48770b9086b23a5c/0_0_4032_2419/master/4032.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=04d2e6c0c9a9e40f218566dc08fe5a37",
      "date": "2025-03-18T00:00:00"
    },
    {
      "news_number": 1,
      "title": "Introducing Stable Virtual Camera: Multi-View Video Generation with 3D Camera Control — Stability AI",
      "content": "Today, researchers are launching **Stable Virtual Camera**, a multi-view diffusion model that transforms 2D images into immersive 3D videos with realistic depth and perspective—without complex reconstruction or scene-specific optimization. This technology allows users to precisely control camera angles and generate smooth 3D video outputs from single or multiple input images. Unlike traditional methods, Stable Virtual Camera offers intuitive user-controlled camera trajectories like Dolly zoom paths, pan, zoom in/out, and pans left/right, while producing videos with up to 1,000 frames that maintain seamless transitions when revisiting viewpoints.\n\nThe model is available under a non-commercial license for research use and can be downloaded from Hugging Face, where the weights are accessible on GitHub. It claims state-of-the-art results in novel view synthesis (NVS) benchmarks, excelling in both large-viewpoint NVS (emphasizing generation capacity) and small-viewpoint NVS (focusing on temporal smoothness).",
      "publisher": "stability",
      "url": "https://stability.ai/news/introducing-stable-virtual-camera-multi-view-video-generation-with-3d-camera-control",
      "imgURL": "http://static1.squarespace.com/static/6213c340453c3f502425776e/62f2452bc121595f4d87c713/67d8d51ac6be522931f2b0eb/1742315849431/Stable+Virtual+Camera+1x1+Option+10.png?format=1500w",
      "date": null
    },
    {
      "news_number": 2,
      "title": "Grok, Musk, and Modi: The AI Controversy Exposing India’s Shifting Digital Power Play",
      "content": "The article discusses two incidents involving AI chatbots that caused significant public backlash:\n\n1. **Microsoft's Tay Chatbot Incident**: Microsoft's Tay, developed by its parent company, was shut down quickly after being manipulated by users for sensitive reasons, such as racial slurs found through user interactions. This led to the shutdown of the AI tool and highlighted how individuals could find out about its workings indirectly.\n\n2. **X on 2025**: X, Microsoft's parent company, shut down Grok chatbot in 2025 after it was used by users with liberal left views or right-wing support. Unlike Tay, Grok spread harmful content without knowledge of its creators and mechanisms, causing further chaos.\n\nThe article also notes the systemic inequality faced by the Modi government last year versus a similar shift at X in 2025, emphasizing how AI can be both a tool for influence and a source of disinformation. The authors suggest that Grok's openness to harmful content may exacerbate existing inequalities, while Tay was specifically targeted.\n\nOverall, the article explores how AI tools can manipulate people for various reasons, from personal relationships to political purposes, raising questions about their impact on society.",
      "publisher": "frontline",
      "url": "https://frontline.thehindu.com/science-and-technology/grok-chatbot-tay-microsoft-elon-musk-india-censorship-free-speech-shift/article69344524.ece",
      "imgURL": "https://fl-i.thgim.com/public/incoming/z40s5z/article69344586.ece/alternates/LANDSCAPE_1200/The%20Grok%20logo%20on%20a%20laptop%20",
      "date": "2025-03-18T12:29:59+00:00"
    },
    {
      "news_number": 3,
      "title": "Adobe Launches Adobe Experience Platform Agent Orchestrator for Businesses to Activate AI Agents in Customer Experiences and Marketing Workflows",
      "content": "Adobe has unveiled the Agentic AI Product Platform (AEP), revolutionizing marketing with purpose-built AI agents. Marketers can leverage AEP for optimizing websites, refining content targets, conducting channel experiments, and automating website scaling. This marks a significant step in agentic AI's growth.",
      "publisher": "news",
      "url": "https://news.adobe.com/news/2025/03/adobe-launches-adobe-experience-platform-agent-orchestrator-for-businesses",
      "imgURL": "https://news.adobe.com/news/2025/03/media_18bc2772350c483ed9d4f105cbae3f10913cdad08.png?width=1200&format=pjpg&optimize=medium",
      "date": null
    }
  ],
  "Health": [
    {
      "news_number": 0,
      "title": "Lifestyle risks weigh heavier on women's hearts: Study, Health News, ET HealthWorld",
      "content": "A study presented at the American College of Cardiology Annual Scientific Session revealed that women have more cardiovascular risk factors in relation to heart disease compared to men. The research focused on eight health factors and found that women were significantly more likely to exhibit ideal health scores, with poorer health being fewer positive factors or more negative ones. Women also had higher risks of conditions like unstable angina and peripheral arterial disease relative to men. While the study did not find sex differences in general risk assessment, it highlighted that individual factors influenced outcomes differently between genders. Future research is needed to explore whether biological or sociocultural factors explain these differences.",
      "publisher": "health",
      "url": "https://health.economictimes.indiatimes.com/news/industry/lifestyle-risks-weigh-heavier-on-womens-hearts-study/119205714",
      "imgURL": "https://etimg.etb2bimg.com/thumb/msid-119205714,imgsize-153602,width-1200,height=765,overlay-ethealth/industry/lifestyle-risks-weigh-heavier-on-womens-hearts-study.jpg",
      "date": null
    },
    {
      "news_number": 1,
      "title": "End of medicine as we know it",
      "content": "CRISPR advances, immunotherapy, gene-editing in India, CAR-T cells, personalized cancer care, oncology evolution.",
      "publisher": "financialexpress",
      "url": "https://www.financialexpress.com/business/healthcare-end-of-medicine-as-we-know-it-3781077/",
      "imgURL": "https://www.financialexpress.com/wp-content/uploads/2025/03/mdicines.freepik.jpg",
      "date": null
    },
    {
      "news_number": 2,
      "title": "Google announces health-related AI summaries in Search",
      "content": "Google has introduced **What People Suggest**, an AI health summarization feature that allows users to compare their health with others’ experiences. Users can input details of conditions they have and see suggestions tailored to their symptoms, such as exercises for arthritis patients. This feature will be available on mobile devices in the U.S., according to a company blog post. Additionally, Google plans to expand its knowledge panels to cover thousands of health-related issues using AI. The information boxes or panels will appear in more countries and languages, including Spanish, Portuguese, and Japanese for mobile users. In February, Google’s **Loss of Pulse Detection** feature was approved by the FDA for use in Pixel Watch 3. Google also announced an AI co-scientist called Gemini 2.0, which helps biomedical researchers refine hypotheses based on chemical data.",
      "publisher": "thehindu",
      "url": "https://www.thehindu.com/sci-tech/technology/google-announces-health-related-ai-summaries-in-search/article69347733.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/3kvnq0/article69347715.ece/alternates/LANDSCAPE_1200/2025-02-25T180850Z_1004347677_RC2AF9ABA94E_RTRMADP_3_ITALY-ALPHABET-ANTITRUST.jpg",
      "date": "2025-03-19T06:38:06+00:00"
    },
    {
      "news_number": 3,
      "title": "Sunita Williams returns to Earth: Her health challenges have just begun",
      "content": "Nasa astronauts Sunita Williams and Barry Wilmore returned safely after a nine-month trip on the International Space Station (ISS), their eight-day mission ending abruptly due to technical issues. They touched down in Florida, experienced bone and muscle damage, gained inches of height, and faced mental challenges from long space exposure. Long-term effects included heart changes and radiation stress, potentially causing osteoporosis. Williams' story illustrates overcoming tough periods on space, proving the capability for extraordinary achievements in the cosmos.",
      "publisher": "indiatoday",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-returns-to-earth-her-health-challenges-have-just-begun-2695519-2025-03-19",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202503/sunita-williams-return-mission-181609730-16x9_1.jpg?VersionId=jwHv3nvOP5g4ByOPZvwtX9Tac2mVCLii",
      "date": "2025-03-19T00:00:00"
    }
  ],
  "Sports": [
    {
      "news_number": 0,
      "title": "The Battle for NHL’s MVP: Breaking down the 2025 Hart Memorial Trophy race",
      "content": "The 2025 Hart Memorial Trophy race in NHL is heating up, with key players vying for dominance. Leon Draisaitl, an elite goal scorer with top-tier offensive play, is leading the league in goals, with a PPG ranking above other teams' averages. Connor Hellebuyck, a dominant goaltender, has been exceptional, leading in save/loss ratio and key stats. Nathan MacKinnon leads the league in points per game with strong leadership. Coasting players like Conor McDavid and Kirill Kaprizov also play crucial roles. Despite injuries, these players are expected to impact their teams significantly. The final games will determine the winner, with the Hart Trophy's fate near conclusion.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/sports/nhl/news/the-battle-for-nhls-mvp-breaking-down-the-2025-hart-memorial-trophy-race/articleshow/119198234.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-119198224,width-1070,height-580,imgsize-20622,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 1,
      "title": "Scores & Fixtures",
      "content": "Time is one of humanity’s most important concepts — without it we cannot move or have experiences. On this date there are no events to show, live updates, or coverage — all times will be in the UK, with BBC not responsible for any changes.",
      "publisher": "bbc",
      "url": "https://www.bbc.com/sport/cricket/scores-fixtures",
      "imgURL": "https://static.files.bbci.co.uk/core/website/assets/static/sport/bbc-sport-logo.0da9386782.png",
      "date": null
    },
    {
      "news_number": 2,
      "title": "India take on Maldives in international friendly: Indian sports LIVE, March 19",
      "content": "In 2025, Indian athletes are back to their best! On March 19, India vs Maldives played a historic match in an international friendly, with Sunil Chhetri returning from retirement. Meanwhile, badminton saw a vibrant event at the Swiss Open Super300. These key highlights set the scene for the rest of March, offering thrilling moments ahead.",
      "publisher": "espn",
      "url": "https://www.espn.in/espn/story/_/id/44304312/india-vs-maldives-football-live-news-scores-results-updates-indian-sports-march-19-2025",
      "imgURL": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0720%2Fr1360926_1296x729_16%2D9.jpg",
      "date": null
    }
  ],
  "Finance": [
    {
      "news_number": 0,
      "title": "Bajaj Housing Finance shares surge 6%; Here is why April 15 is key for the stock",
      "content": "Bajaj Housing Finance shares closed up 6% on March 19, extending a two-day upward run, after a 14% gain in the past month. The company is nearly positive for the year but still behind post-listing highs of ₹188, trading just below that. Management from Bajaj Finance will end their term. Morgan Stanley's analysis projects potential decline next year due to Rajeev Jain's role, and shares trade up 5.7% after hitting a 34% decline post-IPO. Key points include analysts with mixed ratings (3 \"buy,\" 3 \"sell,\" 1 \"hold\") projecting a 15% risk, ending lock-in on April 15th for half shares.",
      "publisher": "cnbctv18",
      "url": "https://www.cnbctv18.com/market/bajaj-housing-finance-share-price-surge-rajeev-jain-future-april-15-key-post-ipo-high-19575684.htm",
      "imgURL": "https://images.cnbctv18.com/uploads/2024/12/stock-market-2024-12-b28808ac008b680321649e163e6cf702.jpg?im=FitAndFill,width=500,height=300",
      "date": "2025-03-19T11:08:19+05:30"
    },
    {
      "news_number": 1,
      "title": "Life after Bajaj: Allianz fast tracks plans of new alliance with Jio Financial",
      "content": "The article states that login to the account requires ET Prime credentials. Users must enter their credentials to enjoy member benefits. To log out, users should use their current account credentials and re-enter them with new ET Prime credentials to unlock all member benefits.",
      "publisher": "m",
      "url": "https://m.economictimes.com/industry/banking/finance/insure/allianz-se-eyes-partnership-with-jio-financial-after-ending-24-year-tie-up-with-bajaj/articleshow/119175811.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-119185470,width-1200,height-630,imgsize-30594,overlay-economictimes/articleshow.jpg",
      "date": null
    },
    {
      "news_number": 2,
      "title": "Closing Bell: Market makes it 3 in a row; Nifty above 22,900, Sensex up 148 points",
      "content": "Nifty demonstrated significant gains on Wednesday, closing 73 points higher than its opening price. Mid-session it moved sideways, consolidating near highs. The market faced strong breadth with outperformance in broader indices. An overhead resistance at ~$23k levels is critical, while support exists around $228k.",
      "publisher": "moneycontrol",
      "url": "https://www.moneycontrol.com/news/business/markets/stock-market-live-sensex-nifty-50-share-price-gift-nifty-latest-updates-19-03-2025-liveblog-12968743.html",
      "imgURL": "https://images.moneycontrol.com/static-mcnews/2025/03/20250319092815_Sensex_up_nifty_airline.jpg",
      "date": "2025-03-19T07:33:21+05:30"
    },
    {
      "news_number": 3,
      "title": "No plan to merge PSBs; recovery from written-off loans improved: Finance Ministry",
      "content": "The Finance Ministry has announced plans for no mergers or consolidations of Public Sector Banks (PSBs) under Rajya Sabha, despite proposing the privatisation of two PSBs in 2021. In 2019, four major mergers were planned to consolidate PSBs, reducing their total from 27 to 12. Improved performance in GNPA and reduced wilful defaulters are noted, with recovery data showing an increase from 193 to 47 in March 2024 compared to 2020. Banks continue to pursue recovery actions against written-off loans through civil courts and tribunals, aligning with RBI guidelines.",
      "publisher": "thehindubusinessline",
      "url": "https://www.thehindubusinessline.com/economy/no-plan-to-merge-psbs-recovery-from-written-off-loans-improved-finance-ministry/article69344787.ece",
      "imgURL": "https://bl-i.thgim.com/public/incoming/96nydc/article69324591.ece/alternates/LANDSCAPE_1200/IMG_bl01_counting_2_1_SPE0OSQ7.jpg",
      "date": "2025-03-18T13:38:02+00:00"
    }
  ],
  "Geopolitical": [
    {
      "news_number": 0,
      "title": "Changing geopolitics gets a special mention at HP’s Amplify conference in Nashville",
      "content": "The global race for AI dominance is altering geopolitics as tech firms increasingly shape the relationship between technology and politics. Enzo Lores, HP's CEO, highlights a shift from a global station model to regional station models, where products are built regionally, distributed digitally, and designed locally. This change reflects evolving techno-geopolitics and offers tech companies strong positions in an era of changing power dynamics. While China remains dominant, other countries like India and Thailand are investing in local manufacturing. The US, with its focus on global technology, faces challenges but is also expanding into local markets, especially through expanded factory operations in specific regions. Lores notes the shift has significant implications for design and marketing, though tech companies, particularly in AI, are leveraging regional production and digital interfaces to tap into new opportunities.",
      "publisher": "indianexpress",
      "url": "https://indianexpress.com/article/technology/tech-news-technology/changing-geopolitics-gets-a-special-mention-at-hps-amplify-conference-in-nashville-9893394/",
      "imgURL": "https://images.indianexpress.com/2025/03/HP-event.jpg",
      "date": "2025-03-19T08:45:24+05:30"
    },
    {
      "news_number": 1,
      "title": "Gold hits record high over $3,000 amid rising geopolitical tensions; Thames Water receives six takeover offers – as it happened",
      "content": "**Summary of News Items**\n\n1. **UK Debt Restructuring:**\n   - The UK government seeks £3 billion in restructuring for public transport projects but will impose additional fines if the request is not supported. This balance between debt relief and maintaining trust is crucial.\n\n2. **Bus Franchising in Yorkshire:**\n   - South Yorkshire announced taking buses to public control from September 2027, aiming for a unified system across city centers that enhances accessibility and economic impact.\n\n3. **Bee Network Launch:**\n   - Manchester's Bee Network project will introduce an innovative bus franchise system, potentially revolutionizing public transport infrastructure in the UK.\n\n4. **Harrow & Wymondham Partnership:**\n   - A £75 million franchise agreement brings more buses to public control from September 2027, aiming for a comprehensive integrated transport network across Harrow and Wymondham areas.\n\n5. **Harrow Franchise Agreement:**\n   - Harrow will join a £75 million franchise agreement with Wymondham for new £85 million buses at Harby Field, providing enhanced service through integrated stations.\n\n6. **Harlow Franchise Agreement:**\n   - Harlow's plan includes 40 buses and 7 depots, aiming to create a more integrated transport network across their areas.\n\n7. **Covalis Capital Bid for Thames Water:**\n   - Covalis offers £5 billion in a competitive bidding for Thames Water's bus franchise, with potential extra costs if not supported by the regulator. Thames is expected to secure funding without excessive fines.\n\n8. **Debt Relief Considerations:**\n   - The UK government faces an increased debt relief requirement of £3 billion next five years, balancing funding needs against maintaining public trust and investor confidence.",
      "publisher": "theguardian",
      "url": "https://www.theguardian.com/business/live/2025/mar/18/gold-hits-record-high-over-3000-geopolitical-tensions-weakening-us-dollar-oil-stock-markets-inflation-business-live-news",
      "imgURL": "https://i.guim.co.uk/img/media/a2595d78a09ddd645ff4812a3a80dd45cfa663b9/0_804_4001_2401/master/4001.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=978bd3039b4d3054e23d8ee9811ed0b2",
      "date": "2025-03-18T00:00:00"
    },
    {
      "news_number": 2,
      "title": "Oil holds drop with US stockpile climb and geopolitics in focus",
      "content": "The U.S. crude oil prices have experienced a sustained decline due to supply chain issues and increased production from OPEC, with Brent crude near $70 and WTI below $67 per barrel. Geopolitical tensions involving Russia and Iran remain tight, with Donald Trump signaling sanctions against Iran and Vladimir Putin restricting attacks on Ukraine, while U.S. President-elect Trump has expanded his trade war tactics. Investors closely watch the Fed's interest rate decision on Wednesday as Trump intensifies his trade war. The broader market faces a bearish environment amid economic slowdowns and weaker demand from China.",
      "publisher": "cnbctv18",
      "url": "https://www.cnbctv18.com/market/oil-holds-drop-with-us-stockpile-climb-and-geopolitics-in-focus-19575580.htm",
      "imgURL": "https://images.cnbctv18.com/uploads/2024/11/crude-oil-2024-11-2a8bfe0484b97a4fdbda6225f33e22f9.jpg?im=FitAndFill,width=500,height=300",
      "date": "2025-03-19T06:49:52+05:30"
    }
  ],
  "Crypto": [
    {
      "news_number": 0,
      "title": "Here’s why Pi Network, Jasmy, LTC, Ethena, and altcoins are down",
      "content": "Crypto prices resumed their downward trend on Tuesday as market participants awaited the second Federal Reserve interest rate decision of the year, signaling uncertainty ahead amid rising fear of a recession and ongoing speculative trade in Bitcoin (BTC) and altcoins like Pi Network, JASMY, LTC, and Ethena. Pi Network (PI), the viral tap-to-earn token, was one of the worst performers, dropping by almost 13%. JasmyCoin (JASMY) fell by 6%, while Litecoin (LTC) and Ethena (ENA) dropped over 5%. The total market cap of all cryptocurrencies fell 1.70% to $2.7 trillion, wiping out more than $1 trillion in value, while liquidations reached over $227 million. The recent sell-off coincided with a stock market downturn, as the Dow Jones index lost 410 points and Nasdaq 100 fell 350 points, with blue-chip stocks like NVIDIA, Tesla, Microsoft, and Apple dropping by over 1%. The Fed is expected to leave rates unchanged at 4.50%, but traders will closely watch the dot plot for potential rate changes. The ongoing crypto and stock market crash could indicate investor fears about a recession and the Fed’s economic outlook, with Bitcoin and altcoins showing signs of falling as speculative traders react to upcoming Fed decisions.",
      "publisher": "crypto",
      "url": "https://crypto.news/heres-why-pi-network-jasmy-ltc-ethena-and-altcoins-are-down/",
      "imgURL": "https://crypto.news/app/uploads/2024/09/crypto-news-Pi-Network-option08.webp",
      "date": "2025-03-18T17:39:23+00:00"
    },
    {
      "news_number": 1,
      "title": "Crypto doomsday? Former Binance CEO Changpeng Zhao predicts 95% of crypto investors will fail, only a few will survive the market’s future",
      "content": "CZ critiques Bitcoin's oversimplification, categorizing investors into tourists, fools, and fakes, limiting their ability to dominate. Only 5% truly understand the market, while most underperform due to emotional factors. This reflects Bitcoin's \"set-and-forget\" approach, despite macroeconomic challenges. Bitcoin near $83k tests a critical resistance level, with analysts attributing volatility to uncertainty. CZ suggests Bitcoin as a safe haven amid speculative trends and influencer hype, emphasizing disciplined strategies or influencer traction are needed.",
      "publisher": "m",
      "url": "https://m.economictimes.com/news/international/us/crypto-doomsday-former-binance-ceo-changpeng-zhao-predicts-95-of-crypto-investors-will-fail-only-a-few-will-survive-the-markets-future/articleshow/119177170.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-119177158,width-1200,height-630,imgsize-414212,overlay-economictimes/articleshow.jpg",
      "date": null
    },
    {
      "news_number": 2,
      "title": "Why Cathie Wood believes most memecoins ‘not going to be worth much’; Bitcoin price today, and more…",
      "content": "Cathie Wood, the founder of ARK Investment Management (ARK Invest), predicts memecoins in the $2.6 trillion cryptocurrency market will be undervalued but not worth much, advising investors to stay cautious. She warns that while some may survive time, most won't, noting Bitcoin has a chance to reach over $1 million by 2030 with current prices suggesting Bitcoin remains under resistance levels. Ethereum is also in the middle of a correction, at around $1,937.82, up 1.8% from the day before. Meta_planet's additional BTC holdings could hint at broader interest in digital assets.",
      "publisher": "livemint",
      "url": "https://www.livemint.com/market/cryptocurrency/cathie-wood-us-investor-most-memecoins-not-going-to-be-worth-much-warns-crypto-news-bitcoin-price-today-march-19-markets-11742355775879.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2025/03/19/1600x900/Cathie_Wood_memecoin_markets_invest_crypto_news_US_1742371259534_1742371259793.jpg",
      "date": "2025-03-19T14:24:01+05:30"
    },
    {
      "news_number": 3,
      "title": "Crypto firm backed by Trump family sells $550 million worth of tokens amid ethical concerns",
      "content": "World Liberty Financial (WLFI), backed by the U.S. President Donald Trump’s family, sold $550 million worth of its tokens through two rounds of sales, generating over $250 million in asset purchases during KYC verification with 85,000 participants. The tokens cannot be traded on crypto exchanges as WLFI isn’t yet listed, limiting their direct market involvement but aiding DeFi growth.WLFI aims to expand into the cryptocurrency space, securing 75% of its revenue from the U.S. Trump family. Ethical concerns rise with Sun, a WLFI founder, purchasing $75 million worth of tokens and potential legal actions against him over a civil case. Despite these issues, WLFI’s focus on DeFi positioning has elevated it as a significant crypto player.",
      "publisher": "indianexpress",
      "url": "https://indianexpress.com/article/technology/tech-news-technology/trump-family-world-liberty-financial-crypto-firm-token-sales-9892227/",
      "imgURL": "https://images.indianexpress.com/2025/03/US_0dddf8.jpg",
      "date": "2025-03-19T09:12:48+05:30"
    }
  ]
}