{
  "AI": [
    {
      "news_number": 0,
      "title": "Video: AI Robot Attacks Crowd At China Festival, Internet Says ''So It Begins'\"",
      "content": "Shocking footage has captured the moment a humanoid robot went rogue and charged at a crowd of festival-goers. The video, taken on February 9 at the Spring Festival Gala in Tianjin, northeast China, shows the robot, clad in a vibrant jacket, suddenly lunging towards a group of stunned onlookers gathered behind a barricade. Security personnel swiftly intervened, dragging the erratic robot away from the crowd to prevent any potential harm.\n\nEvent organizers downplayed the incident, attributing it to a \"robotic failure.\" They assured that the robot had successfully passed safety tests before the event and emphasised that measures have been taken to prevent such an incident from occurring again, Metro reported.\n\nWatch the video here:\n\nChinese AI robot goes rogue and attacks a person before getting shut down! 🇨🇳 🤖\n\n\n\nJust a little preview of our bright future.. pic.twitter.com/esZRSWOBJP — Global Dissident (@GlobalDiss) February 20, 2025\n\n\n\nThe robot in question is a \"humanoid agent AI avatar\" made by Unitree Robotics. According to reports, a software glitch is believed to have triggered the robot's erratic behaviour.\n\nThis incident is not an isolated one as there have been previous cases of rogue AI making headlines, including an instance where a robot attacked an engineer at Tesla's Texas factory. The machine pinned him down and inflicted injuries with its claws on their back and arm, leaving behind a trail of blood, according to an official incident report.\n\nIn many of these cases, software malfunctions have been identified as the underlying cause, highlighting the importance of robust testing and quality control in AI development.\n\nGrowing concerns have been raised about the potential risks and consequences of machines on human life. Reacting to the video, one user wrote, \"So it begins... An AI-controlled robot attacked a human.\"\n\nAnother commented, \"Just a little preview of our bright future.\" A third said, \"Can we please work out ALL the glitches before being released upon the public?\" A fourth added, \"Should we be worried that AIs and robots can turn dangerous against humans due to glitch.\"",
      "publisher": "ndtv",
      "url": "https://www.ndtv.com/world-news/video-ai-robot-attacks-people-at-china-festival-internet-says-so-it-begins-7808616",
      "imgURL": "https://c.ndtvimg.com/2025-02/cf8vafpg_robot-attacks-crowd_625x300_27_February_25.jpeg",
      "date": null
    }
  ],
  "health": [
    {
      "news_number": 0,
      "title": "This everyday vitamin can help ease period pain, says NHS doctor",
      "content": "How to manage and reverse PCOS with lifestyle changes\n\nFor many women, dealing with the dreadful period pain is a struggle every month. Many of them reach for painkillers, hot water bottles and herbal teas. However, there is one vitamin that could actually make a difference to this debilitating pain, according to an NHS doctor. Dr Karan Rajan, a surgeon and popular health educator, says Vitamin D could play an important role in easing period pain, particularly for women with primary dysmenorrhea - the type of period pain not linked to any underlying condition.Primary dysmenorrhea is the cramping pain that comes before or during a period. This is caused by natural chemicals called prostaglandins that are made in the lining of the uterus. They cause the muscles and blood vessels of the uterus to contract. According to Johns Hopkins Medicine, women with primary dysmenorrhea have abnormal contractions of the uterus due to a chemical imbalance in the body.Dr Rajan discusses the role of Vitamin D in dealing with primary dysmenorrhea in the latest instalment of his newsletter, 6 Interesting Things.Dr Rajan explains how the everyday vitamin represses the enzymes responsible for prostaglandin synthesis, which could reduce the severity of the pain.\"It represses the enzymes responsible for prostaglandin synthesis while simultaneously upregulating the enzymes that break them down. The result? Fewer of those pain-inducing prostaglandins floating around, theoretically leading to less uterine agony,\" he said.He said that an analysis of eight clinical trials discovered that the supplementation could reduce the intensity of pain and the number of days with pain for women with primary dysmenorrhea.According to a study published in Obstetrics & Gynecology Science, Vitamin D supplementation in women with primary dysmenorrhea and vitamin D deficiency could improve systemic symptoms and reduce pain intensity, the number of days with pain, and the need for consuming pain-relief medications.Dr Rajan says one should take the right dose of Vitamin D for health benefits. NHS says adults should not take more than 100 micrograms (4,000 IU) of vitamin D and that 10 micrograms a day is enough for most people.\"While vitamin D shows promise, it's not a silver bullet. It's more like a bronze arrow in the quiver of period pain management ,\" says Dr Rajan.To deal with painful periods, applying heat, doing light exercise, and managing stress can help relax muscles and improve blood flow.Over-the-counter pain relief , such as NSAIDs like ibuprofen, can also ease discomfort. For some, hormonal contraceptives may offer longer-term relief.If period pain regularly disrupts daily life, speaking to a healthcare provider is essential to explore tailored solutions.",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/this-everyday-vitamin-can-help-ease-period-pain-says-nhs-doctor/articleshow/118611330.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118611335,width-1070,height-580,imgsize-43834,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    }
  ],
  "sports": [
    {
      "news_number": 0,
      "title": "'Things could have been different': Fakhar Zaman's honest admission after Pakistan's Champions Trophy exit",
      "content": "Fakhar Zaman (AP Photo)\n\nGo Beyond The Boundary with our YouTube channel. SUBSCRIBE NOW!\n\nChampions Trophy: How good is Virat Kohli in football? | Rishabh Pant recovers from viral\n\nNEW DELHI: Hosts and defending champions of the 2025 Champions Trophy , Pakistan, had a dismal start to their campaign, suffering a 60-run defeat against New Zealand. Their woes continued with a six-wicket loss to India in Dubai, effectively ending their hopes of reaching the semifinals.Any chance of finishing the tournament on a high was also dashed when rain forced the abandonment of their final match against Bangladesh at the Rawalpindi Cricket Ground.One of Pakistan’s key missteps in the tournament was not utilising star opener Fakhar Zaman at the top of the order.Zaman himself admitted that had he opened in their first match against New Zealand while chasing a daunting 320-run target, the outcome could have been different.During that very game in Karachi, Zaman sustained an injury and was later ruled out of the tournament due to a recurring knee issue. Imam-ul-Haq was named as his replacement.Zaman batted at No. 4, managing just 24 off 41 balls while visibly struggling, as Pakistan slumped to a 60-run loss.\"Had I opened then things could have been different because when you get a big target, then the opener has a big role to play,\" Zaman said in a video posted by Pakistan Cricket Board .Zaman said he had seen a marked improvement in his injury over the week.\"In the last week, I've seen a marked improvement in my healing. The doctor has said that I can start training after three weeks, so I should be back in one month.\"Zaman said despite white-ball cricket being his favourite, he still wants to play the red-ball format.\"I still want to play Tests but the coaches and captain have their own plans and I also feel that there are better Test players in Pakistan,\" he said, adding, \"I would like to open on my comeback but it's up to them where they want to keep me.\"",
      "publisher": "timesofindia",
      "url": "https://timesofindia.indiatimes.com/sports/cricket/icc-champions-trophy-2025/fakhar-zamans-honest-admission-after-pakistans-champions-trophy-exit-ind-vs-pak/articleshow/118608749.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118608825,width-1070,height-580,imgsize-41318,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    }
  ],
  "finance": [
    {
      "news_number": 0,
      "title": "Stock Market Today | Sensex Nifty 50 Highlights: Markets end flat after rangebound session; Sharp gains banks, NBFCs",
      "content": "Sensex Nifty Today | Stock Market Highlights: The key Indian equity indices are trading higher in afternoon trade on Thursday. The Nifty 50 is hovering around 22,550 while the BSE Sensex is trading around 74,600. Cement and auto stocks see big cuts while banks and financials see relative outperformance. The broader markets are also in the red with the BSE Smallcap down nearly 2% and BSE Midcap trading 1% down.\n\nStay tuned for the latest updates from Indian markets, key stocks in news, views and expert opinion on this market blog. We will be bringing you fresh updates every 20 minutes.\n\nLive Updates",
      "publisher": "financialexpress",
      "url": "https://www.financialexpress.com/market/bse-sensex-nifty-50-stock-market-today-live-updates-27-february-2025-3761679/",
      "imgURL": "https://www.financialexpress.com/wp-content/uploads/2025/02/BSE-Image-edited.jpg",
      "date": null
    }
  ],
  "geopolitical": [
    {
      "news_number": 0,
      "title": "Italy to host 2025 Antarctic conference in Milan",
      "content": "Italy is set to host the Antarctic Treaty Consultative Meeting in June 2025 in Milan, marking a significant step in reinforcing its leadership in polar research and environmental protection. This milestone, part of Italy’s broader strategic framework, underscores its commitment to global scientific collaboration and climate change mitigation at a time when Antarctic governance and geopolitical interests are increasingly intertwined\n\nDriving the news. This week, the Italian government presented a comprehensive analysis to Parliament outlining its global engagement in 2024 and setting the stage for 2025.\n\nItaly’s role as host of the ATCM is central to these plans, which will serve as a critical platform for Antarctic governance, environmental protection, and scientific cooperation.\n\nThe meeting will take place from 23 June to 3 July 2025 at the Fiera Milano Congressi Convention Centre (MI.CO.), the largest convention venue in Italy, located in a central area of Milan.\n\nIt will coincide with the United Nations Decade on the Cryosphere launch.\n\nWhy it matters. The ATCM is a pivotal meeting in the framework of Antarctic governance.\n\nIt is crucial for environmental protection and scientific collaboration in Antarctica.\n\nBy hosting the conference, Italy reaffirms its commitment to polar research and underscores its determination to tackle climate change globally.\n\nItaly’s Antarctic footprint. Since 1985, Italy has been actively engaged in Antarctic research under the National Antarctic Research Program (PNRA), funded by the Ministry of University and Research (MUR).\n\nThe National Research Council (CNR) coordinates key projects that address global challenges such as climate change.\n\nItalian National Agency for New Technologies, Energy and Sustainable Economic Development (ENEA) manages logistical operations at Italy’s Antarctic bases, ensuring efficient support for field research.\n\nThe National Institute of Oceanography and Experimental Geophysics (OGS) operates the icebreaker Laura Bassito facilitate vital marine studies.\n\nOngoing research. Italian Antarctic missions are integral to tracking climate change and enhancing global environmental models.\n\nResearch spans climatology, seismology, geodesy, and geomagnetism, alongside upper atmosphere and space weather studies.\n\nThe 40th Italian Antarctic Expedition, from November 2024 to mid-February 2025, involved 140 researchers at the Mario Zucchelli Station, located at Terra Nova Bay.\n\nFrom mid-February, a winter-over team at Concordia Station—co-managed with France—ensures year-round scientific continuity under extreme conditions.\n\nAntarctic geopolitical gambit. While the 1959 Antarctic Treaty designates the continent as a zone for peaceful scientific research, territorial claims remain frozen among seven nations.\n\nCountries such as Argentina, Australia, Chile, France, New Zealand, Norway, and the United Kingdom maintain their historical claims.\n\nIn contrast, China and Russia are leveraging their Antarctic presence not solely for science but to further their broader geopolitical ambitions.\n\nWhat’s next. The intersection of scientific collaboration and geopolitical interests makes Antarctica increasingly significant.\n\nBy hosting the 2025 ATCM, Italy will showcase its leadership in Antarctic research and foster global cooperation on cryosphere science, climate change mitigation, and biodiversity conservation.\n\nThe event offers Italy an opportunity to elevate its role as a global polar research hub, reinforcing its commitment to international environmental and scientific agendas.\n\n(Photo: Mario Zucchelli Station, Francisco Ardini / ©PNRA)",
      "publisher": "decode39",
      "url": "https://decode39.com/10042/italy-to-host-2025-antarctic-conference-in-milan/",
      "imgURL": "https://decode39.com/wp-content/uploads/2025/02/2048px-Mario_Zucchelli_Station_06.jpg",
      "date": "2025-02-27T09:00:47+00:00"
    }
  ],
  "crypto": [
    {
      "news_number": 0,
      "title": "House Democrats take aim at $TRUMP crypto meme coin",
      "content": "A U.S. flag flies near the dome of the US Capitol in Washington, D.C., Feb. 25, 2025.\n\nA U.S. flag flies near the dome of the US Capitol in Washington, D.C., Feb. 25, 2025.\n\nA U.S. flag flies near the dome of the US Capitol in Washington, D.C., Feb. 25, 2025.\n\nA U.S. flag flies near the dome of the US Capitol in Washington, D.C., Feb. 25, 2025.\n\nWhile President Donald Trump’s proudest supporters on Capitol Hill shower him with legislation proposing putting his portrait on a $250 bill, declaring his birthday a national holiday or adding his likeness to Mount Rushmore -- a new effort across the aisle isn’t as flattering -- as House Democrats take aim at the president’s $TRUMP meme coin.\n\nSince launching a little over a month ago, the $TRUMP coin has tanked in value after early investors dumped the cryptocurrency. Members of Congress have noticed as hundreds of thousands of investors have taken hard hits and billions in value have quickly vanished.\n\nCalifornia freshman Democrat Rep. Sam Liccardo told ABC News on Thursday he will introduce legislation to prohibit the country’s top officials and their families -- from Congress to the White House -- from capitalizing on personal meme coins.\n\nU.S. President Donald Trump hosts his first cabinet meeting with Elon Musk in attendance, Washington, D.C., U.S., Feb. 26, 2025. Brian Snyder/Reuters\n\nThe Modern Emoluments and Malfeasance Enforcement (MEME) Act would prohibit the president, vice president, members of Congress, senior executive branch officials and their spouses and dependent children from issuing, sponsoring or endorsing a security, future, commodity or digital asset.\n\nLiccardo said he believes that the president and first lady Melania Trump cashed in on their meme coins and enriched investors around the world who initially supported the cryptocurrency.\n\nTrump launched the coin in January, days before he took office. A similar Melania coin had been issued a week earlier. Trump in July said he wanted to turn the U.S. into the \"crypto capital of the planet.\"\n\nWhile Liccardo’s legislation is not expected to become law over the next two years under Republican majorities in the House and Senate, the freshman Democrat said that the president and first lady made a windfall on their respective meme coins and is working to build support that culminates behind a Democrat majority.\n\n“Let’s make corruption criminal again,” Liccardo, a former federal and local criminal prosecutor, said. “Our public offices belong to the public, not the officeholders, nor should they leverage their political authority for financial gain. The Trumps’ issuance of meme coins financially exploits the public for personal gain, and raises the specter of insider trading and foreign influence over the Executive Branch.”\n\nA U.S. flag flies near the dome of the US Capitol in Washington, D.C., Feb. 25, 2025. Saul Loeb/AFP via Getty Images\n\nThe proposal would forbid federal officials from promoting a range of financial assets or from participating in any conduct likely to financially benefit themselves, according to Liccardo. The legislation would impose criminal and civil penalties and includes a prohibition that applies to any financial asset, such as the stock of Truth Social.\n\nLiccardo wants to subject violators to criminal and civil penalties while stopping them from profiting from an asset issued before the bill's enactment -- giving it retroactive element intended to address the launch of $TRUMP.\n\nLiccardo said he has a dozen Democratic cosponsors as he prepares to introduce the legislation on Thursday.\n\nABC News' Max Zahn contributed to this report.",
      "publisher": "abcnews",
      "url": "https://abcnews.go.com/Politics/house-democrats-aim-trump-crypto-meme-coin/story?id=119241283",
      "imgURL": "https://i.abcnewsfe.com/a/39917133-9b55-4017-a58b-220fae05cf24/capitol-dome_1740637624629_hpMain_16x9.jpg?w=1600",
      "date": null
    }
  ]
}