{
  "techAndAI": [
    {
      "news_number": 0,
      "title": "How DeepSeek’s AI Model Is Redefining Global Tech Dynamics",
      "content": "By Dinesh P, Principal Technologist and Founding Member, DaveAI\n\nAI has transformed industries worldwide, with leading players like OpenAI, Google, and Meta shaping its future. However, a new entrant, DeepSeek, has emerged as a game-changer in the AI space, challenging conventional AI development norms. With its cost-efficient yet high-performance AI model, DeepSeek is disrupting global tech dynamics and setting new benchmarks in AI development.\n\nThe Rise of DeepSeek and Its Cost-Efficient Approach\n\nFounded in July 2023 by Liang Wenfeng, DeepSeek is a Chinese AI startup that has gained rapid recognition for its groundbreaking approach to AI model training. In January 2025, DeepSeek unveiled its flagship model, DeepSeek-R1, a direct competitor to OpenAI’s GPT-4. The most striking aspect of DeepSeek’s development strategy is its cost-effectiveness.\n\nLower Development Costs: DeepSeek-R1 was developed in just two months with an estimated budget of under $6 million. In comparison, OpenAI’s GPT-4 reportedly required hundreds of millions of dollars to develop.\n\nEfficient Hardware Utilization: DeepSeek trained its model using approximately 2,000 Nvidia H800 GPUs, showcasing an optimized hardware strategy.\n\nReduced Computational Load: By leveraging efficient training methodologies, DeepSeek minimizes the energy consumption and costs associated with large-scale AI model development.\n\nThis cost-effective approach challenges the prevailing notion that only billion-dollar investments can produce cutting-edge AI. DeepSeek’s methodology demonstrates that innovation and strategic optimization can yield comparable, if not superior, results at a fraction of the cost.\n\nThe Technical Edge: Innovations Powering DeepSeek’s AI Model\n\nDeepSeek’s ability to deliver high-performance AI at significantly lower costs stems from its pioneering technical innovations. Three key elements drive its success:\n\n1. MoE Architecture\n\nDeepSeek employs a Mixture-of-Experts model, a technique that selectively activates certain parts of the model depending on the task. While DeepSeek-R1 has a total of 671 billion parameters, it only activates 37 billion parameters per token processed. This strategy reduces computational demands while maintaining high accuracy and efficiency.\n\n2. Advanced Training Techniques\n\nDeepSeek has mastered knowledge distillation, a process where smaller AI models learn from larger models. This approach allows DeepSeek to optimize its training pipeline, ensuring that even a model with reduced computational requirements performs at par with larger counterparts.\n\n3. Resource Optimization\n\nBy strategically utilizing Nvidia’s H800 GPUs and focusing on algorithmic efficiency, DeepSeek optimizes resource utilization. Unlike other AI developers who rely on massive infrastructure investments, DeepSeek proves that AI breakthroughs can be achieved with a streamlined yet effective approach.\n\nThese innovations make DeepSeek’s AI not just cost-efficient but also scalable and sustainable, reducing the environmental impact of AI training—a growing concern in the AI industry.\n\nGlobal Impact: Disrupting the AI Market and Challenging Industry Giants\n\nDeepSeek’s rise has sent shockwaves across the global AI industry. The implications of its success extend beyond just cost efficiency, influencing market trends, competitive landscapes, and even geopolitical considerations.\n\n1. Market Disruption and Financial Impact\n\nDeepSeek’s ability to develop a high-performance AI model at a fraction of the cost has raised concerns for established AI companies and hardware providers. A clear example of this disruption was seen in the stock market:\n\nNvidia, a dominant AI chip supplier, saw a market cap loss of nearly $600 billion following DeepSeek’s AI model announcement. Investors reassessed the demand for expensive AI infrastructure, realizing that cost-efficient alternatives could reduce reliance on high-end GPUs.\n\nMeta and Google have accelerated their AI investments, recognizing the increasing competition from cost-effective AI models like DeepSeek-R1.\n\n2. Increasing Competitive Pressure\n\nDeepSeek’s entry into the AI industry has intensified competition among AI developers. Companies like OpenAI and Anthropic, which have previously dominated the LLM space, now face a new competitor that can achieve similar results with far fewer resources. This is pushing companies to rethink their AI strategies and explore more efficient methods to stay ahead.\n\n3. Geopolitical and Regulatory Challenges\n\nDeepSeek’s success also highlights the shifting AI power dynamics between China and Western tech firms. The rapid rise of Chinese AI companies like DeepSeek raises questions about the effectiveness of U.S. trade restrictions on AI hardware and whether China’s AI industry can continue to thrive despite these limitations. Policymakers worldwide are now reassessing how they regulate and support AI innovation while ensuring ethical and security considerations are met.\n\nAccording to DaveAI, DeepSeek’s emergence marks a significant shift in the AI industry, redefining the balance between cost, efficiency, and innovation. Its ability to develop high-performance AI at a fraction of traditional costs signals a move toward more accessible and scalable AI solutions. This transformation is expected to democratize AI adoption while accelerating advancements in AI-driven personalization, automation, and decision-making across industries. As AI continues to evolve, companies that prioritize efficiency-driven innovation are likely to set new benchmarks for the future of intelligent technology.\n\nThe Future of AI: Democratization and Ethical Considerations\n\nDeepSeek’s impact extends beyond financial and competitive disruptions—it represents a step towards the democratization of AI. With lower costs and open-weight models, DeepSeek is enabling wider access to AI technology. However, this also comes with new challenges.\n\n1. Lower Barriers to Entry for AI Development\n\nBy proving that high-quality AI models can be developed at lower costs, DeepSeek is lowering the barriers for smaller startups and research institutions. This could lead to a more diverse and innovative AI ecosystem, reducing the dominance of tech giants and fostering a more competitive market.\n\n2. Ethical and Security Implications\n\nAs AI models become more accessible, there are growing concerns about their ethical use, potential biases, and misuse in malicious applications. Governments and regulatory bodies must now focus on establishing AI governance frameworks to ensure responsible AI deployment while promoting technological progress.\n\n3. The Role of Open-Source AI\n\nDeepSeek has embraced open-weight AI models, allowing researchers and developers to build upon its advancements. This could accelerate AI innovation worldwide, leading to the development of more specialized and application-specific AI models.\n\nConclusion\n\nDeepSeek’s rise is a testament to the power of innovation, efficiency, and strategic resource utilization in AI development. By proving that cutting-edge AI can be developed at a fraction of the traditional cost, DeepSeek is not only disrupting the industry but also shaping the future of AI in a more democratized, competitive, and efficient manner. As AI continues to evolve, the lessons from DeepSeek’s success will likely influence how companies and nations approach AI development in the coming years.",
      "publisher": "expresscomputer",
      "url": "https://www.expresscomputer.in/guest-blogs/how-deepseeks-ai-model-is-redefining-global-tech-dynamics/122096/",
      "imgURL": "https://cdn1.expresscomputer.in/wp-content/uploads/2024/11/28133429/EC-artificial-intelligence-robot-hand-pointing-750.jpg",
      "date": "2025-02-25T06:03:48+00:00"
    }
  ],
  "health": [
    {
      "news_number": 0,
      "title": "World Health Day 2025 to spotlight women and babies’ survival, urging solidarity at a critical moment for global health",
      "content": "The World Health Organization (WHO) has officially announced the theme of World Health Day 2025, Healthy beginnings, hopeful futures, which will focus on improving maternal and newborn health and survival.\n\nWorld Health Day is marked around the world on 7th April, the anniversary of WHO’s founding in 1948. Each year, it draws attention to a specific health topic of concern to people all over the world.\n\n“The focus of this campaign comes at a crucial moment, aiming to help countries regain lost progress while showcasing new research and evidence that will enhance the health of women and babies globally,” said Dr Anshu Banerjee, Director of Maternal, Newborn, Child and Adolescent Health and Ageing at WHO. “As rollbacks to humanitarian assistance jeopardize a critical lifeline for millions, it will also be an opportunity to step up support and collaboration for global health - and deliver hope to those in urgent need of lifesaving care.”\n\nHelping every woman and baby survive and thrive\n\nAccording to the most recent estimates, close to 300 000 women lose their life due to pregnancy or childbirth each year; over 2 million babies die in their first month of life, and around 2 million more are stillborn. This is roughly 1 preventable death every 7 seconds – losses which bring tremendous sadness and heartache to millions of families around the world.\n\nWhile maternal and newborn deaths occur in all regions, the vast majority are in the poorest countries and those facing conflict and other crises. When health care facilities close, facilities are attacked, access routes denied or supplies disrupted, pregnant women and babies - who need regular access to health services - face severe, often life-threatening risks.\n\nBased on current trends, a staggering 4 out of 5 countries are off track to meet the United Nations’ global targets for improving maternal survival by 2030; 1 in 3 will fail to meet targets for reducing newborn deaths. Current funding constraints could further jeopardize progress, as many programmes providing critical health services have stalled alongside important medical research focused on pregnant and breastfeeding women and children.\n\nThis year’s campaign, which will run until 2026, will urge governments, donors and the health community to invest in proven, high-impact interventions, as part of efforts to improve overall quality of care. These include pregnancy related services to detect complications and lifesaving emergency obstetrics – noting that the vast majority of maternal and newborn deaths happen during or shortly after birth – as well as special care for small and preterm babies. Complications relating to prematurity are now the leading cause of death of children under-5 worldwide.\n\nWHO will also highlight the evolving need for health systems to address the many underlying health issues that impact maternal and newborn health. These include not only direct obstetric complications but also mental health conditions, malnutrition (including under and overnutrition as well as nutritional deficiencies), and an increasing burden of noncommunicable diseases.\n\nListening to women and supporting families\n\nMoving beyond actions to save lives, the campaign will urge increased global attention to women’s longer-term health and well-being. This includes advocating for laws and policies that safeguard their health and rights, such as paid maternity leave and other critical employment protections, and access to vital family planning services.\n\n“It is not sufficient that women survive childbirth, they must also be able to enjoy their lives in good health,” said Dr Pascale Allotey, Director for Sexual and Reproductive Health and Research at WHO. “Women and girls everywhere need access to health providers who listen to their concerns and meet their needs, while ensuring they can plan their fertility, take charge of their futures, and protect their health.”\n\nEfforts are also needed to address the particular risks of climate change for pregnant women and newborns, as evidence shows an association between higher temperatures and preterm births, stillbirth, hypertension and gestational diabetes, as well as infant mortality.\n\nAn investment, not a cost\n\nIn low- and middle-income countries, every US$1 invested in maternal and newborn health is estimated to yield around US$9 to 20 in return. Evidence shows that spending on maternal and newborn health leads to economic development and happier, healthier societies.\n\nAround the world, WHO is supporting essential maternal and newborn health programmes including through:\n\nIntensive support to 55 countries through the Every Woman Every Newborn Everywhere initiative, which is working to expand access to lifesaving emergency obstetric and newborn care units, family planning and other critical services;\n\nGuidance relating to diverse aspects of maternal and newborn health through pregnancy, childbirth and the postnatal period. New recommendations will be published later this year to help clinicians manage postpartum haemorrhage, one of the world’s leading causes of maternal deaths, and noncommunicable diseases in pregnancy;\n\nResearch to improve clinical care options for pregnant women and newborns, including during epidemics when it is critical to ensure high-risk populations are not left behind;\n\nEnsuring maternity and newborn care during humanitarian emergencies, like mobile clinics and health posts in Syria and Sudan, where millions of women and babies would otherwise miss out on lifesaving medical screenings, vaccinations and treatments.\n\nSupport for health workers providing essential care to pregnant women and babies, such as efforts to strengthen the vital role of midwives within health systems through training, accreditation and related guidance.\n\nGet involved\n\nHere’s what you can do to support the campaign",
      "publisher": "who",
      "url": "https://www.who.int/news/item/21-02-2025-world-health-day-2025-to-spotlight-women-and-babies--survival--urging-solidarity-at-a-critical-moment-for-global-health",
      "imgURL": "https://www.who.int/favicon.ico",
      "date": null
    }
  ],
  "sports": [
    {
      "news_number": 0,
      "title": "What's behind West Asia's multibillion push to attract global sports stars?",
      "content": "Coco Gauff’s moment of glory was hard-earned. She had to fight numerous battles: Indifferent form, inner demons, Riyadh’s sweltering heat and a rampaging opponent in China’s Olympic gold medallist Zheng Qinwen.\n\nThe 20-year-old American displayed guts, gumption, and mental fortitude to come from 2-0 and 5-3 down in the final set to clinch the WTA Finals trophy a fortnight ago.\n\nThe triumph was a cataclysmic moment in tennis. Gauff walked home with an eye-popping $4.8 million in prize money — the largest sum awarded in women’s sports and the highest earned by any tennis player, male or female, at a",
      "publisher": "business-standard",
      "url": "https://www.business-standard.com/sports/other-sports-news/what-drives-west-asia-s-multi-billion-push-to-attract-global-sports-stars-124112201349_1.html",
      "imgURL": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-11/22/thumb/fitandfill/400X400/1732294547-6774.jpg",
      "date": "2024-11-22T22:26:07+05:30"
    }
  ],
  "finance": [
    {
      "news_number": 0,
      "title": "Global market crash: From Asian markets to crypto prices, US recession fears jolt financial markets globally",
      "content": "Indian stock market benchmark indices, Sensex and Nifty 50, witnessed a heavy sell-off on Monday as the rout in global equities intensified amid US recession concerns and escalating the geopolitical tensions in the Middle East.\n\nThe global equity markets plummeted as the sell-off was fuelled by growing concerns that the US economy is slowing and the Federal Reserve is behind the curve with policy support. Data showed the US jobs market weakening, which triggered a closely watched recession indicator.\n\n“This sell off is more of a short term volatility by way of profit booking and is no indicator of any long term panic mode set in the Indian equities. For investors looking at entering the equity market, a staggered entry during volatile periods can be considered,” said Tanvi Kanchan, Head - UAE Business & Strategy, Anand Rathi Shares and Stock Brokers.\n\nThe repercussions were witnessed in markets across the globe - from Asian equity markets, to currency markets to bitcoin prices. Here’s a look at global markets:\n\nIndian stock market Indian stock market benchmark indices Nifty 50 and Sensex crashed more than 3% each as sell-off intensified across the board. Sensex traded 2,450.32 points, or 3.03%, lower at 78,531.63, while Nifty 50 tumbled 696.35 points, or 2.82%, to 24,021.35.\n\nInvestors lost nearly ₹15 lakh crore in a session amid the stock market crash today as the overall market capitalisation of the BSE-listed companies dropped to nearly ₹442 lakh crore from nearly ₹457 lakh crore in the previous session.\n\nAlso Read | Sensex crashes 3%; 5 factors why Indian stock market is falling today\n\nAsian Markets Japan’s stock market tumbled with the benchmark indices falling more than 20% from their record highs, confirming a bear market, as sell-off continued from last week.\n\nThe benchmark Nikkei 225 index plunged 12.40%, or 4,451.28 points, to 31,458.42 -- its largest points drop in history -- while the broader Topix index declined 12.23%, or 310.45 points, to 2,227.15.\n\nA resurgent yen weighed on the Japanese stock markets. The yen surged to 141.73 against the dollar, a level not seen since early January, from 146.52 yen in New York on Friday.\n\nAmong other Asian markets, South Korea’s Kospi plunged 8.1% before trading was halted for 20 minutes due to the exchange’s circuit breakers. The Kosdaq dropped 11.71%.\n\nTaiwan’s benchmark, Taiwan Weighted Index declined more than 8% amid selling in technology and real estate stocks. Hong Kong Hang Seng index fell 1.61%, while mainland China’s CSI 300 declined 0.48%.\n\nUS Stock Futures US stock futures fell following a drop on Wall Street last week that led the Nasdaq Composite dropping into correction territory. Nasdaq 100 futures tumbled more than 6% and S&P 500 contracts were down more than 3%. Futures of Dow Jones plunged over 1%.\n\nBond Market India government bond yields fell on Monday tracking a sharp decline in US peers amid rising bets of aggressive rate cuts by the US Federal Reserve.\n\nThe domestic benchmark 10-year yield was at 6.8597%, lowest level since March 31, 2022, compared with its previous close of 6.8945%.\n\nUS Treasury yields nosedived on Friday. The US 10-year yield dropped to the lowest level since December and extended decline in Asian hours on Monday, Reuters reported. It was last at 6.7565% in Asian hours, while the 2-year yield was at 3.8216%.\n\nAlso Read | Rupee opens at record low of 83.78 against the US dollar\n\nCurrency Market Indian rupee fell to an all-time low on Monday weighed down by the stock market crash as concerns over a US recession spurred outflows from local equities amid a global stocks sell-off. The rupee declined to a record low of 83.82 against the US dollar and was last quoted at 83.8125, down about 0.1% from its close at 83.75 on Friday.\n\nJapanese yen, a safe-haven and carry-funding favourite, traded at 143, up 2.3% versus the dollar, and at levels last seen on January 2, Reuters reported. The yen has rallied 10% against the dollar in just over three weeks, driven in part by the Bank of Japan’s interest rate rise last week and an unwinding of yen-funded carry trades.\n\nCryptocurrencies Cryptocurrencies also reeled under heavy selling amid a risk aversion in global markets on Monday, with the Bitcoin prices falling around 15%.\n\nTop token Bitcoin price traded 15.5% lower at $51,323.58, adding to a 13.1% drop last week that was the worst since the period when the FTX exchange imploded. Ethereum price declined 22.3% to $2,262. Most other major cryptocurrencies were deeply in the red.\n\nGold Rate Today Gold prices rose on Monday on safe-haven demand as the global financial markets are in a risk-averse mode. Spot gold rose 0.14% to $2,446.83 per ounce, after falling 1% earlier in the session. US gold futures rose 0.8% to $2,488.50.\n\nMCX gold rate today traded 0.19% higher at ₹69,925 per 10 grams, while MCX silver price fell 0.39% to ₹82,168 per kg.\n\n(With inputs from Reuters)",
      "publisher": "livemint",
      "url": "https://www.livemint.com/market/stock-market-news/global-market-crash-from-asian-markets-to-crypto-prices-us-recession-fears-jolt-financial-markets-globally-11722841898336.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2024/08/05/1600x900/2-0-972295078-499578669-0_1679914632962_1722842635579.jpg",
      "date": "2024-08-05T13:01:28+05:30"
    }
  ],
  "geoPolitics": [
    {
      "news_number": 0,
      "title": "China's latest action plan shows it's trying to boost foreign investment amid geopolitical tensions",
      "content": "Tensions between the world's two largest economies have escalated over the last several years. Florence Lo | Reuters\n\nBEIJING — China is trying yet again to boost foreign investment, amid geopolitical tensions and businesses' calls for more concrete actions. On Feb. 19, authorities published a \"2025 action plan for stabilizing foreign investment\" to make it easier for foreign capital to invest in domestic telecommunication and biotechnology industries, according to a CNBC translation of the Chinese. The document called for clearer standards in government procurement — a major issue for foreign businesses in China — and for the development of a plan to gradually allow foreign investment in the education and culture sectors. \"We are looking forward to see this implemented in a manner that delivers tangible benefits for our members,\" Jens Eskelund, president of the European Union Chamber of Commerce in China, said in a statement Thursday. The chamber pointed out that China has already mentioned plans to open up telecommunications, health care, education and culture to foreign investment. Greater clarity on public procurement requirements is a \"notable positive,\" the chamber said, noting that \"if fully implemented,\" it could benefit foreign companies that have invested heavily to localize their production in China.\n\nwatch now\n\nChina's latest action plan was released around the same time the Commerce Ministry disclosed that foreign direct investment in January fell by 13.4% to 97.59 billion yuan ($13.46 billion). That was after FDI plunged by 27.1% in 2024 and dropped by 8% in 2023, after at least eight straight years of annual growth, according to official data available through Wind Information. All regions should \"ensure that all the measures are implemented in 2025, and effectively boost foreign investment confidence,\" the plan said. The Ministry of Commerce and National Development and Reform Commission — the economic planning agency — jointly released the action plan through the government's executive body, the State Council. Officials from the Commerce Ministry emphasized in a press conference Thursday that the action plan would be implemented by the end of 2025, and that details on subsequent supportive measures would come soon. \"We appreciate the Chinese government's recognition of the vital role foreign companies play in the economy,\" Michael Hart, president of the American Chamber of Commerce in China, said in a statement. \"We look forward to further discussions on the key challenges our members face and the steps needed to ensure a more level playing field for market access.\" AmCham China's latest survey of members, released last month, found that a record share are considering or have started diversifying manufacturing or sourcing away from China. The prior year's survey had found members were finding it harder to make money in China than before the Covid-19 pandemic. Consumer spending in China has remained lackluster since the pandemic, with retail sales only growing by the low single digits in recent months. Tensions with the U.S. have meanwhile escalated as the White House has restricted Chinese access to advanced technology and levied tariffs on Chinese goods.\n\n'A very strong signal'",
      "publisher": "cnbc",
      "url": "https://www.cnbc.com/2025/02/24/china-strives-to-attract-foreign-investment-amid-geopolitical-tensions.html",
      "imgURL": "https://image.cnbcfm.com/api/v1/image/108059555-17309842732024-11-07t082151z_1789535505_rc260bay0usl_rtrmadp_0_usa-election-china-economy.jpeg?v=1740106030&w=1920&h=1080",
      "date": "2025-02-24T00:00:00"
    }
  ]
}