[{"news_number": 0, "title": "Jailed For Illegally Entering Pakistan, Woman, Minor Son Handed Back To India", "summary": "The woman and her son were in jail term for a little over a year.\nAccording to federal government officials, Wahida, a resident of Nagaon district in Assam, was arrested along with her son while illegally entering Pakistan from Afghanistan via the Chaman border last year.\nWahida told the authorities here that she had been deceived by an Indian travel agent due to which she reached Pakistan.\nSubsequently, Wahida's family contacted the Pakistan High Commission in New Delhi and the Indian High Commission in Islamabad seeking their help for their safe return.\nThe Indian High Commission officials reportedly took up her case with the interior ministry in Islamabad.", "keywords": ["jail", "son", "high", "jailed", "illegally", "india", "handed", "indian", "minor", "pakistan", "woman", "released", "pakistani", "border", "entering", "little", "took"], "url": "https://www.ndtv.com/india-news/jailed-for-illegally-entering-pakistan-woman-minor-son-handed-back-to-india-5781176", "imgURL": "https://i.ndtvimg.com/i/2015-10/wagah-border_650x400_51445516172.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 1, "title": "India Inflows Set to Cool Following China’s Bond Index Playbook", "summary": "The frenzy to buy Indian bonds ahead of their entry into a key global debt index is set to pause if China’s experience is any guide.\nIndian government bonds have beaten all of their emerging market peers except Argentina so far this year.\nWhile prudent government borrowing and the benchmark interest rate at a six-year high are helping, the market is also buoyed by expectations of as much as $40 billion of inflows from index inclusion.", "keywords": ["cool", "bonds", "rate", "india", "pause", "playbook", "market", "key", "peers", "set", "following", "bond", "chinas", "index", "inflows", "sixyear", "prudent"], "url": "https://www.bloomberg.com/news/articles/2024-05-30/india-inflows-set-to-cool-following-china-s-bond-index-playbook", "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iowVw9ir3zRk/v0/1200x784.jpg"}, {"news_number": 2, "title": "Indian woman in viral Amazon India vs Canada video claps back at critics: ‘I may be an NRI but…’", "summary": "An Indian-origin woman in Canada, who faced backlash from a section of the internet over her video sharing her experience with Amazon Canada, has set the record straight, responding to critics who felt she did not care about labour exploitation.\nSelene Khosla's viral video compares Amazon return policies in India and Canada.\nThe viral video has garnered over four million views and over 4,000 comments.\n\"Yeah, but it's because we have cheap labour who barely make a living, that's why,\" another X user, Anupam, said.\nThe tone deafness on labour exploitation,\" X user Rajendranath said.", "keywords": ["canada", "user", "india", "x", "nri", "indian", "claps", "woman", "video", "amazon", "feel", "critics", "comments", "labour", "viral", "vs"], "url": "https://www.hindustantimes.com/trending/indian-woman-in-viral-amazon-india-vs-canada-video-claps-back-at-critics-im-doing-my-bit-101717049637345.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/30/1600x900/Selene_Khosla_1717063431092_1717063431231.png"}, {"news_number": 3, "title": "Heineken’s India unit says raids and red tape hurt business", "summary": "Try unlimited access Only ₹100 for 4 weeksThen ₹4,335 per month.\nComplete digital access to quality FT journalism on any device.\nCancel anytime during your trial.", "keywords": ["access", "ft", "quality", "weeksthen", "digital", "india", "business", "journalism", "trial", "unit", "heinekens", "try", "monthcomplete", "hurt", "tape", "red", "unlimited", "raids"], "url": "https://www.ft.com/content/e401d2a3-7fd4-4aa9-a454-f49ec2b66be4", "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/ftlogo-v1%3Abrand-ft-logo-square-coloured?source=update-logos&format=svg"}, {"news_number": 4, "title": "Washington ready to discuss preferential trade deal with India: US Ambassador", "summary": "“There's not a huge appetite in Washington for free trade agreements (FTAs),\" US Ambassador to India Eric M. Garcetti said in an interview.\n\"But I do think that there's an openness in Washington to advance a discussion about preferential trade between our countries.\nPreferential trade agreements and FTAs both seek to liberalize trade, but the former is more focused on specific products or sectors while the latter has a broader coverage.\nIndia has trade deficits with the other four top trading partners, namely China, UAE, Russia and Saudi Arabia.\n“We want to help India get closer to 10% (growth rate),\" he said.", "keywords": ["washington", "discuss", "countries", "trade", "india", "deal", "ambassador", "indias", "tariff", "components", "ipef", "ready", "duty", "garcetti", "help", "preferential"], "url": "https://www.livemint.com/economy/washington-ready-to-discuss-preferential-trade-deal-with-india-us-ambassador-eric-garcetti-11716974753188.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/29/1600x900/Eric_M_Garcetti_1716991883005_1716991883251.jpg"}, {"news_number": 5, "title": "Foreign investors are rejecting Indian stocks", "summary": "H ow to explain the disparity?\nIndia’s economy is growing astonishingly fast, Bangalore and Mumbai have become destinations for bosses of global financial firms and Narendra Modi trumpets the country’s appeal in his electoral campaign.\nGiven the enthusiasm, surely foreign money is flooding into the country.\nIn April foreign investors dumped $1bn-worth of Indian shares.\nThis is a sliver of the roughly $900bn of Indian shares in foreign hands, but it is a striking move given the mood music—and one that has pushed the share of the Indian stockmarket held by foreigners to just 18%, its lowest in a dozen years.", "keywords": ["given", "stocks", "shares", "surely", "rejecting", "stockmarket", "sliver", "investors", "indian", "trumpets", "striking", "dumped", "foreign"], "url": "https://www.economist.com/finance-and-economics/2024/05/30/foreign-investors-are-rejecting-indian-stocks", "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240601_FNP502.jpg"}, {"news_number": 6, "title": "Renewables for green hydrogen projects exempted from India's strict procurement rules", "summary": "Renewables for green hydrogen projects exempted from India's strict procurement rulesExemption will allow 'rapid deployment' of renewables for green hydrogen production and 'lower costs', say analysts", "keywords": ["rulesexemption", "hydrogen", "strict", "rules", "indias", "production", "procurement", "renewables", "rapid", "projects", "exempted", "say", "green"], "url": "https://www.hydrogeninsight.com/production/renewables-for-green-hydrogen-projects-exempted-from-indias-strict-procurement-rules/2-1-1652006", "imgURL": "https://images.dngroup.com/image/eyJ3IjoxMjAwLCJrIjoiYmZkYzE3M2RlODVmYmU5ZDQzZGFkNDU2MDdjNTI2ZDIiLCJmIjoid2VicCIsImNyb3AiOlswLDUwLDE2MDAsNzk2XSwiciI6MiwibyI6Imdsb2JhbCJ9"}, {"news_number": 7, "title": "India reports first heat-related death this year", "summary": "Extreme temperatures across India are having their worst impact in the country’s teeming megacities, experts have warned, as its capital reported its first death this season due to record-breaking heat.\nThat reading may still be revised, however, as maximum temperatures in other parts of the city ranged from 45.2C to 49.1C, Reuters said.\nIndia is no stranger to searing summer temperatures but years of scientific research have found climate change is causing heatwaves to become longer, more frequent and more intense.\nIt found the maximum temperature decline was nearly 2C (35.6F) smaller than previously.\nHuman-induced climate changeResearchers say human-induced climate change has driven the devastating heat impact in India and should be taken as a warning.", "keywords": ["change", "climate", "death", "india", "heatwave", "indias", "delhi", "temperature", "heat", "maximum", "reports", "heatrelated", "temperatures"], "url": "https://www.aljazeera.com/news/2024/5/30/india-reports-first-heat-related-death-this-year", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/AFP__20240529__34UA624__v1__HighRes__IndiaClimateWeatherHeat-1717060168.jpg?resize=1920%2C1440"}, {"news_number": 8, "title": "Millions of Indians Living Abroad Have a Say in the Election, Even if They Can’t Vote", "summary": "The dishes at a community center potluck for Indian expatriates near Washington, D.C., ranged from chana masala, a popular northern Indian chickpea curry, to idli, a southern Indian rice cake.\nThe guests’ views on India’s general election were equally varied.\nSupporters of candidates challenging Mr. Modi’s party criticized what they saw as his disregard for minorities and democratic norms.\n“What is the vision for India in 2024?” the host, Somu Kumar, a manager at a cloud computing company, said recently of that winter potluck.\nExpatriate Indians also cannot cast absentee ballots under India’s electoral laws.", "keywords": ["washington", "varied", "winter", "voting", "cant", "modis", "millions", "indias", "indian", "election", "living", "views", "potluck", "vision", "say", "abroad", "vote", "indians"], "url": "https://www.nytimes.com/2024/05/30/world/asia/india-election-diaspora-expats.html", "imgURL": "https://static01.nyt.com/images/2024/05/29/multimedia/00xp-indiadiaspora1-twzc/00xp-indiadiaspora1-twzc-facebookJumbo.jpg"}, {"news_number": 9, "title": "Delhi 'unbearable' as temperatures soar past 50C", "summary": "More than 37 cities in the country recorded temperatures over 45C this week.\nThe IMD described the recording as an \"outlier compared to other stations\", which had recorded temperatures ranging from 45.2C to 49.1C in different parts of Delhi.\nIMD regional head Kuldeep Srivastava said the reason behind the rising temperatures in Delhi was the arrival of hot winds from the state of Rajasthan.\nElsewhere, the cities of Churu in Rajasthan and Sirsa in the northern Haryana state have recorded temperatures over 50C.\nSeveral students were rushed to hospital in the town of Sheikhpura in the eastern state of Bihar after fainting due to the high temperatures, local media reported.", "keywords": ["past", "high", "water", "unbearable", "india", "50c", "heatwave", "bbc", "soar", "delhi", "heat", "parts", "recorded", "temperatures"], "url": "https://www.bbc.com/news/articles/c166xxd4y36o", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/30bd/live/6bd765e0-1dd6-11ef-95bd-a16a3f175cc2.jpg"}, {"news_number": 10, "title": "Temperatures in India hover at record highs as heatwave grips the country", "summary": "NEW DELHI, INDIA - MAY 29: Residents of JJ Cluster Vivekanand Colony at Chanakyapuri fill up water from a tanker in the morning on May 29, 2024 in New Delhi, India.\nTemperatures have hovered near 50 degrees Celsius (122 degrees Fahrenheit) in Delhi, according to the Indian Meteorological Department.\nSome local weather stations reported highs of 49.9 degrees Celsius on Tuesday, above Delhi's previous record temperature of 49.2 degrees, which was logged in May 2022.\nOther weather stations in Delhi measured temperatures on Wednesday ranging from 45.2 to 49.1 degrees Celsius.\nThe area of Narela cooled by as many as 1.5 degrees from Tuesday, while temperatures in many other sites rose further.", "keywords": ["water", "grips", "record", "country", "india", "heatwave", "reported", "weather", "stations", "delhi", "local", "celsius", "highs", "hover", "temperatures", "degrees"], "url": "https://www.cnbc.com/2024/05/30/indias-delhi-sees-near-record-temperatures-as-heatwave-grips-india.html", "imgURL": "https://image.cnbcfm.com/api/v1/image/107421835-1717068784382-gettyimages-2154655867-INDIA_HEAT.jpeg?v=1717069027&w=1920&h=1080"}, {"news_number": 11, "title": "India's Elite IIT Graduates Face a Reckoning as Jobs Dry Up", "summary": "Welcome to India Edition, I’m Menaka Doshi.\nJoin me each week for a ringside view of the billionaires, businesses and policy decisions behind India’s rise as an emerging economic powerhouse.\nYou can subscribe here, and share feedback with me here.", "keywords": ["iit", "jobs", "policy", "elite", "ringside", "reckoning", "indias", "welcome", "view", "menaka", "powerhouseyou", "dry", "rise", "graduates", "share", "subscribe", "face", "week"], "url": "https://www.bloomberg.com/news/newsletters/2024-05-30/tough-job-market-for-india-s-elite-engineers-sparks-ai-led-existential-concern", "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/inbiPXQr_jAE/v0/1200x900.jpg"}, {"news_number": 12, "title": "Weeks of sweltering heat scorch northern India", "summary": "BIKANER, India (AP) — People in northern India have been struggling with an unrelenting, weekslong heat wave that has forced schools to close in some places and raised the risk of heatstrokes for laborers working outdoors.\n(AP Photo/Anupam Nath)A man sleeps under a truck on a hot summer day in Guwahati, India, Saturday, May 25, 2024.\n(AP Photo/Anupam Nath)A man drinks water on a hot summer day in Jammu, India, Monday, May 27, 2024.\n(AP Photo/Channi Anand)A man walks past the India Gate monument on a hot summer day in New Delhi, India, Monday, May 27, 2024.\n(AP Photo/Manish Swarup)A cobbler rests by her work equipment on a hot summer day in Lucknow, India, Monday, May 27, 2024.", "keywords": ["water", "man", "india", "hot", "ap", "summer", "temperatures", "27", "heat", "day", "northern", "2024", "weeks", "scorch", "sweltering"], "url": "https://apnews.com/article/india-heat-wave-a347b08dc2acbcc141ef6eae45ad2175", "imgURL": "https://dims.apnews.com/dims4/default/de41c4e/2147483647/strip/true/crop/7337x4127+0+382/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F33%2Fb3e336f1f725f8a10cb5aec9479f%2F72172c1bb08346539a80271f7ec16930"}, {"news_number": 13, "title": "India issues heat wave alert as Delhi hits 122 degrees", "summary": "NEW DELHI — India’s weather department issued a red alert for several parts of the country’s northwest on Wednesday, warning of a severe heat wave a day after parts of the capital Delhi recorded their highest temperature ever at almost 50 degrees Celsius (122 Fahrenheit).\nA red alert implies a “very high likelihood” of people developing “heat illness and heat stroke,” and calls for “extreme care” for vulnerable people, according to the India Meteorological Department.\nIndia has been grappling with unusually high temperatures this summer, and the weather department has said “heat wave to severe heat wave” conditions are likely to continue in several parts, including the capital, through Wednesday.\nIndia declares a heat wave when the maximum temperature of a region is 4.5 C (8.1 F) to 6.4 C (11.5 F) higher than usual, while a severe heat wave is declared when the maximum temperature is 6.5 C (11.7 C) higher than normal or more.\nChildren running behind a truck spraying water in New Delhi on Tuesday.", "keywords": ["water", "f", "india", "wave", "weather", "alert", "issues", "hits", "delhi", "122", "temperature", "parts", "c", "heat", "severe", "degrees"], "url": "https://www.nbcnews.com/news/world/india-issues-heat-wave-alert-delhi-hits-122-degrees-rcna154439", "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-05/290524-india-heat-water-wc-1037-5066fd.jpg"}, {"news_number": 14, "title": "India vs Pakistan T20 World Cup clash prompts New York to beef up security", "summary": "State governor says there are no ‘credible threats’ to the tournament or the India-Pakistan match on June 9.\nSecurity arrangements in New York will be “elevated” for the upcoming ICC T20 World Cup, especially ahead of the marquee clash between India and Pakistan at Eisenhower Park in Long Island, the state’s governor has said.\nWhile there is no credible threat at this time, I’ve directed @nyspolice to elevate security measures & we’ll continue to monitor as the event nears.\n— Governor Kathy Hochul (@GovKathyHochul) May 29, 2024‘Largest security we’ve ever had to do’However, Nassau County Police Commissioner Patrick Ryder said the police department will not take any chances.\n“We will go through every fine detail when it comes to the security and safety of the residents here in Nassau County,” Ryder said.", "keywords": ["credible", "governor", "security", "india", "prompts", "county", "threat", "cup", "pakistan", "clash", "safe", "tournament", "t20", "nassau", "york", "world", "vs"], "url": "https://www.aljazeera.com/sports/2024/5/30/india-vs-pakistan-security-threat-new-york-june-9-icc-t20-world-cup-2024-nypd", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/AP21296322910461-1-1717059069_70242f-1717060228.jpg?resize=1200%2C630&quality=80"}, {"news_number": 15, "title": "The Bitter Bargain that India’s 200 Million Muslims Face - The New York Times", "summary": "I don’t wear a skullcap, and in public I avoid wearing the loosefitting Pathani kurta and peppering my speech with Urdu words, all of which are identity markers for Indian Muslims.\nFor 10 years, Mr. Modi’s Hindu-chauvinist government has vilified the nation’s 200 million Muslims as dangerous undesirables.\nAs offensive as that was, it is sadly familiar to Indian Muslims like me who — after a decade of denigration, violence and murder — live in daily fear of being identified and attacked, forcing us into self-denial to protect ourselves.\nIslam came here around 1,300 years ago, and Indian Muslims descend from natives of this land who converted to Islam centuries ago.\nMany Indian Muslims fought against British colonization, and millions rejected the 1947 partition of the country into a predominantly Hindu India and a mostly Muslim Pakistan.", "keywords": ["muslim", "country", "india", "ago", "indias", "indian", "dont", "muslims", "worlds", "times", "islam", "hindu", "face", "york", "bargain", "bitter", "200", "million"], "url": "https://www.nytimes.com/2024/05/26/opinion/india-muslim-modi-election.html", "imgURL": "https://static01.nyt.com/images/2024/05/24/opinion/24ali/24ali-facebookJumbo.png"}, {"news_number": 16, "title": "Extreme Heat Helps Push India’s Power Demand to New Record", "summary": "(Bloomberg) -- India’s peak electricity demand set a new record as surging temperatures add to what’s already the fastest growth in consumption in any major economy.\nFaced with accelerating electricity demand as the economy expands and adds more energy-hungry industries, India’s government has ordered a fresh wave of coal-fired power plant capacity.\nSoaring temperatures in Delhi on Wednesday sent the capital’s peak electricity demand to an all-time high.\nAbnormal heat is to expected continue in many regions in June, according to the India Meteorological Department.\n(Updates with details on gas demand in 4th and 5th paragraph)Most Read from Bloomberg Businessweek©2024 Bloomberg L.P.", "keywords": ["push", "record", "india", "reported", "indias", "according", "electricity", "power", "demand", "bloomberg", "extreme", "surging", "temperatures", "gas", "heat", "helps"], "url": "https://finance.yahoo.com/news/extreme-heat-helps-push-india-053004565.html", "imgURL": "https://s.yimg.com/ny/api/res/1.2/Zr02.YGm4_rj1K_cigbrpA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NjE-/https://media.zenfs.com/en/bloomberg_markets_842/52172b345ae5d0a02883ba00e133c6dd"}, {"news_number": 17, "title": "‘This election is critical for Congress’: can India’s Gandhi dynasty survive?", "summary": "Ten years in opposition have left Congress and the Gandhi family in decline, accused of elitism, disorganisation and weak leadership.\nVerma said the problem was in part the Gandhi family leadership “but also the whole organisation of the party, which is very weak”.\nAlmost 100 years later, there is little doubt that the Gandhi family remains firmly in charge.\nIn 2017, Rahul Gandhi took over as president of the party from his mother, Sonia Gandhi, who had ruled it for two decades.\nNow the baton has been passed on to Rahul Gandhi, with Priyanka Gandhi spearheading the campaign.", "keywords": ["gandhi", "opposition", "modi", "india", "critical", "indias", "family", "election", "dynasty", "congress", "party", "rahul", "survive", "gandhis"], "url": "https://www.theguardian.com/world/article/2024/may/30/this-election-is-critical-for-congress-can-indias-gandhi-dynasty-survive", "imgURL": "https://i.guim.co.uk/img/media/1b5da880753745b41ebf979a3fbdd6155318d1b2/0_264_5787_3472/master/5787.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ddfa7414ec5fa072628fec6781e96d2f"}, {"news_number": 18, "title": "Opinion | In India’s polarized election, voters seek a return to normal", "summary": "“Talk to us about how our lives can be better.”As India’s election — the world’s largest — enters its final phase, the Ram Mandir is turning out not to be a salient electoral issue.\nIn city after city, I asked BJP voters to list what they liked best about the prime minister.\nHe used words such as “infiltrators” and “those who have more children.”He seemed to be falling back on formulaic Hindu-Muslim divisiveness in an effort to mobilize Hindu voters.\nBy flagging issues of local importance — agrarian distress, water scarcity, unemployment — voters have opened up space to demand accountability from the Modi government.\n“Modi will definitely be prime minister again,” argues Prashant Kishor, one of India’s best known political strategists who has in the past worked closely with Modi.", "keywords": ["modi", "indias", "election", "temple", "political", "prime", "minister", "seek", "voters", "polarized", "hindu", "return", "normal", "opinion", "religious"], "url": "https://www.washingtonpost.com/opinions/2024/05/29/india-election-modia-religious-rhetoric-economy/", "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PWQCANIIIYP3CBIAYUYBNDUCBI.jpg&w=1440"}, {"news_number": 19, "title": "The fake news divide: how Modi’s rule is fracturing India – video", "summary": "India is in the final stages of a general election, and almost one billion people are registered to vote.\nThe country's prime minister ,Narendra Modi, has been in power for more than 10 years, and his Hindu nationalist Bharatiya Janata party (BJP) is seeking a third term.\nBut critics of Modi and the BJP say his government has become increasingly authoritarian, fracturing the country along religious lines and threatening India’s secular democracy.\nAt the same time, the space for freedom of speech has been shrinking while disinformation and hate speech has exploded on social media.\nThe Guardian’s video team travelled through India to explore how fake news and censorship might be shaping the outcome of the election", "keywords": ["divide", "termbut", "modi", "india", "election", "fake", "video", "travelled", "rule", "speech", "threatening", "vote", "fracturing", "bjp", "modis"], "url": "https://www.theguardian.com/news/video/2024/may/30/the-fake-news-divide-modis-rule-is-fracturing-india-video", "imgURL": "https://i.guim.co.uk/img/media/48915a6ed4e7515ee01ab9f4b3a90e6d0e0af54a/60_0_1800_1080/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d6c2450a440d52bea841178b80db1548"}, {"news_number": 20, "title": "New York's Promise Amid Terror Threat To India-Pakistan T20 World Cup Match", "summary": "The Eisenhower Park Stadium at the Nassau County will host eight matches of the tournament-proper, including India's three outings.\n\"In preparation for the World Cup my team has been working with federal & local law enforcement to keep attendees safe.\nA report on CNN said that New York officials are putting safety precautions in place \"after terror group ISIS-K made a global threat earlier this year\" against the World Cup.\nNassau County Police Commissioner Patrick Ryder said on Wednesday that the event received an ISIS-K-linked threat in April.\nNassau County Executive Bruce Blakeman said described the mega-event, which is likely to draw massive crowds from among the expats, as \"Super Bowl on steroids\".", "keywords": ["match", "amid", "indiapakistan", "security", "threat", "county", "stadium", "cup", "state", "place", "event", "t20", "promise", "nassau", "terror", "yorks", "world"], "url": "https://www.ndtv.com/world-news/new-yorks-promise-amid-terror-threat-to-india-pakistan-t20-world-cup-match-5777257", "imgURL": "https://c.ndtvimg.com/2024-05/qnss1fe8_eisenhower-park-stadium-new-york-nassau-county-cricket-stadium_625x300_30_May_24.jpeg?ver-20240506.08"}, {"news_number": 21, "title": "India’s election wasn’t the deepfake doomsday many feared", "summary": "Coming into 2024, there were plenty of reasons to worry about how platforms would handle the Indian election.\nIt’s the world’s largest election, with nearly a billion people eligible to vote in an increasingly polarized nation.\nBut while we can verify that AI was used in various cases, it’s harder to classify the cases as misinformation.\nBut the harm in those cases is clearly due to the hateful rhetoric itself, not the AI tools used to spread it.\nThe good news, then, is that failing to keep it in check may cause less damage than originally feared.", "keywords": ["ai", "wasnt", "cases", "seen", "indias", "election", "platforms", "tools", "video", "political", "feared", "doomsday", "rhetoric", "content", "tracker", "deepfake"], "url": "https://restofworld.org/2024/exporter-india-deepfake-trolls/", "imgURL": "https://149346090.v2.pressablecdn.com/wp-content/uploads/2024/05/exporter0530_illustration-3.jpg"}, {"news_number": 22, "title": "India’s final vote: In temple town Varanasi, Modi and sarees are winners", "summary": "Varanasi, India – Indian Prime Minister Narendra Modi has a reputation for mounting spectacular road shows replete with a fawning audience showering petals of marigold flowers on him.\nHere, the congested lanes and bylanes amplify the perception of a packed crowd spilling over for a glimpse of the prime minister.\nIn Varanasi, Modi is up against a familiar foe: Ajay Rai of the Congress, India’s biggest opposition party.\n“Prime Minister Modi will be amply rewarded this time.\nThe city received 5.5 million visitors in 2014, the year Modi first contested and won from Varanasi, and became prime minister.", "keywords": ["city", "sarees", "modi", "india", "indias", "temple", "prime", "varanasi", "final", "party", "river", "minister", "vote", "win", "winners", "town", "modis"], "url": "https://www.aljazeera.com/features/2024/5/30/indias-final-vote-in-temple-town-varanasi-modi-and-sarees-are-winners", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/AP24135332290087-1717043856.jpg?resize=1920%2C1440"}, {"news_number": 23, "title": "Leaflet by Leaflet, a Few Aging Activists Fight India’s Tide of Bigotry", "summary": "One recent morning, Roop Rekha Verma, an 80-year-old peace activist and former university leader, walked through a north Indian neighborhood prone to sectarian strife and parked herself near a tea shop.\nFrom her sling bag, she pulled out a bundle of pamphlets bearing messages of religious tolerance and mutual coexistence and began handing them to passers-by.\nDon’t let anyone divide you,” one read in Hindi.\nSpreading those simple words is an act of bravery in today’s India.\nMs. Verma and others like her are waging a lonely battle against a tide of hatred and bigotry increasingly normalized by India’s ruling Bharatiya Janata Party, or B.J.P.", "keywords": ["bigotry", "verma", "tide", "leaflet", "aging", "indias", "activists", "words", "tolerance", "waging", "todays", "university", "fight", "tea", "strife", "walked"], "url": "https://www.nytimes.com/2024/05/28/world/asia/india-activists.html", "imgURL": "https://static01.nyt.com/images/2024/05/12/world/00india-activists/00india-activists-facebookJumbo.jpg"}, {"news_number": 24, "title": "India’s venture capitalists seek to verify the impact they make", "summary": "Last year, the Impact Investors Council, the national industry body, found that 275 Indian impact enterprises had succeeded in raising $2.9bn in equity investments.\nAs a result, Indian impact investing entities now make up 4 per cent of all those, globally, with a focus on emerging markets, according to the Global Impact Investing Network (GIIN).\nIt has since diversified its impact investing portfolio to include healthcare and agrifood businesses.\nHowever, to keep those foreign investors coming, Indian impact VC funds believe they must provide assurances that they are achieving their aims.\nBlueMark has so far conducted more than 170 verifications for a range of impact investors with differing sector focuses and goals.", "keywords": ["cent", "verify", "capitalists", "funds", "microfinance", "investors", "india", "indias", "impact", "indian", "vc", "investing", "seek", "enterprises", "venture"], "url": "https://www.ft.com/content/aaf750c7-4348-435f-b138-a23d67e478b7", "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fwww.ft.com%2F__origami%2Fservice%2Fimage%2Fv2%2Fimages%2Fraw%2Fhttps%253A%252F%252Fd1e00ek4ebabms.cloudfront.net%252Fproduction%252F98a3fdad-4093-4808-a464-486211f8bc01.jpg%3Fsource%3Dnext-article%26fit%3Dscale-down%26quality%3Dhighest%26width%3D700%26dpr%3D1?source=next-opengraph&fit=scale-down&width=900"}, {"news_number": 25, "title": "India’s Opposition Could Thwart Narendra Modi’s Ambitions", "summary": "Rahul Gandhi’s Alliance Compared to the previous elections, in 2024, the opposition alliance led by Rahul Gandhi has become more aggressive and effective.\nCompared to the previous elections, in 2024, the opposition alliance led by Rahul Gandhi has become more aggressive and effective.\nThe coalition’s electoral campaign has focused on the left-populist theme of Modi’s crony capitalism versus the deprived masses.\nBut the opposition was able to impose its socioeconomic themes on the debate, thus exposing the irrelevance of Modi’s Hindu chauvinism to people’s daily concerns.\nIt is also notable that, while the alliance has been making positive references to the farmers’ protests, it has remained almost silent on Muslim issues like the CAA.", "keywords": ["ambitions", "farmers", "electoral", "protests", "indias", "protest", "dalits", "party", "muslims", "narendra", "dalit", "opposition", "caste", "movement", "thwart", "modis"], "url": "https://jacobin.com/2024/05/india-opposition-narendra-modi-bjp", "imgURL": "https://images.jacobinmag.com/wp-content/uploads/2024/05/29162717/GettyImages-2154627089.jpg"}, {"news_number": 26, "title": "Prajwal Revanna: Absconding MP says will return to India to face sex abuse cases", "summary": "Prajwal Revanna, an MP from Hassan district in Karnataka who is seeking re-election, had left India on 27 April using his diplomatic passport after the videos went viral.\nPrajwal Revanna's father HD Revanna and uncle HD Kumaraswamy are both influential legislators in the Karnataka state assembly.\nThey contained 2,960 clips, which reports say were shot by Mr Revanna himself, and showed the faces of the women.\nMr Revanna did not address any of these direct allegations in his video.\nA state minister accused the BJP of fielding Mr Revanna for the election despite knowing that \"hundreds of women had been abused by the candidate\".", "keywords": ["mr", "mp", "sex", "india", "cases", "revanna", "revannas", "state", "political", "party", "videos", "absconding", "month", "minister", "abuse", "return", "prajwal", "face"], "url": "https://www.bbc.com/news/articles/cx99gkpwgq8o", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/0d8d/live/900f90a0-1ccc-11ef-94e3-d78ab9e658c9.jpg"}, {"news_number": 27, "title": "Temperatures soar to nearly 50 C across India in ongoing heat wave", "summary": "In April's three-month IMD forecast, the agency called for above-normal heat wave days over parts of the south peninsula, east India, central India and the plains of northwest India.\nIndia declares a heat wave when the maximum temperature is 4.5 C to 6.4 C higher than normal.\nA severe heat wave is declared when it is at least 6.5 C higher than usual.\nThe deadliest heat wave was in 2015 when more than 2,000 people were killed by the extreme heat.\n\"In many ways, [this heat wave] is anticipated with climate change.", "keywords": ["climate", "ongoing", "wave", "india", "50", "soar", "heat", "temperature", "extreme", "nearly", "world", "c", "temperatures", "red"], "url": "https://www.cbc.ca/news/climate/india-2024-heat-wave-1.7218119", "imgURL": "https://i.cbc.ca/1.7218147.1716998268!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/india-heat-wave.JPG"}, {"news_number": 28, "title": "Indian space startup Agnikul launches country's second privately built rocket", "summary": "The South Asian nation's space agency, the Indian Space Research Organisation (ISRO), has not successfully flown a rocket with a so-called \"semi-cryogenic\" engine.\nThe suborbital flight on Thursday was meant to test the new engine and 3D-printed parts.\nPawan K Goenka, chairman of space regulator Indian National Space Promotion and Authorisation Centre (IN-SPACe), also hailed the \"historic moment\".\nThe Indian Space Association (ISpA) said the launch would \"bolster global confidence\" in the country's private space industry.\nIndia Prime Minister Narendra Modi has been pushing for the privatisation and commercialisation of the country's space sector in the last few years.", "keywords": ["built", "rocket", "suborbital", "privately", "launches", "flight", "space", "second", "indian", "countrys", "launch", "semicryogenic", "startup", "agnikul", "engine", "vehicle"], "url": "https://www.yahoo.com/news/indian-space-startup-agnikul-launches-043829305.html", "imgURL": "https://media.zenfs.com/en/reuters.com/e4fd663eea6da48dfb3633cbc27377cf"}, {"news_number": 29, "title": "Why Temperatures In Indian Cities Are Rising Like Never Before", "summary": "In simple words, the urban heat island effect takes place when urban regions record higher temperatures than their rural surroundings.\nIt is worth noting that rising temperatures are not limited to India, and the conditions are getting worse all over the world.\nDry Heat Stress: Dry heat stress occurs when the temperatures rise but if the humidity remains low.\nMoist Heat Stress: This is humid heat stress.\nIn this condition, too, the body fails to cool down itself through sweating and heat stress rises.", "keywords": ["urban", "rising", "india", "occurs", "indian", "temperature", "rise", "temperatures", "stress", "heat", "cities", "degrees"], "url": "https://www.ndtv.com/india-news/why-temperatures-in-indian-cities-are-rising-like-never-before-5778285", "imgURL": "https://c.ndtvimg.com/2024-05/d0p53lag_heatwave-afp_625x300_30_May_24.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 30, "title": "Gauging gas-based power’s role in meeting India’s peak electricity demand", "summary": "Peak power demand touched a new high of 240GW in the fiscal year (FY) 2023-24.\nFigure 1 shows the constant increase in peak demand, which has risen by almost 150% from FY2017-18 to FY2023-24.\nIncreasing renewable energy penetration will also help meet peak power demand in the medium term due to the shifting of peak demand to daytime.\nFigure 1: India’s Peak Power Demand FY2017-18 to FY2023-24Source: Ministry of PowerThis note analyses the role that gas-based power has in meeting the peak power demand in India.\nWe base our findings on emerging trends in the shifting of peak demand hours and the cost-analysis of using gas-based power.", "keywords": ["meeting", "240gw", "indias", "electricity", "gauging", "peak", "demand", "power", "shifting", "energy", "role", "term", "powers", "plants", "gasbased"], "url": "https://ieefa.org/resources/gauging-gas-based-powers-role-meeting-indias-peak-electricity-demand", "imgURL": "https://ieefa.org/sites/default/files/2024-05/shutterstock_612580475.jpg"}, {"news_number": 31, "title": "New Delhi records highest-ever temperature of 52.3C as north India swelters", "summary": "The India Meteorological Department (IMD), which reported “severe heatwave conditions”, recorded the temperature in the New Delhi suburb of Mungeshpur on Wednesday afternoon, smashing the previous national record in the desert of Rajasthan by more than one degree Celsius.\nRajasthan’s Phalodi town previously held the all-time heat record, hitting 51C (124F) in 2016.\nIndia declares a heatwave whenever temperatures are above 45C (113 F).\nApril, May and June are hot in most parts of India before monsoon rains bring cooler temperatures.\nNew Delhi authorities have also warned of the risk of water shortages as the capital swelters in headache-inducing heat – cutting supplies to some areas.", "keywords": ["water", "swelters", "records", "risk", "india", "heatwave", "record", "523c", "weather", "delhi", "temperature", "north", "highestever", "temperatures", "heat", "severe"], "url": "https://www.aljazeera.com/gallery/2024/5/29/photos-north-india-swelters-as-new-delhi-records-highest-ever-temperature-of-49-9c", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/AP24150128815523-1716962709.jpg?resize=1920%2C1440"}, {"news_number": 32, "title": "Modi heads for two days of island meditation as Indian election nears end", "summary": "India’s election is the world’s largest, a mammoth exercise in democracy that has taken place over six weeks.\nModi will visit the Vivekananda Rock Memorial in Kanyakumari, a pilgrimage site off India’s southernmost tip, from May 30 to June 1, according to Indian state broadcaster DD News.\nThe Vivekananda Rock Memorial was built in 1970 in honour of Swami Vivekananda, who is said to have attained enlightenment on the rock.\nToward the end of the 2019 national elections, which he also won, Modi went to meditate in the revered Kedarnath shrine dedicated to Hindu deity Lord Shiva high in the Himalayas.\nModi and the BJP have increasingly resorted to overtly Islamophobic language during his recent election speeches.", "keywords": ["heads", "modi", "indias", "nears", "indian", "election", "making", "days", "won", "meditation", "hindu", "vivekananda", "rock", "end", "site", "island"], "url": "https://www.cnn.com/2024/05/29/india/india-narendra-modi-meditation-island-election-intl-hnk/index.html", "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/2024-05-28t161514z-1492962361-rc2pz7airqwd-rtrmadp-3-india-election-modi.jpg?c=16x9&q=w_800,c_fill"}, {"news_number": 33, "title": "U.S. created Indian boarding schools to destroy cultures and seize land", "summary": "European settlers waged war against Native Americans for centuries, decimating tribes through violence and spreading disease.\nMaps showing loss of Native American land from 1819 to 1879.\nNative American land Reservation land Land ceded to the U.S. Unceded land 1819 1839 1859 1879 Source: Invasion of America Native American land Reservation land Unceded land Land ceded to the U.S. 1819 1839 1859 1879 Source: Invasion of AmericaGeorge Washington believed that forcing Native Americans to assimilate to White culture would reduce bloodshed and expand the new country’s territory.\nPresident Thomas Jefferson's confidential message to Congress concerning relations with Native Americans.\n(National Archives)Jefferson also wanted to force Native Americans into debt so they would sell their land.", "keywords": ["seize", "america", "boarding", "destroy", "wrote", "1819", "native", "way", "united", "schools", "indian", "americans", "unceded", "created", "american", "land", "cultures"], "url": "https://www.washingtonpost.com/investigations/interactive/2024/american-indian-boarding-schools-history-legacy/", "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RWVECJMCWRHXBB5RZFCXRJR2RU.jpg&w=1200"}, {"news_number": 34, "title": "T20 World Cup 2024: ‘Lone wolf attack' threat during India vs Pakistan match, New York promises ‘largest security’", "summary": "Security has been beefed up for the high-profile India vs Pakistan T20 World Cup 2024 match on June 9 at the Nassau County Cricket Stadium, built on Eisenhower Park in New York.\nNassau County Executive Bruce Blakeman told CBS News that Nassau County receives all kinds of threats and the authority takes every threat seriously.\n“…close coordination with the New York State Police Counter Terrorism Unit and New York State Police Troop L, based on Long Island.\nHowever, there is no credible public safety threat this time.\nThe USA is hosting a cricket tournament on the scale of the World Cup for the first time, with the Nassau County Cricket Stadium set to feature eight matches.", "keywords": ["match", "cricket", "security", "threat", "county", "wolf", "stadium", "state", "pakistan", "t20", "nassau", "york", "world", "safety", "promises", "vs"], "url": "https://www.livemint.com/sports/cricket-news/t20-world-cup-2024-lone-wolf-attack-threat-during-india-vs-pakistan-match-new-york-promises-largest-security-11717051593168.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/30/1600x900/CRICKET-SPORT-USA-13_1717053416706_1717053445914.jpg"}, {"news_number": 35, "title": "Cyclone Remal: At least 16 killed in Bangladesh and India", "summary": "At least 16 dead as cyclone hits Bangladesh and India3 days ago Hafsa Khalil , BBC News ShareKM Asad/Getty ImagesAt least 16 people have died after a cyclone crashed into coastal parts of India and southern Bangladesh.\nNearly a million people were evacuated as Cyclone Remal made landfall on Sunday evening.\nAhead of Cyclone Remal, nearly three million people in Bangladesh saw their electricity shut off to avoid accidents, ministry officials said.\nSave the Children said it had sent four emergency response teams to the country's affected areas, including a medical team, to support recovery.\nThe charity's country director Shumon Sengupta said the cyclone \"shows yet again how vulnerable Bangladesh is to extreme weather events\".", "keywords": ["16", "including", "killed", "india", "west", "bangladesh", "areas", "remal", "cyclone", "nearly", "told", "million"], "url": "https://www.bbc.com/news/articles/ckvv8q10vxvo", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/24d9/live/4f1867f0-1c47-11ef-ac61-e7bb0ab72f9c.jpg"}, {"news_number": 36, "title": "New York increases security ahead of India vs Pakistan T20 World Cup match", "summary": "Security cover will be raised at the Eisenhower Park stadium in New York following reports of threats to the India vs Pakistan match on June 9 in T20 World Cup 2024 .\nA statement released by the governor's office said they are monitoring the situation and according to their intel \"there is no credible public safety threat at this time.\"\n\"I have also directed the New York State Police to engage in elevated security measures, including an increased law enforcement presence, advanced surveillance, and thorough screening processes,\" she said.\n\"Public safety is my top priority and we are committed to ensuring the Cricket World Cup is a safe, enjoyable experience.\"\nAn ICC spokesperson said: \"The safety and security of everyone at the event is our number one priority and we have a comprehensive and robust security plan in place.", "keywords": ["match", "including", "security", "india", "threat", "stadium", "cup", "pakistan", "authorities", "state", "t20", "increases", "york", "world", "safety", "robust", "vs"], "url": "https://www.espncricinfo.com/story/new-york-increases-security-ahead-of-india-pakistan-t20-world-cup-match-1435767", "imgURL": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/369000/369009.6.jpg"}, {"news_number": 37, "title": "IMD Heatwave Warning : '50.5°C, 50.3°C, 49.9°C...': It's raining fire in north India", "summary": "Delhi on Tuesday recorded its highest ever temperature with mercury reaching 49.9°C.\nTwo women from Delhi and Karnataka, both aged 63, and a 40-year-old man from Agra were undergoing treatment for heatstroke at Sawai Man Singh Hospital in Jaipur.\nThe hospital administration said despite all possible efforts, they could not be saved.Sirsa’s maximum temperature on Tuesday touched 50.3°C in a heatwave-gripped Haryana, where mercury crossed 44°C during peak hours at 18 stations and electrical infrastructure couldn’t take the load.\nAt many places in the state, the maximum temperature was between 44 and 47°C.\nThe IMD has issued weather advisory, asking people to remain hydrated and avoid coming out between 11am and 4pm.In Safdarjung, the city’s base observatory, maximum temperature was 45.8 degrees, five degrees above normal, and the highest this year.", "keywords": ["warning", "india", "heatwave", "505c", "raining", "north", "state", "highest", "499c", "temperature", "delhi", "heat", "rajasthan", "maximum", "imd", "temperatures", "recorded", "503c"], "url": "https://timesofindia.indiatimes.com/city/delhi/50-5c-50-3c-49-9c-its-raining-fire-in-north-india/articleshow/110519856.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110520156,width-1070,height-580,imgsize-1504740,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 38, "title": "At least 27 reportedly dead in fire at amusement arcade in Guajarat, India", "summary": "India games arcade fire kills 27, officials sayWatch: The gaming arcade in Rajkot was engulfed in a \"massive fire\"At least 27 people have died in a “massive fire” at a games arcade in India, local officials say.\nFlames and a huge pall of smoke could be seen rising into the sky at the building in Rajkot, in the western state of Gujarat.\n\"The bodies are charred beyond recognition and hence their identification will be difficult,\" senior police officer Radhika Bharai told reporters after providing the updated death toll.\nEarlier, Rajkot Police Commissioner Raju Bhargava told BBC Gujarati 24 people had died.\nThe blaze broke out on Saturday afternoon when the arcade was packed with children and young people.", "keywords": ["reportedly", "guajarat", "games", "india", "dead", "27", "rajkot", "victims", "minister", "massive", "died", "amusement", "officials", "told", "arcade"], "url": "https://www.bbc.com/news/articles/cneemmm3njyo", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/e73e/live/0767de80-1ac2-11ef-baa7-25d483663b8e.jpg"}, {"news_number": 39, "title": "Prajwal Revanna enroute to India; SIT ready to arrest from airport: Latest updates", "summary": "\"MEA has initiated action under provisions in the Passport Act 1967 for revocation of the diplomatic passport of Prajwal Revanna.\nA show cause notice was issued to the passport holder on 23rd May, giving him 10 working days to respond to our notice.\nA day ago, Prajwal Revanna filed an anticipatory bail application in the sexual assault case at the Bengaluru sessions court.\nNEW DELHI: Hassan MP Prajwal Revanna , who is facing charges of sexually abusing women, is set to return to India from Germany .\nOn the action ahead, Karnataka home minister G Parameshwara said if Prajwal arrives, he will be arrested and a legal process will be initiated.", "keywords": ["initiated", "sexually", "notice", "sit", "action", "india", "updates", "revanna", "airport", "passport", "issued", "arrest", "ready", "karnataka", "latest", "enroute", "prajwal"], "url": "https://timesofindia.indiatimes.com/india/prajwal-revanna-set-to-return-to-india-tonight-latest-developments/articleshow/110568047.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110568121,width-1070,height-580,imgsize-118446,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 40, "title": "Varanasi: The ancient city at the heart of India’s election", "summary": "Varanasi: The ancient city at the heart of India’s electionVaranasi is one of the world’s oldest cities and it’s often called India’s spiritual capital.\nIt holds even more prominence during the Indian election because it’s Prime Minister Narendra Modi’s constituency.\nVaranasi is voting on 1 June in the last phase of this mammoth general election.\nSince Mr Modi became the MP in 2014, the ancient city has gone through a modernisation drive.\nThe BBC spoke to some residents to understand what they think of the development.", "keywords": ["spoke", "city", "ancient", "understand", "voting", "indias", "election", "think", "spiritual", "varanasi", "worlds", "heart"], "url": "https://www.bbc.com/news/av/world-asia-india-69072682", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/465F/production/_133351081_p0j0xv51.jpg"}, {"news_number": 41, "title": "China's Most Advanced Stealth Fighters Deployed 150 Km From Sikkim", "summary": "Six Chinese J-20 stealth fighters at the airport in Shigatse.\nHigh-res hereSatellite images gathered on May 27 show that China has deployed its most advanced J-20 stealth fighter jets less than 150 kilometres from the boundary with India in Sikkim.\nSix Chinese J-20 stealth fighters at the airport in Shigatse.\n\"The J-20 stealth fighter is China's most advanced operational fighter aircraft to date, and these aircraft are predominantly based in the eastern provinces of China,\" according VP for Technology and Analysis at All Source Analysis.\nSome reports suggest China may already have deployed as many as 250 of the stealth fighters which are difficult to observe by radar.", "keywords": ["aircraft", "advanced", "150", "fighter", "deployed", "air", "india", "fighters", "shigatse", "chinese", "stealth", "airport", "sikkim", "chinas", "j20", "km"], "url": "https://www.ndtv.com/india-news/china-deploys-six-j-20-stealth-fighters-just-150-km-from-sikkim-border-5778944", "imgURL": "https://c.ndtvimg.com/2024-05/etbmrlmo_shigatse-j20-china_625x300_30_May_24.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 42, "title": "Sourav Ganguly’s cryptic post as search for India’s next head coach continues: ‘Choose coach and institution wisely..’", "summary": "As the search for India’s next head coach intensifies, Sourav Ganguly posted a cryptic message on social media which has piqued the fans’ interest.\nSo choose the coach and institution wisely…,” Ganguly posted on X.\nSo choose the coach and institution wisely… — Sourav Ganguly (@SGanguly99) May 30, 2024Narendra Modi, Amit Shah, Sachin Tendulkar, MS Dhoni are some of the names used by fake applicants for the job.\nIn 2022 when the BCCI had invited applications for the post of head coach, they had received around 5,000 applications from imposters using celebrity names.\nThe next head coach will begin his tenure soon after the T20 World Cup in the USA and Caribbean next month.", "keywords": ["coach", "applicants", "wisely", "sourav", "indias", "search", "fake", "bcci", "ganguly", "institution", "cryptic", "board", "applications", "gangulys", "head", "names", "post"], "url": "https://indianexpress.com/article/sports/cricket/sourav-ganguly-cryptic-post-india-head-coach-9361563/", "imgURL": "https://images.indianexpress.com/2024/05/Ganguly-2.jpg"}, {"news_number": 43, "title": "INDIA bloc to pick PM within 48 hours, party with most seats ‘natural claimant’ to leadership: Congress’s Jairam Ramesh", "summary": "I would say when INDIA janbandhan parties will get the people's mandate, then not only INDIA parties but also some NDA parties may join the coalition,\" he said.\nMr. Ramesh said the difference between INDIA and NDA is of two I's — I for 'insaniyat' and 'I' for 'imaandaari'.\nThose parties that have 'imaandaari (honesty)' and 'insaniyat (humanity)', but are in the NDA, will join the INDIA parties, he said.\n‘Authoritative government, not authoritarian’Mr. Ramesh said an INDIA bloc government formed after getting the mandate from the people will be \"authoritative\" but not \"authoritarian\".\nINDIA bloc leaders will meet June 1Asked about the reported June 1 meeting of INDIA bloc partners, Ramesh said he does not have any authentic information that the meeting is going to take place that day but the INDIA bloc leaders will certainly meet.", "keywords": ["pick", "hours", "jairam", "mr", "seats", "ramesh", "india", "going", "janbandhan", "congresss", "bloc", "congress", "party", "alliance", "leadership", "natural", "parties"], "url": "https://www.thehindu.com/elections/lok-sabha/india-bloc-to-pick-pm-within-48-hours-party-with-most-seats-natural-claimant-to-leadership-congresss-jairam-ramesh/article68231320.ece", "imgURL": "https://th-i.thgim.com/public/incoming/669n9h/article68231324.ece/alternates/LANDSCAPE_1200/IMG_6270_17_5_2024_18_21_2_1_O9CQM7NE.jpg"}, {"news_number": 44, "title": "As India vs Pakistan T20 World Cup match gets ISIS-K threat, security beefed up in New York", "summary": "Security has been stepped up in New York after terror group ISIS-K made a “global” threat year against the upcoming ICC Men’s T20 Cricket World Cup match featuring India and Pakistan.\nSpeaking about the event, the county police commissioner said that this was the largest security that they have had to deal with in the county’s history.\n“I can guarantee you this — the safest place to be in Nassau County on June 9th will be inside that stadium,” Ryder told CNN.\nISIS-K was the militant outfit that had claimed responsibility for the attack in Moscow’s famous Crocus City Hall in March, killing at least 143 people.\nThe group emerged in eastern Afghanistan in late 2014, and is currently one of the most active ISIS-affiliates.", "keywords": ["match", "isisk", "security", "threat", "india", "county", "pakistan", "event", "ryder", "t20", "nassau", "york", "world", "told", "threats", "vs"], "url": "https://indianexpress.com/article/world/india-vs-pakistan-t20-world-cup-isis-k-threat-9360617/", "imgURL": "https://images.indianexpress.com/2024/05/ICC-T20-World-Cup.jpg"}, {"news_number": 45, "title": "Uttar Pradesh: The state holding the key to India PM Modi's re-election", "summary": "The Indian state holding the key to PM Modi's re-election2 days ago Geeta Pandey , BBC News ShareAnkit Srinivas A group of women in Uttar Pradesh, India's most politically crucial state with 80 parliament seatsAs India votes to elect a new government, all eyes are on the northern state of Uttar Pradesh, commonly known by its initials UP.\nSpread over an area roughly the size of Britain, the state packs in nearly four times as many people.\nThe state is among just three in India which are voting in all seven phases in the elections which are spread over 44 days.\nHe’s set his Bharatiya Janata Party (BJP) a goal of 370 seats - a party needs 272 to win.\nIn 2014, BJP won 71 seats in the state and in 2019, it got 62.", "keywords": ["mr", "city", "pradesh", "seats", "modi", "india", "indias", "state", "key", "reelection", "party", "uttar", "holding", "bjp", "modis"], "url": "https://www.bbc.com/news/articles/cqee449yl5lo", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/770b/live/10b1e040-1cf6-11ef-a13a-0b8c563da930.jpg"}, {"news_number": 46, "title": "\"Goes Against Our Territorial Integrity\": India On China-Pak Infra Project", "summary": "He stated that India is not in favour of the China-Pakistan Economic Corridor (CPEC) as it goes against New Delhi's territorial integrity and sovereignty.\nWe want to tell you, the whole of Jammu and Kashmir and Ladakh, the union territories, they are part of India, an integral part of India.\nThey are an integral part of India and they will remain an integral part of India.\"\nMr Jaiswal's statement comes after Pakistan and China agreed to advance their joint project CPEC and backed finalising the modalities for third-party participation.\nHe informed the Council that the human rights situation in Balochistan escalated after the construction of the multi-billion dollar CPEC project.", "keywords": ["human", "situation", "cpec", "india", "rights", "project", "territorial", "chinapak", "pakistan", "integral", "baloch", "goes", "stated", "infra", "integrity"], "url": "https://www.ndtv.com/india-news/not-in-favour-of-cpec-india-reiterates-its-stance-on-pojk-5780805", "imgURL": "https://c.ndtvimg.com/2018-10/8s13mp88_gwadar_port_cpec_reuters_625x300_26_October_18.jpg"}, {"news_number": 47, "title": "\"Aukat Se Bahar\": India, Pakistan Fans In War Of Words Over Video Of Stars Walking Past IPL Final Telecast", "summary": "India vs Pakistan - if on the field it's an intense cricket contest, off the field too things are no less.\nThe Indian cricket team and Pakistan cricket team will once again face off at the T20 World Cup 2024 on June 9.\nThough, India enjoy supremacy as far as head-to-head record is concerned, Pakistan are T20 World Cup runner-up of 2022.\nAhead of the clash, India and Pakistan engaged in a war of words over a viral video which showed Pakistan players walking past a TV screen, where IPL final was being telecast.\n\"Public safety is my top priority and we are committed to ensuring the Cricket World Cup is a safe, enjoyable experience,\" she added.", "keywords": ["stars", "past", "cricket", "india", "security", "players", "words", "pakistan", "video", "cup", "war", "t20", "walking", "ipl", "world", "team", "se", "telecast"], "url": "https://sports.ndtv.com/cricket/aukat-se-bahar-india-pakistan-fans-in-war-of-words-over-video-of-stars-walking-past-ipl-final-telecast-5779726", "imgURL": "https://c.ndtvimg.com/2024-05/44k1i3p8_pakistan-ipl_625x300_30_May_24.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675"}, {"news_number": 48, "title": "Indian PM Modi’s latest campaign message to supporters: ‘God has sent me’", "summary": "CNN —India’s Prime Minister Narendra Modi has a new message for supporters on the campaign trail: God has chosen him.\n“This is why I have dedicated myself to God.”Modi continued: “God doesn’t reveal his cards.\nThis, he added has “rallied his base who feel pride in such religiosity.”India is a deeply religious country.\n“(He is) the first prime minister, they say, to be unashamed about this faith,” Sinha said.\nIt ignited widespread anger among Muslim leaders and opposition politicians and calls for election authorities to investigate.", "keywords": ["ram", "modi", "country", "indias", "indian", "election", "campaign", "prime", "god", "sent", "message", "hindu", "minister", "latest", "supporters", "bjp", "modis"], "url": "https://www.cnn.com/2024/05/28/india/india-narendra-modi-chosen-by-god-intl-hnk/index.html", "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/2024-04-21t171632z-74092274-mt1asnews20240421229l-rtrmadp-3-ani.jpg?c=16x9&q=w_800,c_fill"}, {"news_number": 49, "title": "IISc finds safer way to mass production recombinant proteins like insulin", "summary": "The team is also looking for industry collaborators to scale up the system for mass production .The conventional method to manufacture recombinant proteins involves using the yeast Pichia pastoris (now called Komagataella phaffii) activated by methanol.\nHowever, methanol is highly flammable and hazardous, requiring stringent safety precautions.To solve this problem, Trishna Dey, a former PhD student at IISC’s department of biochemistry (BC), started looking for alternatives.\nVedanth Bellad and Yash Sharma, project assistants at BC and co-authors, explain that they tried supplementing the culture with various other compounds, until one finally did the trick: Ethanol.Adding ethanol helped the cells grow faster, which increased the biomass and the amount of recombinant protein produced.\nEthanol is also safer for yeast cells compared to methanol, as it does not produce toxic byproducts when broken down.“To test their process, the team tried producing the SARS-CoV-2 receptor binding domain – a widely-used vaccine antigen that has been successfully expressed in yeast and mammalian cells.\nThey found that their new expression system produced twice the amount of antigen compared to the methanol-induced process,” IISc said.", "keywords": ["finds", "recombinant", "using", "produced", "yeast", "way", "mass", "production", "safer", "methanol", "msg", "insulin", "team", "cells", "system", "proteins", "iisc"], "url": "https://timesofindia.indiatimes.com/india/iisc-finds-safer-way-to-mass-production-recombinant-proteins-like-insulin/articleshow/110562436.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110562601,width-1070,height-580,imgsize-1034933,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 50, "title": "Delhi heat wave: Indian capital breaks all-time heat record, as authorities impose water rationing", "summary": "New Delhi CNN —India’s capital territory of Delhi sweltered to its highest-ever temperature of 49.9 degrees Celsius (121.8 degrees Fahrenheit) on Tuesday, as an oppressive heat wave forced authorities to impose water rationing.\nThe Indian Meteorological Department (IMD) said the new record was measured in the suburb of Mungeshpur, surpassing Delhi’s previous high of 49.2 degrees Celsius (120.5 degrees Fahrenheit), observed in May 2022.\nThe temperature in the city of Churu in the state of Rajasthan soared to 50.5 degrees Celsius (122.9 degrees Fahrenheit).\nSirsa, a city in the state of Haryana, saw thermometers reach 50.3 degrees Celsius (122.5 degrees Fahrenheit), Indian authorities said.\nA man drinks water at a roadside stall serving free drinking water to commuters in New Delhi on May 22.", "keywords": ["rationing", "water", "impose", "singh", "record", "wave", "india", "indian", "capital", "state", "delhi", "breaks", "temperature", "celsius", "heat", "fahrenheit", "degrees"], "url": "https://www.cnn.com/2024/05/29/weather/india-heat-record-water-rationing-intl/index.html", "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2154585630.jpg?c=16x9&q=w_800,c_fill"}, {"news_number": 51, "title": "ISIS-Linked Outfit Threatens Attack On India-Pak T20 World Cup Match In US", "summary": "ISIS-K has called for a \"Lone Wolf\" attack on the India-Pakistan World Cup Cricket match here next month, a top police official has warned while putting security on high alert.\nAdditional police officers will be mobilised at the cricket stadium at Eisenhower Park, Ryder said at the news conference.\n\"My administration has been working for months with federal law enforcement and Nassau County to ensure New Yorkers and visitors are safe,\" she said.\nThe World Cup Cricket stadium, which has a 30,000-capacity, was built specially for the tournament and will share the fixtures in the US with the arena in Dallas.\nIt said that ISIS \"followers are encouraged to target major events\" including the Cricket World Cup.", "keywords": ["match", "cricket", "threatens", "indiapak", "county", "threat", "india", "attack", "stadium", "isislinked", "cup", "security", "t20", "nassau", "terror", "york", "world", "outfit"], "url": "https://www.ndtv.com/world-news/isis-linked-outfit-khorasan-threatens-terror-attack-on-india-pak-t20-world-cup-match-in-us-new-york-5774982", "imgURL": "https://c.ndtvimg.com/2020-12/cfdbgnbg_cricket-stadium-generic-twitter_625x300_05_December_20.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 52, "title": "Experts warn of heat risks as India temperatures climb again", "summary": "“Hot nights are as dangerous as midday peak temperatures,” experts warn.\nIndia is enduring a crushing heatwave with temperatures in several cities sizzling well over 45°C.\nWorkers stack ice blocks at a market during a hot summer day in New Delhi on May 30, 2024, amid ongoing heatwave.\n— AFP“Cities are more vulnerable to the compounding effects of urbanisation and climate change,” said Aarti Khosla, director at research institute Climate Trends.\n— AFPIndia is no stranger to searing summer temperatures, but years of scientific research have found climate change is causing heatwaves to become longer, more frequent and more intense.", "keywords": ["change", "climate", "climb", "india", "experts", "warn", "hot", "heatwave", "risks", "weather", "summer", "delhi", "temperatures", "heat"], "url": "https://www.dawn.com/news/1836635/experts-warn-of-heat-risks-as-india-temperatures-climb-again", "imgURL": "https://i.dawn.com/large/2024/05/30162116fe862fd.jpg?r=162242"}, {"news_number": 53, "title": "India faces record-breaking heatwave worsened by climate change", "summary": "Cities are more vulnerable to the compounding effects of urbanisation and climate change.\nA dedicated study is no longer necessary to understand whether climate change made a particular heatwave hotter, as this is now the case for all heatwaves.\nThe suffering India is facing this week is worse because of climate change caused by burning coal, oil, and gas, and deforestation.\nHowever, climate change has made things worse for India.\n“Climate change has been making heat waves more intense and frequent.", "keywords": ["recordbreaking", "change", "climate", "high", "heatwave", "india", "heatwaves", "waves", "extreme", "likely", "temperatures", "heat", "worsened", "faces"], "url": "https://www.indiatoday.in/environment/story/india-faces-record-breaking-heatwave-worsened-by-climate-change-2545674-2024-05-30", "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/water-shortage-30240446-16x9_0.jpg?VersionId=6g7lreBKpG817KmUgc6ayZX8puenVtpV"}, {"news_number": 54, "title": "Heatwave alert: These Indian cities surpass 50 degrees Celsius in 2024", "summary": "DelhiChuru, RajasthanPholodi, RajasthanSirsa, HaryanaNEW DELHI: As an unrelenting heatwave engulfs northern India, several cities have witnessed temperatures soaring past the 50-degree Celsius mark, shattering records and pushing the resilience of millions to the brink.From the national capital of Delhi, where a weather station fleetingly recorded an astonishing 52.9 degrees Celsius, to the parched terrains of Rajasthan and the bustling streets of Haryana, the mercury has skyrocketed, signifying severe climatic conditions.In the midst of an intense heatwave gripping Delhi-NCR, a weather station in the capital sent newsrooms across the nation into a frenzy when it reported a temperature of 52.9 degrees Celsius on Wednesday, the highest officially recorded in India.However, the reading is yet to be deemed \"official.\"\nIMD officials stated that the reading at Mungeshpur could be attributed to \"sensor error or localized factors,\" as it significantly surpassed temperatures recorded at other stations by nearly 4 degrees (3.8) - the next highest being 49.1 degrees Celsius at Najafgarh.IMD clarified that while a city can experience localized pockets of extreme heat, Mungeshpur is an 'automatic weather station' known to occasionally produce erroneous readings.\nA team has been dispatched by IMD to Mungeshpur to investigate the matter.Churu in Rajasthan recorded a scorching temperature of 50.5 degrees Celsius on Tuesday, the highest of the season thus far, underscoring the \"unprecedented\" severe heatwave conditions prevailing across northern India.Temperatures in Phalodi, Rajasthan, skyrocketed to a blistering 50 degrees Celsius last week, as a heatwave swept through vast swathes of India, challenging the endurance of millions, including those who ventured out to cast their votes in the sixth phase of the ongoing general elections.According to the India Meteorological Department (IMD), 50 degrees Celsius is the highest temperature recorded in the country since June 1, 2019, when Churu, also in Rajasthan, registered a scorching 50.8 degrees Celsius.Sirsa's maximum temperature on Tuesday reached a searing 50.3 degrees Celsius in a heatwave-gripped Haryana, where the mercury surpassed 44°C during peak hours at 18 stations, overwhelming the electrical infrastructure.", "keywords": ["heatwave", "weather", "indian", "alert", "50", "rajasthan", "highest", "station", "temperature", "mungeshpur", "celsius", "2024", "surpass", "recorded", "cities", "degrees"], "url": "https://timesofindia.indiatimes.com/city/delhi/heatwave-alert-these-indian-cities-surpass-50-degrees-celsius-in-2024/articleshow/110551491.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110551512,width-1070,height-580,imgsize-49740,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 55, "title": "‘Heartbreaking loss of civilian lives’: India on Israeli strike in Rafah, calls for respect of humanitarian law", "summary": "Days after an Israeli attack in the southern Gaza city of Rafah, that killed 45, India described the loss of lives as “heartbreaking\", while reiterating its position on the Israel-Gaza war.\nIndia also called for the protection of civilians and respect for international humanitarian law in Israel's war on Palestinians.\nAt least 45 persons, mostly women and children, sheltering in tents were killed in Israeli airstrikes, triggerring massive global outrage.\n\"India recognised Palestine way back in the 1980s.\nEver since the attack on the Israeli territory, over 35,000 people have been killed in Israeli airstrikes.", "keywords": ["recognised", "heartbreaking", "palestine", "killed", "india", "law", "humanitarian", "respect", "attack", "way", "lives", "airstrikes", "strike", "war", "rafah", "israeli", "loss"], "url": "https://www.livemint.com/news/world/heartbreaking-loss-of-civilian-lives-india-on-israeli-strike-in-rafah-calls-for-respect-of-humanitarian-law-11717079975316.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/30/1600x900/Israel-Palestinians-2_1717081559707_1717081603530.jpg"}, {"news_number": 56, "title": "Behind heat surge, factors that will only worsen", "summary": "(AFP)This unprecedented heat is an accepted trend among climate scientists and is expected to worsen in coming years.\nThe frequency and intensity of heat waves in India have increased significantly from 1951-2015, with accelerated warming in the last 30 years.\nBy 2040-2069, mean surface air temperature is projected to rise 1.4-2.7°C compared to 1976-2005 levels.\n“We had expected severe heat wave spells this year because El Nino is transitioning to neutral conditions and during such periods El Nino leaves a very strong mark causing severe heat spells.\nWhen this happens, warm air is compressed and pushed towards the surface—just like closing something with a screwdriver.", "keywords": ["climate", "air", "india", "circulation", "similar", "surge", "warm", "temperature", "worsen", "temperatures", "heat", "severe", "factors"], "url": "https://www.hindustantimes.com/india-news/behind-heat-surge-factors-that-will-only-worsen-101717068263569.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/30/1600x900/A-worker-sprinkles-water-on-a-subway-to-bring-reli_1717068214533.jpg"}, {"news_number": 57, "title": "The Pakistan ‘hand’ in Indian LS elections: Who is Fawad Chaudhry?", "summary": "ONE WAY or the other, Pakistan has been finding its way into the Indian election discourse.\nAdvertisementThe BJP was ready with a quick response, saying the Congress’s “dalliance” with Pakistan couldn’t get more obvious.\n“Ch Fawad Hussain, who served in the Imran Khan cabinet, as Minister for Information and Broadcasting, is promoting Rahul Gandhi.\nModi joined soon after, saying at a rally in Gujarat: “While the Congress is dying here, Pakistan is crying there.\nMore than Chaudhry’s interest in the Indian elections, what would have Pakistan surprised is Indian leaders’ interest in him.", "keywords": ["chaudhry", "india", "indian", "bjp", "pakistan", "pakistani", "rahul", "congress", "minister", "elections", "saying", "ls", "hand", "fawad"], "url": "https://indianexpress.com/article/political-pulse/the-pakistan-hand-in-indian-ls-elections-who-is-fawad-chaudhry-9361655/", "imgURL": "https://images.indianexpress.com/2024/05/Fawad-Chaudhury.jpg"}, {"news_number": 58, "title": "Loss of lives in Rafah heartbreaking, says India", "summary": "The loss of Palestinian lives in the recent Israeli bombing of Rafah is “heartbreaking”, India said on Thursday.\nHe also highlighted that India had recognised the Palestinian state way back in the late 1980s.\n“The heartbreaking loss of civilian lives in the displacement camp in Rafah is a matter of deep concern.\nIn response to a question, Mr. Jaiswal reiterated India’s support for a “two-state solution” to the Israel-Palestinian crisis.\nBut we violated that agreement….it was our fault,” Mr. Sharif said, after he became the president of the PML-N for six years.", "keywords": ["mr", "heartbreaking", "sharif", "india", "jaiswal", "lives", "pakistan", "state", "palestinian", "rafah", "israeli", "loss", "nuclear"], "url": "https://www.thehindu.com/news/national/loss-of-lives-in-rafah-heartbreaking-says-mea/article68232968.ece", "imgURL": "https://th-i.thgim.com/public/incoming/tv9huz/article68233520.ece/alternates/LANDSCAPE_1200/AFP_34U982W.jpg"}, {"news_number": 59, "title": "Top Events on May 30: PM Modi on meditation break, India-France talks on fighter jet deal, heatwave alert, and more", "summary": "Top Events on May 30: India is all set to witness various political, technological, sports, and entertainment events today.\nIndia and France will begin the talks on the Rafale Marine fighter jet deal in Delhi on Friday.\n- Uttar Pradesh Chief Minister Yogi Adityanath will address a public meeting at Rath Maidan in Himachal Pradesh's Kullu on May 30.\n- A high-level French government team will arrive in India on Thursday, May 30, to begin talks on the Rafale Marine fighter jet deal in Delhi.\n- The India Meteorological Department (IMD) has predicted intense heat and heatwaves in Delhi, Punjab, Haryana, and Chandigarh until May 30.", "keywords": ["talks", "today", "minister", "modi", "heatwave", "meditation", "break", "indiafrance", "meeting", "jet", "deal", "india", "delhi", "events", "rafale", "set", "visit", "fighter", "pradesh", "30"], "url": "https://www.livemint.com/news/india/top-events-on-may-30-pm-modi-on-meditation-break-india-france-talks-on-fighter-jet-deal-heatwave-alert-and-more-11717029275307.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/30/1600x900/ANI-20240316055-0_1710667794137_1717031005415.jpg"}, {"news_number": 60, "title": "‘Mass murder’ threat during India vs Pakistan T20 World Cup match, ‘largest security in US history' promised: Report", "summary": "Although the governor's office did not find any evidence to corroborate the threat and there was \"no credible public safety threat at this time\", the authorities decided against taking any chances.\nNassau County Executive Bruce Blakeman and Police Commissioner Patrick Ryder addressed the threat of a 'lone wolf attack', a mass murder attempt at a public place carried by an individual, during the India vs Pakistan World Cup match.\n\"Each and every day, Nassau County, as well as other communities and cities and counties and towns throughout the United States, receive all kinds of threats.\n‘Largest security in US history’ promised during India vs Pakistan World Cup matchWhen asked about the lone wolf attack tip-off, Police Commissioner Ryder assured \"largest security in the country's history\" to ensure Nassau County was the \"safest place on June 9\".\nWhile there is no credible public safety threat at this time, we continue to monitor the situation closely.", "keywords": ["match", "cricket", "promised", "report", "security", "threat", "murder", "county", "cup", "pakistan", "safe", "t20", "nassau", "york", "world", "safety", "vs"], "url": "https://www.hindustantimes.com/cricket/mass-murder-threat-during-india-vs-pakistan-t20-world-cup-match-largest-security-in-country-s-history-promised-by-usa-101717038358757.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/30/1600x900/CRICKET-WORLDCUP-IND-PAK--291_1697876290654_1717038499779.JPG"}, {"news_number": 61, "title": "A chicken recipe so good its origin is being fought in court", "summary": "A chicken recipe so good its origin is being fought in court2 days ago By Tamara Hinson ShareGetty Images Butter chicken is one of the most popular curries around the world (Credit: Getty Images)A dish beloved around the world, butter chicken is now at the heart of a legal battle being waged by two of India's oldest restaurants.\nTo add insult to injury, its tagline included the words \"by the inventors of Butter Chicken\".\nWhose grandfather prepared that first portion of butter chicken is almost certainly impossible to prove, although Bagga believes it was probably a collaboration.\n\"Their case is about someone saying their grandfather invented butter chicken, but who knows which partner invented it?\"\nSure, some people might come because of the story, but they won't return if the butter chicken isn't good.\"", "keywords": ["fought", "court", "gravy", "chicken", "butter", "moti", "jaggi", "good", "recipe", "mahal", "delhi", "origin", "dish", "restaurant", "daryaganj"], "url": "https://www.bbc.com/travel/article/20240528-a-chicken-recipe-so-good-its-origin-is-being-fought-in-court", "imgURL": "https://ychef.files.bbci.co.uk/624x351/p0j0090y.jpg"}, {"news_number": 62, "title": "INDIA bloc PM within 48 hrs, party with max seats 'natural claimant' to leadership, says Jairam Ramesh", "summary": "In an exclusive interview with ⁠⁠⁠⁠⁠⁠⁠PTI, Ramesh exuded confidence that the INDIA bloc will get seats above the 272 needed for a majority in the Lower House.\nHe said the NDA parties may join the coalition when the INDIA parties come to power.\nI would say when INDIA janbandhan parties will get the people's mandate, then not only INDIA parties but also some NDA parties may join the coalition.\n“Those parties that have 'imaandaari (honesty)' and 'insaniyat (humanity)', but are in the NDA, will join the INDIA parties.\n“I don't want to get into numbers but all I am saying is that we (INDIA bloc) will get a clear and decisive majority.", "keywords": ["decisive", "jairam", "nda", "seats", "max", "ramesh", "india", "claimant", "ji", "bloc", "congress", "party", "leadership", "hrs", "join", "majority", "natural", "parties"], "url": "https://www.livemint.com/elections/india-bloc-pm-within-48-hrs-party-with-max-seats-natural-claimant-to-leadership-11717044736567.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/30/1600x900/AICC-Conference-Press-4_1712468896037_1717045003671.jpg"}, {"news_number": 63, "title": "PlayStation India launches 'Days of Play' sale with huge discounts on PS5 consoles, VR, and games", "summary": "Sony PlayStation India has just kicked off its highly anticipated \"Days of Play\" sale, offering gamers massive discounts on the PS5 Slim, PlayStation VR 2, DualSense controllers, and a vast library of games.\nRelated ArticlesUpgrade Your Setup for Less:PS5 Slim: Save big on the PS5 Slim, with the disc version now at ₹49,990 (originally ₹54,990) and the digital edition at ₹39,990 (originally ₹44,990).\nBlack and white versions are now ₹4,299 (originally ₹5,990), and coloured variants are also down to ₹4,299 (originally ₹6,390).\nGame On with Deep Discounts:Explore a massive selection of PS5 and PS4 games at incredible prices.\nSee the full list of discounted games on participating retailers' websites and online platforms.", "keywords": ["originally", "ps5", "controllers", "games", "launches", "india", "vr", "sony", "slim", "participating", "massive", "sale", "retailers", "play", "huge", "playstation", "discounts"], "url": "https://www.businesstoday.in/technology/news/story/playstation-india-launches-days-of-play-sale-with-huge-discounts-on-ps5-consoles-vr-and-games-431460-2024-05-30", "imgURL": "https://akm-img-a-in.tosshub.com/businesstoday/images/story/202405/6658331a5efd5-playstation-india-days-of-play-sale-300440502-16x9.png"}, {"news_number": 64, "title": "Architects of hate: who is fuelling discord in India’s digital elections?", "summary": "In the current political landscape, the role of third-party advertisers has emerged as a formidable force, shaping narratives and influencing public opinion.\nAd analysisOut of the total 51 advertisers identified on both platforms, a striking trend emerged wherein pages were actively campaigning through political ads in support of various political parties.\nThis phenomenon reflects the far-reaching impact of third-party advertisers, extending beyond national narratives to shape local dynamics.\nFor analysing content of third-party ads, we focused on three controversial themes to underscore the problematic content they promote.\nOn Page 19 of Chapter 2, it prohibits such advertisements, citing the potential for undue benefits to other parties or candidates, excluding contesting candidates or political parties.", "keywords": ["digital", "ads", "indias", "advertisers", "hate", "architects", "discord", "political", "thirdparty", "meta", "table", "themes", "elections", "candidates", "content", "fuelling", "parties"], "url": "https://www.thehindu.com/elections/lok-sabha/architects-of-hate-who-is-fuelling-discord-in-indias-digital-elections/article68230037.ece", "imgURL": "https://th-i.thgim.com/public/incoming/czbbvs/article68230056.ece/alternates/LANDSCAPE_1200/20240415023L.jpg"}, {"news_number": 65, "title": "Why elections in India, the world’s largest democracy, are crucial to watch", "summary": "Over the weekend, in an election campaign rally in northwest India, Modi referred to Muslims as “infiltrators.” His critics have called it hate speech.\nNearly 200 million Muslims call India their home, making up the third largest population of Muslims in the world.\nwith questions as to who is next on the list,” said Raqib Naik, a U.S.-based journalist and founder of India Hate Lab, a research group that documents hate speech and polarization.\nIn 2023, India Hate Lab documented 668 hate speech events targeting Muslims, 3/4th of them were in BJP ruled states and federally governed territories.\nAnd this has been deliberate and systematic,” said Naik of India Hate Labs.", "keywords": ["watch", "freedom", "singh", "largest", "modi", "india", "indias", "china", "hate", "indian", "democracy", "muslims", "worlds", "elections", "crucial", "modis"], "url": "https://www.pbs.org/newshour/world/why-elections-in-india-the-worlds-largest-democracy-are-crucial-to-watch", "imgURL": "https://d3i6fh83elv35t.cloudfront.net/static/2024/04/2024-04-22T142102Z_897427929_RC2YW6AWY7WF_RTRMADP_3_INDIA-ELECTION-RELIGION-MODI-1024x685.jpg"}, {"news_number": 66, "title": "Delhi heatwave: officials investigating if temperature of 52.9C due to faulty sensor", "summary": "Authorities in India are investigating whether a faulty sensor may have been behind a reading that showed temperatures in Delhi soaring past 50 degrees for the first time, amid a scorching heatwave in the capital.\nProtesting Indian farmers endure severe heatwave – videoThe IMD warned of the heat’s impact on health, especially for children, elderly people and those with chronic diseases.\nPhotograph: Arun Sankar/AFP/Getty ImagesCity authorities warned of the risk of water shortages as the capital swelters.\nThe water minister, Atishi Marlena, called for “collective responsibility” in stopping wasteful water use, the Times of India reported on Wednesday.\nWork is work.", "keywords": ["work", "water", "working", "heatwave", "india", "capital", "investigating", "authorities", "delhi", "temperature", "sensor", "heat", "faulty", "warned", "officials", "temperatures", "529c"], "url": "https://www.theguardian.com/world/article/2024/may/29/delhi-temperature-hits-499c-as-indias-capital-records-hottest-day", "imgURL": "https://i.guim.co.uk/img/media/0fc7c896a4c480035381ed594623d43c58e26260/0_105_2229_1337/master/2229.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1f9e0decf696fa54636c262491ee80db"}, {"news_number": 67, "title": "Amid Hunt For India's Next Head Coach, Sourav Ganguly Posts Intriguing Message", "summary": "The hunt for Indian cricket team's next head coach is underway and many names have emerged as options for the highly coveted position.\nCurrent head coach Rahul Dravid's tenure ends after the upcoming T20 World Cup 2024 and media reports suggested that BCCI have already approached certain individuals for the job.\nAmid all the discussion over the position, former Indian cricket team captain Sourav Ganguly took to social media to post an intriguing message.\nSo choose the coach and institution wisely…,\" he posted on X (formerly Twitter).\nRight now, the team will be busy with World T20 for the better part of the month of June.", "keywords": ["coach", "amid", "coaches", "world", "team", "posts", "hunt", "sourav", "indias", "future", "t20", "message", "ganguly", "intriguing", "cricket", "wisely", "indian", "bcci", "head"], "url": "https://sports.ndtv.com/cricket/amid-hunt-for-indias-next-head-coach-sourav-ganguly-posts-intriguing-message-5777116", "imgURL": "https://c.ndtvimg.com/2023-08/aqoslkh8_sourav-ganguly_625x300_20_August_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675"}, {"news_number": 68, "title": "8 hottest places in India right now and their recorded temperatures", "summary": "India is currently breaking all the records when it comes to heat.\nRecently, Mungeshpur in national capital Delhi recorded an unbearable 52.3 degrees Celsius on mercury, the highest temperature recorded in India ever!\nThis heatwave has gripped the region, with Mungeshpur experiencing temperatures over nine degrees higher than usual.\nPhalodi in Rajasthan recorded a sweltering 51 degrees Celsius, while Sirsa in Haryana reached 50.3 degrees Celsius, and Gwalior in Madhya Pradesh climbed to 48 degrees Celsius.\nHere are the top 8 hottest places in India, along with their recorded temperatures:", "keywords": ["places", "hottest", "unbearable", "india", "usual", "mungeshpur", "heat", "temperature", "celsius", "right", "recorded", "temperatures", "degrees"], "url": "https://timesofindia.indiatimes.com/travel/destinations/8-hottest-places-in-india-right-now-and-their-recorded-temperatures/photostory/110563327.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110563327,width-1070,height-580,resizemode-75,imgsize-110563327,pt-32,y_pad-40/110563327.jpg"}, {"news_number": 69, "title": "As PM Modi Visits Kanniyakumari To Meditate, His 33-Year-Old Photo Surfaces Online", "summary": "Narendra Modi and Murli Manohar Joshi at Vivekananda Rock Memorial in Kanniyakumari in 1991Prime Minister Narendra Modi marked the end of a hectic poll campaign and reached Kanniyakumari today for a two-day meditation at the iconic Vivekananda Rock Memorial.\nThe pictures dated December 11, 1991, are from Ekta Yatra that commenced from the iconic Vivekananda Rock Memorial in Kanniyakumari and ended in Kashmir.\nThe Ekta Yatra was led by veteran BJP leader Murli Manohar Joshi while Narendra Modi, then a BJP worker, served as a key pivot in organising the march.\nStarting from May 30-June 1, PM Modi is set to undertake 48-hour meditation at Dhyan Mandapam, the spot where Swami Vivekananda meditated in 1892.\nIt is said that Swami Vivekananda after wandering across the country meditated here for three days and attained a vision for a developed India.", "keywords": ["meditate", "surfaces", "kanniyakumari", "yatra", "modi", "33yearold", "ekta", "swami", "online", "visits", "narendra", "murli", "pictures", "vivekananda", "rock"], "url": "https://www.ndtv.com/india-news/as-pm-narendra-modi-heads-to-kanyakumari-to-meditate-his-33-year-old-photo-surfaces-online-5778255", "imgURL": "https://c.ndtvimg.com/2024-05/a3fquf6_narendra-modi-photo-at-vivekananda-rock-memorial-from-1991_625x300_30_May_24.jpeg?ver-20240506.08"}, {"news_number": 70, "title": "ICC Breaks Silence Over Terror Threat To India vs Pakistan T20 World Cup Game", "summary": "Ahead of the high-octane India versus Pakistan clash in the ICC T20 World Cup on June 9, security cover will be raised at New York's Eisenhower Park stadium following reports of threats to the match, reported ESPNCricinfo.\nAs per a statement by the governor's office, the situation is being monitored and according to their intel \"there is no credible public safety threat at this time.\"\n\"Public safety is my top priority and we are committed to ensuring the Cricket World Cup is a safe, enjoyable experience,\" she added.\nESPNCricinfo has learnt that no corroborative evidence has been found by authorities to back the reported threat.\nBut the International Cricket Council (ICC) has said that security will be \"robust\" throughout the tournament across all venues.", "keywords": ["cricket", "icc", "including", "india", "threat", "silence", "security", "cup", "pakistan", "authorities", "game", "t20", "terror", "york", "world", "safety", "vs"], "url": "https://sports.ndtv.com/t20-world-cup-2024/icc-breaks-silence-over-terror-threat-to-india-vs-pakistan-t20-world-cup-game-5776096", "imgURL": "https://c.ndtvimg.com/2023-10/kq6tcivo_india-pakistan-match_625x300_18_October_23.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675"}, {"news_number": 71, "title": "Who is Dhruv Rathee? From Modi fan to Indian PM’s most formidable critic", "summary": "Consider the numbers: On YouTube, Rathee has more than 20 million subscribers, nearly four times the BJP channel’s count.\nThe Congress, the principal opposition party, has a little more than 5 million YouTube subscribers, while its biggest leader, Rahul Gandhi, has 6 million.\nBack then, to Rathee, Modi symbolised hope.\nA lighter sideThat approach is complemented by the other YouTube channel that Rathee runs: Dhruv Rathee Vlogs.\nAs with his political videos, Rathee speaks to his viewers in Hindi.", "keywords": ["rathees", "modi", "india", "indian", "critic", "dhruv", "fan", "video", "videos", "political", "pms", "channel", "rathee", "formidable", "youtube", "million"], "url": "https://www.aljazeera.com/features/2024/5/29/who-is-dhruv-rathee-from-modi-fan-to-indian-pms-most-formidable-critic", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/Screenshot-2024-05-29-at-8.22.35 AM-1-1716960841.jpg?resize=1200%2C630"}, {"news_number": 72, "title": "Toyow Podmasters: India’s largest podcasting extravaganza all set to begin", "summary": "Fever FM, known for backing the best in Bollywood and entertainment, have now come up with an intriguing celebration of India's best podcasters in partnership with HT Smartcast, the podcasting arm of HT Media Ltd.\nThis landmark occasion will unite India’s foremost podcasters, celebrities, experts, and industry leaders to celebrate and elevate the modern audio medium.\nTaking place on May 30th in Mumbai, 'Podmasters Conclave and Awards' will feature 35 award categories, meticulously designed to honor the finest in podcasting.\nUnlock exclusive access to the latest news on India's general elections, only on the HT App.\nThe PodMasters Conclave & Awards is our bold step to elevate Indian podcasting to an international level.", "keywords": ["extravaganza", "ceo", "smartcast", "largest", "podcasters", "awards", "indias", "begin", "yuvaa", "ht", "set", "podcasting", "cofounder", "toyow", "podmasters"], "url": "https://www.hindustantimes.com/entertainment/music/toyow-podmasters-india-s-largest-podcasting-extravaganza-all-set-to-begin-101717054212052.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/30/1600x900/1b3b53cd-7ee3-45b4-87b4-ab7c84577572_1717054269658_1717054298778.jpeg"}, {"news_number": 73, "title": "Amid India Coach Rumours, Gautam Gambhir Breaks Silence On \"Next Mission\", It Has Enough Hint That He'll...", "summary": "Will Gautam Gambhir be the Rahul Dravid's successor in the Indian Cricket team as head coach?\nThat perhaps, is the biggest question in Indian cricket currently.\nSo I think, the next mission is that, if we can make KKR the most successful team in the IPL.\nBut the journey abhi shuru hui hai (the journey has just started),\" Gautam Gambhir said on Sportskeeda.\nThe official deadline for application submission for the post of Indian cricket team coach selection is over.", "keywords": ["gambhir", "coach", "hint", "cricket", "successor", "india", "silence", "kkr", "indian", "bcci", "breaks", "gautam", "mission", "hell", "ipl", "team", "dravids", "rumours"], "url": "https://sports.ndtv.com/ipl-2024/gautam-gambhir-wont-become-india-coach-and-continue-with-kkr-star-says-next-mission-5772757", "imgURL": "https://c.ndtvimg.com/2024-05/82jsloa_shah-rukh-khan-gautam-gambhir_625x300_27_May_24.jpeg?im=FitAndFill,algorithm=dnn,width=1200,height=675"}, {"news_number": 74, "title": "‘No proposal made’: MEA rejects Maldives minister's claim on FTA", "summary": "(With agency inputs)NEW DELHI: The ministry of external affairs (MEA) on Thursday said that no formal proposal for a bilateral free trade agreement (FTA) with the Maldives has been made by the government of India.\nThis follows remarks by Maldives' minister who said that India has shown interest in creating an FTA with the Maldives.MEA spokesperson Randhir Jaiswal said, \"No specific proposal for a bilateral FTA with the Maldives has been made by the government of India.\nIf the government of Maldives expresses interest in having an FTA with India, we will give it due consideration.\nShortly after his inauguration, President Muizzu demanded the withdrawal of Indian military personnel from the Maldives, which was completed earlier this month.Despite the absence of an FTA, the 1981 India-Maldives trade agreement enables the export of essential commodities.\nThe FTA with China has regained momentum since President Muizzu took office, with the current administration expressing readiness to honor the agreement, viewing it as a symbol of strong relations between the Maldives and China.", "keywords": ["maldives", "agreement", "rejects", "fta", "india", "muizzu", "ministers", "china", "bilateral", "claim", "president", "mea", "proposal", "usd", "trade"], "url": "https://timesofindia.indiatimes.com/india/no-proposal-made-mea-rejects-maldives-ministers-claim-on-fta/articleshow/110565585.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110565682,width-1070,height-580,imgsize-851790,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 75, "title": "GCCs see regulatory compliance as key for India expansion: Survey", "summary": "\"81% of respondents mentioned transfer pricing as the top regulatory priority for GCCs in India.\nMore than half of the respondents highlighted SEZ laws and STPI regulations (67%) and labour laws (60%) among key regulatory priorities,\" stated the report titled 'GCCs in India: Building resilience for sustainable growth', to be released today.\n\"India has been quite friendly when it comes to regulatory environment in a lot of places.\nBut I think GCCs have a very complex frameworks and the processes... maybe at certain cases the transfer pricing rates may be on the higher side.\n\"India has around 45% of the global GCC headcount now, so some companies may feel over exposed to India that way...", "keywords": ["india", "respondents", "pricing", "key", "compliance", "data", "survey", "transfer", "laws", "regulatory", "gccs", "expansion", "management", "ghosh"], "url": "https://m.economictimes.com/tech/information-tech/gccs-see-regulatory-compliance-as-key-for-india-expansion-survey/articleshow/110543128.cms", "imgURL": "https://img.etimg.com/thumb/msid-110543144,width-1200,height-630,imgsize-29112,overlay-ettech/photo.jpg"}, {"news_number": 76, "title": "Six officials of Union Bank of India booked in illegal money transfer case", "summary": "A case has been registered against six officials of the Union Bank of India for allegedly fraudulently diverting around ₹94.73 crore of the Karnataka Maharshi Valmiki Scheduled Tribe Development Corporation Ltd to various other bank accounts, police said on Thursday.\nSix officials of Union Bank of India booked in illegal money transfer caseAlso Read - Kannada TV channel's GFX shows anchor in plane cockpit for Prajwal Revanna Germany flight news.\n\"A total of ₹187.33 crore was transferred from various banks and the State Huzur Treasury Khajane-II to our savings Bank account at Union Bank of India, MG Road Branch,\" he said.\n\"Further perusal revealed numerous forged letters, forged cheques, and RTGS requests with fake signatures of the officers and Account Officer, forged/fake board resolution leading to unauthorized disbursements of funds from the organisation's bank account.\n\"Given the blatant illegal acts committed by the top management, bank officials, we request immediate action against A Manimekhalai, MD and CEO, Union Bank of India, Nitesh Ranjan, Ramasubramanium, Sanjay Rudra, Pankaj Dwivedi, the Executive Directors and Suchishitha Raul, the Chief Manager of Union Bank of India, MG Road and other involved parties,\" it added.", "keywords": ["union", "account", "india", "money", "officer", "bank", "case", "transfer", "manager", "officials", "branch", "road", "corporation", "illegal", "booked"], "url": "https://www.hindustantimes.com/cities/bengaluru-news/six-officials-of-union-bank-of-india-booked-in-illegal-money-transfer-case-101717058845892.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/30/1600x900/Police-officials-said-the-boy-called-the-police-em_1717012031103_1717059190028.jpg"}, {"news_number": 77, "title": "Northwest, Central India's temperatures to reduce a tad, but not enough to wave heat a goodbye", "summary": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelThere will be a gradual fall in maximum temperatures by 2-4°C over Northwest and Central India during the next five days, said the India Meteorological Department on Thursday.Parts of northwest and central India have been experiencing heat wave to severe heat wave conditions for weeks, and the temperature in Delhi reached a record high of 52.9 degrees Celsius (127.22°F) in Mungeshpur neighbourhood on Wednesday.Meanwhile, rise in maximum temperatures by 2-3°C is very likely over Maharashtra and south peninsular India during the next three days, as per the Met department.No significant change in maximum temperatures is expected over East India in the next couple of days but a gradual fall by 2-3°C is anticipated thereafter.\n\"A drop in temperature was recorded in several areas yesterday.\nThe maximum temperatures till today can touch 47 degrees Celsius plus at some stations.\nBut overall, there is no scenario for Red Alert ,\" the met department said.Delhi's lieutenant governor on Wednesday directed the government to ensure measures were taken to protect labourers by providing water and shaded areas at construction sites and granting them paid leave from noon to 3 p.m.India classifies a heat wave as a situation where the maximum temperature is 4.5 C to 6.4 C above normal, while a severe heat wave occurs when the maximum is higher than normal by 6.5 degrees or more.", "keywords": ["wave", "india", "indias", "northwest", "days", "heat", "temperature", "severe", "maximum", "degrees", "tad", "central", "temperatures", "subscribe", "reduce", "goodbye"], "url": "https://m.economictimes.com/news/india/northwest-central-indias-temperatures-to-reduce-a-tad-but-not-enough-to-wave-heat-a-goodbye/articleshow/110560362.cms", "imgURL": "https://img.etimg.com/thumb/msid-110560505,width-1200,height-630,imgsize-135328,overlay-economictimes/photo.jpg"}, {"news_number": 78, "title": "2004 Lok Sabha elections: When BJP’s ‘India Shining’ failed to resonate, leading to the UPA era", "summary": "Certain of a hat-trick, Vajpayee dissolved the Lok Sabha on February 6, 2004, six months before the term of the House ended (the polls were originally due in September-October 2004).\nAdvertisementClick here to read other parts of this special series on the history of India’s Lok Sabha electionsAdvani’s Bharat Uday Yatra, launched on March 10, 2004, received a tepid response.\nRahul Gandhi made his debut with this Lok Sabha poll.\nHowever, Advani continued as the Leader of Opposition in the 14th Lok Sabha.\nWhile 85-year-old Vajpayee, a Lok Sabha member till 2009, decided not to fight the 2009 polls on account of his deteriorating health, 81-year-old Advani’s ambitions saw him contest the next Lok Sabha elections, held in April-May 2009, as its prime ministerial candidate.", "keywords": ["leading", "lok", "singh", "india", "shining", "national", "bjp", "era", "party", "resonate", "alliance", "minister", "upa", "elections", "2004", "failed", "vajpayee", "sabha"], "url": "https://indianexpress.com/article/explained/explained-the-ten-years-under-manmohan-singh-9360396/", "imgURL": "https://images.indianexpress.com/2024/05/Manmohan1.jpg"}, {"news_number": 79, "title": "Heat wave alert: Which are the hottest cities in India this summer?", "summary": "Air coolers for sale at a store during high temperatures in New Delhi, India, on Thursday, May 30, 2024.\n(Prakash Singh/Bloomberg)Heat wave swelters North, West IndiaSevere heat wave conditions swept across several states in India, including Punjab, Haryana, Chandigarh, Delhi, Uttar Pradesh, Rajasthan, Bihar, and East Madhya Pradesh.\n| ExplainedHeat wave forecasts: Relief soon, says IMDThe India Meteorological Department forecasts a gradual reduction in the prevailing heat wave conditions, beginning Thursday.\nHeat wave to severe heat wave conditions are expected to diminish gradually over Northwest & Central India from Thursday.\nWhile heat wave conditions very likely in isolated pockets of Madhya Pradesh, Vidarbha, Uttarakhand till May 31, the weather monitoring agency said.", "keywords": ["pradesh", "india", "wave", "conditions", "heavy", "summer", "rajasthan", "delhi", "degrees", "parts", "hottest", "heat", "cities", "alert"], "url": "https://www.hindustantimes.com/india-news/heat-wave-alert-which-are-the-hottest-cities-in-india-this-summer-101717060386521.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/30/1600x900/INDIA-HEAT-20_1717060422076_1717060449611.jpg"}]