{
  "india": [
    {
      "news_number": 0,
      "title": "How India conducted the world's largest election",
      "summary": "India’s mammoth general election drew to a close on June 1.\nAbout 642 million voters cast their ballots in the staggered seven-phase polling over six weeks, the largest election in history.\nThe world’s biggest election involved over one million polling stations spread across the country, from remote corners of the Himalayas to far-flung forests deep in Nagaland.\nInstead of issuing a ballot paper, electors cast their votes by pressing a button next to a candidate’s name and party symbol.\nNearly 1.8 million Voter-Verifiable Paper Audit Trail (VVPAT) systems and 1.7 million control units were deployed for the 2024 elections across 1.05 million polling stations.",
      "url": "https://www.reuters.com/graphics/INDIA-ELECTIONS/gdpzmqgrmvw/",
      "imgURL": "https://www.reuters.com/graphics/INDIA-ELECTIONS/gdpzmqgrmvw/cdn/images/reuters-graphics.jpg"
    },
    {
      "news_number": 1,
      "title": "Canada Calls India '2nd Biggest Threat', Replaces Russia: New Provocation Amid Pro-Khalistani Row",
      "summary": "Canada Calls India '2nd Biggest Threat', Replaces Russia: New Provocation Amid Pro-Khalistani RowCanada sparks controversy as a high-level parliamentary panel names India the 2nd biggest threat to Canadian democracy, replacing Russia.\nThe NSICOP report accuses India of interference in democratic processes, targeting politicians and communities.\nAmid strained India-Canada ties, tensions rose after Trudeau accused India of involvement in Nijjar's death.",
      "url": "https://www.hindustantimes.com/videos/world-news/canada-calls-india-2nd-biggest-threat-replaces-russia-new-provocation-amid-pro-khalistani-row-101717696464817.html",
      "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/06/06/1600x900/hqdefault_1717696461475_1717696488899.jpg"
    },
    {
      "news_number": 2,
      "title": "Will India’s new government turbocharge the fight against poverty?",
      "summary": "W hen it won its independence in 1947, India suffered from appalling poverty.\nCampaigning in rural districts, Jawaharlal Nehru, the country’s first prime minister, had seen the “mark of this beast” on every brow.\n“Life had been crushed and distorted,” he wrote, by “continuous lack and ever-present insecurity”.\nCampaigning in this year’s election, Nehru’s great-grandson, Rahul Gandhi, a leader of the opposition Congress party, also addressed himself to the poor.\nThese “gigantic schemes of fiscal splurge”, as India’s finance minister called them, may help explain why the opposition did better in the election than expected, depriving Narendra Modi, the prime minister, and his Bharatiya Janata Party ( BJP ) of a majority without coalition support.",
      "url": "https://www.economist.com/asia/2024/06/05/will-indias-new-government-turbocharge-the-fight-against-poverty",
      "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240608_ASP002.jpg"
    },
    {
      "news_number": 3,
      "title": "China lodges protest with India over PM Modi's response to Taiwan President Lai's greetings on his poll victory",
      "summary": "BEIJING: China on Thursday protested to India over Prime Minister Narendra Modi's social media statement that he looked forward to having closer ties with Taiwan, insisting that New Delhi should resist Taiwan authorities' \"political calculations.\n\"China views Taiwan as a rebel province that must be reunified with the mainland, even by force.Modi's remarks came in response to a congratulatory message from Taiwan President Lai Ching-te on his election victory.Lai, elected as Taiwan's President last month, in a message posted on X said: “My sincere congratulations to Prime Minister @narendramodi on his election victory.“We look forward to enhancing the fast-growing #Taiwan-#India partnership, expanding our collaboration on trade, technology & other sectors to contribute to peace & prosperity in the #IndoPacific,\" Lai said.In his reply posted on X, Modi said: \"Thank you @ChingteLai for your warm message.\nI look forward to closer ties as we work towards mutually beneficial economic and technological partnership”.Reacting to the messages, Chinese Foreign Ministry spokesperson Mao Ning said China has lodged aprotest with India on this.First of all, there is no President in the Taiwan region, Mao said, when asked for her comments at a media briefing here.“On this question, China opposes all forms of official interactions between Taiwan authorities and countries having diplomatic relations with China,” she said.There is but one China in the world and Taiwan is an inalienable part of the territory of the People's Republic of China, she said.The One China principle is a universally recognised norm in international relations and the prevailing consensus, she said.India has made serious political commitments and should resist Taiwan authorities' political calculations, she said.“China has protested to India about this,\" she said.Lai, 64, was sworn in as President of the estranged island of Taiwan last month after winning the Presidential poll.In his inaugural address on May 20, Taiwan President Lai called on Beijing to cease its intimidation of the self-ruled island after his Democratic Progressive Party (DPP), which has championed democracy in the face of years of growing threats from China, won.",
      "url": "https://timesofindia.indiatimes.com/world/china/china-lodges-protest-with-india-over-pm-modis-response-to-taiwan-president-lais-greetings-on-his-poll-victory/articleshow/110764822.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 4,
      "title": "“Everyone is absolutely terrified”: Inside a US ally’s secret war on its American critics",
      "summary": "An American charity leader who spoke out on Indian human rights violations saw his Indian employees arrested en masse.\nI have heard them say as much to me,” says John Sifton, the Asia advocacy director at Human Rights Watch.\nThe BJP is the RSS’s political wing, and it has worked extensively to bring the Indian state in line with Hindutva principles.\nIndia’s human rights record “is not going to trump security concerns with China.”There is a realpolitik case for this approach.\nThe White House’s silence helps strengthen the taboo on criticizing India’s human rights record in Washington.",
      "url": "https://www.vox.com/world-politics/24160779/inside-indias-secret-campaign-to-threaten-and-harass-americans",
      "imgURL": "https://platform.vox.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/25456991/ChrisBlaza_Vox.jpg?quality=90&strip=all&crop=0,13.393770068673,100,78.534031413613"
    },
    {
      "news_number": 5,
      "title": "Analysis: India wants to be the next economic superpower. Half of its population holds the key",
      "summary": "New Delhi CNN —India, the world’s fastest growing major economy, is not firing on all cylinders.\nThe engineering graduate started working at Finnish electronics manufacturer Salcomp’s factory in the southern Indian state of Tamil Nadu last year.\nAdnan Abidi/ReutersLike India, women in China were also relegated to subordinate roles for centuries.\nFactory jobsMuch of this change is visible in Tamil Nadu, India’s industrial powerhouse where companies such as Foxconn and Samsung have manufacturing plants.\nEmployees test mobile phones on an assembly line of a unit of Foxconn Technology in Sriperumbudur, Tamil Nadu, on July 12, 2019.",
      "url": "https://www.cnn.com/2024/06/05/economy/india-election-economy-challenges-women-intl-hnk/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/ap23094583857628.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 6,
      "title": "India election 2024: How Modi's rivals came back from the brink",
      "summary": "Experts questioned whether it was fit to challenge Mr Modi, who looked unstoppable at the time.\nThe credit for the opposition’s performance, Mr Kidwai says, largely goes to Mr Gandhi, the much criticised scion of the Nehru-Gandhi dynasty.\nIt also gave him confidence and political heft.” But Mr Gandhi was still not perceived as a threat to Mr Modi.\nBut the biggest upset for Mr Modi and the BJP, Mr Bose says, came from the bellwether state of Uttar Pradesh (UP).\nThe BJP’s tally has been restricted to a poor 33.” Mr Modi's party won 62 seats in 2019 and took 71 in 2014.",
      "url": "https://www.bbc.com/news/articles/cp00jze920eo",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/25e4/live/24c80770-2341-11ef-bc00-bfab0688459c.jpg"
    },
    {
      "news_number": 7,
      "title": "CNBC's Inside India newsletter: Modi's loss could be India's gain",
      "summary": "Indian Prime Minister Narendra Modi gestures, at the Bharatiya Janata Party (BJP) headquarters in New Delhi, India, June 4, 2024.\nAdnan Abidi | ReutersThis report is from this week's CNBC's \"Inside India\" newsletter which brings you timely, insightful news and market commentary on the emerging powerhouse and the big businesses behind its meteoric rise.\nFar from rewarding Prime Minister Narendra Modi's party with a supermajority — as polls had predicted — Indians elected 240 BJP lawmakers to India's 543-seat Parliament, which falls short of a simple majority for Modi's party.\nHowever, as the largest party, the BJP will form a coalition government thanks to its alliance with smaller parties ahead of the elections.\nThis \"radical transformation\" is expected to lead to a significantly more efficient economy and help India's currency, according to Sullivan.",
      "url": "https://www.cnbc.com/2024/06/06/cnbcs-inside-india-newsletter-modis-loss-could-be-indias-gain.html",
      "imgURL": "https://image.cnbcfm.com/api/v1/image/107423984-17175175832024-06-04t154937z_2091781776_rc2f48adj852_rtrmadp_0_india-election-modi.jpeg?v=1717517653&w=1920&h=1080"
    },
    {
      "news_number": 8,
      "title": "Narendra Modi’s India",
      "summary": "Despite having led India for a decade, Modi has in some ways kept his country guessing about his vision.\nOn major issues — India’s relationships, its economy, its society and its government — it’s still unclear what sort of country Modi wants India to be.\nIndia has spent recent years deepening its relationship with the United States.\nIt has gotten closer to American allies, including Japan and Australia, and ordered high-end American weapons systems — the kind that create dependence down the road.\nAfter Russia invaded Ukraine, the United States tried in vain to persuade India to take a stand against the war.",
      "url": "https://www.nytimes.com/2024/06/06/briefing/modis-india.html",
      "imgURL": "https://static01.nyt.com/images/2024/06/06/multimedia/06themorning-nl-modi1-kflp/06themorning-nl-modi1-kflp-facebookJumbo.jpg"
    },
    {
      "news_number": 9,
      "title": "'We never stop fighting': Reds' 6-run 9th caps sweep, stellar trip",
      "summary": "“I felt like I had a couple of at-bats earlier in the game that were 'RBI spots' as well and didn’t come through,\" Steer said.\n\"I was pretty pumped up to come through in that situation for the guys.\nI got it about as good as I could get a ball.\nI knew it was gone off the bat.”",
      "url": "https://www.mlb.com/news/spencer-steer-jonathan-india-fuel-reds-sweep-of-rockies",
      "imgURL": "https://img.mlbstatic.com/mlb-images/image/upload/t_2x1/t_w1536/mlb/cvwj3ydbdu2lanfndy08.jpg"
    },
    {
      "news_number": 10,
      "title": "India’s opposition, written off as too weak, makes a stunning comeback to slow Modi’s juggernaut",
      "summary": "It scored a stunning comeback, slowing the Modi juggernaut and pushing his Bharatiya Janata Party well below the majority mark.\nThe opposition won a total of 232 seats out of 543, doubling its strength from the last election.\nGandhi, heir to India’s Nehru-Gandhi dynasty, has long been mocked by Modi, his party and his supporters as a beneficiary of dynastic politics.\nAnd last year he was expelled from Parliament due to a defamation case after Modi’s party accused him of mocking the prime minister’s surname.\nIn the run-up to the election, opposition leaders and parties faced a slew of legal and financial challenges.",
      "url": "https://apnews.com/article/india-election-opposition-modi-0fdadcf9aaa0d80072c3f15b6759969c",
      "imgURL": "https://dims.apnews.com/dims4/default/ffdc057/2147483647/strip/true/crop/7940x4466+252+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fcc%2F5f%2F800f43d699b74a53d91e359f6a90%2F21c760cc93fd428cb923e776d0eb3d63"
    },
    {
      "news_number": 11,
      "title": "T20 World Cup: Fans, experts slam New York pitch after India-Ireland match",
      "summary": "Former players and fans criticise the ICC after New York produces another low-scoring match that left India captain Rohit Sharma injured.\nIndia won the match by eight wickets and Rohit later confirmed his arm was “a little sore”.\n“New ground, new venue, [we] wanted to see what’s it like to play on,” he said after the match.\n“I don’t think the pitch settled down, there was enough there for the bowlers.”Their premier pacer Jasprit Bumrah said he had no complaints about the pitch.\nThe ICC has not reacted to the criticism but is expected to use a new pitch for Sunday’s match.",
      "url": "https://www.aljazeera.com/sports/2024/6/6/t20-world-cup-icc-faces-criticism-on-new-york-pitch-india-ireland-match",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/AP24157591788266-1717605455.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 12,
      "title": "Billionaire-Friendly Modi Humbled by Indians Who Make $4 a Day",
      "summary": "At the start of the year, Narendra Modi hailed the opening of a huge new Hindu temple as a once-in-a-millennium turning point in India’s history.\nThe lavish event, broadcast across the nation, was timed to generate a wave of religious fervor that would carry him in a landslide to a third term as prime minister.\nBut less than five months later, voters in that northern Indian district soundly rejected Modi’s party in national elections, part of a broader wave of discontent with his decade-long rule in relatively poorer parts of the country.\nOnce seen as invincible, Modi and his Hindu-dominant Bharatiya Janata Party are now dependent on allies for the first time since he took power in 2014.",
      "url": "https://www.bloomberg.com/news/features/2024-06-05/india-election-millions-of-poor-stun-narendra-modi-in-setback-for-bjp",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ibArzZdnQdIo/v1/1200x800.jpg"
    },
    {
      "news_number": 13,
      "title": "India’s voters strike a blow to Modi’s Hindu nationalist party - The Washington Post",
      "summary": "But Mr. Modi’s party won only 240 seats, down 63 from five years ago, so it will have to negotiate a coalition to govern.\nThe results map also suggests a return to older patterns of regional voting that Mr. Modi had previously defied.\nBut the vote was in protest of Mr. Modi’s autocratic and divisive ways, too.\nDuring Mr. Modi’s Hindu nationalist rule, India has been racked by mob rule and the lynching and targeting of Muslims and Christians.\nWhile campaigning, Mr. Modi unabashedly vilified Muslims with dark warnings that they were going to somehow steal the nation’s wealth.",
      "url": "https://www.washingtonpost.com/opinions/2024/06/05/voters-india-narendra-modi-election/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GMQ45TBF3QPVZ3PPQXVZ3UD55I.jpg&w=1440"
    },
    {
      "news_number": 14,
      "title": "India lost the manufacturing race to China. Here's why it could still succeed",
      "summary": "India lost the manufacturing race to China.\nThe Ticking Clock For Indian Economic DevelopmentWhile India’s economy has fallen dramatically behind China’s in recent decades, it’s been looking better recently.\nThe current government’s strategy of trying to retrace China and many other countries’ manufacturing-led path to greater riches, Rajan argues, is not working.\n“Today, when India enters, it's not competing with Western countries, it is competing with Bangladesh, Vietnam, and still China,” Rajan says.\nBut, Rajan argues, they should be more flexible and open-minded about the country’s development path.",
      "url": "https://www.npr.org/sections/planet-money/2024/06/04/g-s1-2226/india-election-democracy-china-economy-manufacturing",
      "imgURL": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5472x3078+0+285/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe1%2F59%2Ff0dca676418d95f7c77f923a173d%2Fgettyimages-1006013948.jpg"
    },
    {
      "news_number": 15,
      "title": "Modi 3.0: What India's election means for Australia and the world",
      "summary": "But India’s election is what middle and global powers have been fixated on.\nThis positions Modi as only the second Indian leader to start a third consecutive term, following in the footsteps of India’s first prime minister Jawaharlal Nehru.\nIt also means commitment to a multipolar world of inclusive cooperation and an increasingly strong leader for developing countries.\nAnd the Quad’s focus on a free and open Indo-Pacific will continue to guide India’s multilateral cooperation.\nAnd new initiatives such as BIMSTEC (Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation) highlight India’s broader regional aspirations.",
      "url": "https://www.lowyinstitute.org/the-interpreter/modi-30-what-india-s-election-means-australia-world",
      "imgURL": "https://www.lowyinstitute.org/sites/default/files/2024-06/Modi%20on%20campaign%20trail%20comp.jpg"
    },
    {
      "news_number": 16,
      "title": "Mapping the results of the India election 2024",
      "summary": "This year’s election numbers contrast dramatically with the 2019 results when the BJP-led NDA won 353 seats, 303 of which were secured by the BJP alone.\nMapping election resultsThe map below represents the 543 seats in India’s lower house of parliament.\nThe Congress won only one seat, the Bahujan Samaj Party (BSP) won 10 and the Samajwadi Party (SP) got five.\nThe Congress alone won 13 seats, while the BJP won nine.\nThen, in 2014, Modi and the BJP won a massive mandate to come to power.",
      "url": "https://www.aljazeera.com/news/2024/6/6/mapping-the-results-of-the-india-election-2024",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/INTERACTIVE-india-election-results-map-1717601803.png?resize=1200%2C630"
    },
    {
      "news_number": 17,
      "title": "How a humble Indian fabric became a symbol of luxury in 1960s America",
      "summary": "But this staple of preppy American fashion has humble origins, far from Martha’s Vineyard or the hallways of Yale or Harvard, in Chennai, India, the coastal city from which it takes its name.\nKrishnan Nair,” a biography of the Indian textile magnate and hotelier who first sold Jacobson the madras, in a video interview with CNN.\nFrom Chennai to shores of the CaribbeanFort St. George was established in the 1630s, helping the British cement a monopoly on the highly lucrative Indian textile industry.\nResearch by the London School of Economics estimates that Indian cotton textiles, which were often exchanged for slaves, accounted for 30% of the total export value of 18th century Anglo-African trade.\nA madras fabric weaving workshop in Chennai, the Indian city once known as Madras, circa 1990.",
      "url": "https://www.cnn.com/2024/06/05/style/india-madras-fabric-us-fashion-intl-hnk/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/tcdmame-ec427.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 18,
      "title": "India’s Modi is known for charging hard. After a lackluster election, he may have to adapt his style",
      "summary": "The surprising election results upended widespread expectations before the vote and exit polls that suggested a stronger showing for Modi’s Bharatiya Janata Party.\nIn the end, the party won 240 seats — short of the 272 needed to form the government on its own.\nIt’s not just that Modi will have to adapt to relying on a coalition.\nAt the heart of his governance style has been his penchant for control, critics say, adding that Modi has increasingly centralized power.\n“Modi is Modi.",
      "url": "https://apnews.com/article/india-election-results-2024-lok-sabha-pm-modi-41eadd4a74cd13b5e5b9ceca0d7b2f31",
      "imgURL": "https://dims.apnews.com/dims4/default/6263306/2147483647/strip/true/crop/3614x2033+0+188/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F77%2F5b%2Fdf1cab7ad97a8865625e2426c52e%2Fa48a50eefbeb4795a2b261761327fb09"
    },
    {
      "news_number": 19,
      "title": "India election: Why did Modi’s BJP lose in Uttar Pradesh, its fortress?",
      "summary": "In 2014 and 2019, they made the Bharatiya Janata Party’s fortunes, with Prime Minister Narendra Modi’s party winning 71 and 62 seats in those two elections.\nBut Hakim Sahib, a full-time mendicant and a part-time politician from Meerut, a western Uttar Pradesh (UP) city, wasn’t amused.\nThe regional Samajwadi Party, a member of the Congress Party-led INDIA alliance, won 37 seats.\nFall in Ayodhya, drop in VaranasiIn 1992, the BJP led a campaign that culminated in the demolition of the 16th-century Babri mosque in the UP temple town of Ayodhya.\nMany of the constituencies near Varanasi, which the BJP had hoped to win riding on Modi’s presence in the city, went to the INDIA alliance.",
      "url": "https://www.aljazeera.com/news/2024/6/6/india-election-why-did-modis-bjp-lose-in-uttar-pradesh-its-fortress",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/AP24142477756050-1717651768.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 20,
      "title": "Rahul Gandhi seeks probe into stock market moves during India elections",
      "summary": "Exit poll projections of big wins by Modi’s alliance sent stock markets surging a day before votes were counted.\nOpposition Indian National Congress leader Rahul Gandhi has demanded a parliamentary investigation into sharp stock market moves towards the end of the just-ended national elections, alleging that Prime Minister Narendra Modi gave misleading investment advice.\nModi’s alliance won the vote with a surprisingly slim majority, well below the landslide forecast by the weekend exit polls.\n“We are interested in having a JPC [joint parliamentary committee] to investigate the role of the prime minister, home minister, BJP members,” Gandhi told reporters.\nGandhi’s Congress-led opposition INDIA alliance won 232, higher than projected.",
      "url": "https://www.aljazeera.com/economy/2024/6/6/rahul-gandhi-seeks-probe-into-stock-market-moves-during-india-elections",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2023/09/2023-08-07T075039Z_1763066211_RC2VI2ATXCUW_RTRMADP_3_INDIA-POLITICS-GANDHI-1693593189.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 21,
      "title": "India's Election Results: 5 Surprising Takeaways",
      "summary": "After six long weeks of voting in the grueling heat, India’s election delivered stunning results.\nThat’s because the BJP won only 240 seats this election, effectively losing the single-party majority Modi has enjoyed since he was first elected in 2014.\nHere are some of the most surprising takeaways from India’s 2024 election.\nIn 2014 and 2019, the BJP won 71 and 62 seats respectively that helped fuel the party’s rise to power in Delhi.\nA pre-poll survey predicted that 46% of India's 472 million women voters would opt for the BJP-led alliance in the election.",
      "url": "https://time.com/6985897/indias-election-results-takeaways/",
      "imgURL": "https://api.time.com/wp-content/uploads/2024/06/AP24156253116593.jpg?quality=85&w=1200&h=628&crop=1"
    },
    {
      "news_number": 22,
      "title": "India’s Perilous Border Standoff With China",
      "summary": "He has boosted the country’s participation in the so-called Quad, its security partnership with Australia, Japan, and the United States.\nIndia has long claimed that China is using its alliance with India’s archnemesis, Pakistan, to keep India pinned down in the region.\nModi’s tack toward Washington makes the rivalry between India and China look like a subset of the bigger competition between China and the United States.\nIndia’s closer alignment with the United States might also encourage China to use coercive tactics toward India to send a firm message to the United States and its allies.\nBut getting back to high-level talks with China remains the best bet for both establishing stability on the border and burnishing India’s great-power credentials.",
      "url": "https://www.foreignaffairs.com/india/modi-perilous-border-standoff-china",
      "imgURL": "https://cdn-live.foreignaffairs.com/sites/default/files/styles/social_share/public/images/2024/06/03/2020-09-17T130957Z_1938846055_RC2D0J937N7F_RTRMADP_3_INDIA-CHINA.JPG?itok=JCMKEPXC"
    },
    {
      "news_number": 23,
      "title": "Election-related A.I. deepfakes spread across India's social media",
      "summary": "Almost a billion voters took part in elections just held in India, and the campaign was marked by deepfakes generated by artificial intelligence across India's social media.\nThe A.I.-generated content could be a sign of what's to come in the U.S. NBC News' Janis Mackey Frayer reports.June 4, 2024",
      "url": "https://www.nbcnews.com/nightly-news/video/election-related-a-i-deepfakes-spread-across-india-s-social-media-212261445924",
      "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/mpx/2704722219/2024_06/1717543793168_nn_jma_india_ai_240604_1920x1080-zz7ggt.jpg"
    },
    {
      "news_number": 24,
      "title": "Indian Prime Minister Narendra Modi's election shortfall leaves Wall Street scrambling",
      "summary": "Indian Prime Minister Narendra Modi gestures, at the Bharatiya Janata Party (BJP) headquarters in New Delhi, India, June 4, 2024.\nOver the past several years, chief executives from some of the biggest companies in the United States have invested time and money into relationships with Modi, as they set their sights on the Indian market.\nModi's economic agendaModi's failure to secure a supermajority for his party also raises new questions about the Modi government's broader economic agenda.\nNow, one of the labor laws that Modi's government had intended to reform may not get implemented, because Modi's party, the Bharatiya Janata Party, or BJP, no longer holds an outright majority in Parliament.\nSupporters of the ruling Bharatiya Janta Party (BJP) holding cut-outs of India's Prime Minister a Narendra Modi during an election campaign rally in Amritsar on May 30, 2024.",
      "url": "https://www.cnbc.com/2024/06/05/modi-india-election-wall-street.html",
      "imgURL": "https://image.cnbcfm.com/api/v1/image/107423986-17175175832024-06-04t155152z_51802237_rc2f48akda64_rtrmadp_0_india-election-modi.jpeg?v=1717517653&w=1920&h=1080"
    },
    {
      "news_number": 25,
      "title": "Modi has declared victory in India's election, but not the landslide he expected",
      "summary": "Modi has declared victory in India's election, but not the landslide he expectedtoggle caption Arun Sankar/AFP via Getty ImagesNEW DELHI — Indian Prime Minister Narendra Modi has declared an election victory, as his coalition won more than half of parliamentary seats, with votes still being counted.\nThe INDIA coalition of opposition parties picked up 233 seats, defying exit polls that predicted a much lower tally.\nAt the opposition Congress party office, supporters were cheering and dancing.\nWhen the massive seven-phase election started in April, most analysts had predicted a landslide in favor of Modi and his allies.\nEarlier in the evening, the opposition Congress party said the main opposition had won the seats despite BJP's “capture” of state institutions.",
      "url": "https://www.npr.org/2024/06/04/nx-s1-4991657/india-election-modi-win",
      "imgURL": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3895x2191+0+50/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F97%2F0a%2Fd5505d244e19b3d94005691303ce%2Fgettyimages-2155414989.jpg"
    },
    {
      "news_number": 26,
      "title": "Indians Are Finally Standing Up to Modi’s Politics of Hate - The New York Times",
      "summary": "For weeks, the announcement of India’s election results loomed as a moment of dread for millions of people who cherish the country’s commitment to secular democracy.\nMr. Modi has towered over India since first sweeping to power in 2014.\nHis government, which also included 50 members of Parliament from minor coalition partners, ran roughshod over the opposition.\nThe opposition I.N.D.I.A.\nalliance — formed by the once-dominant Indian National Congress and more than two dozen mostly regional parties — nearly equaled the B.J.P.",
      "url": "https://www.nytimes.com/2024/06/05/opinion/india-election-modi.html",
      "imgURL": "https://static01.nyt.com/images/2024/06/06/multimedia/05mody-NEW-bgml/05mody-NEW-bgml-facebookJumbo.jpg"
    },
    {
      "news_number": 27,
      "title": "T20 World Cup: Eyes on India vs Pakistan as matches in USA fail to fill stadiums due to sky-high rates",
      "summary": "On Tuesday, ICC released additional tickets for some T20 World Cup matches, including the India-Pakistan game, following huge demand from fans.\nAdvertisementIndia’s Hardik Pandya greets fans during an exhibition cricket match between Bangladesh and India at the Nassau County International Cricket Stadium, Saturday, June.\nThe match is a warmup for the T20 Cricket World Cup tournament.\n(AP/PTI) India’s Hardik Pandya greets fans during an exhibition cricket match between Bangladesh and India at the Nassau County International Cricket Stadium, Saturday, June.\nThe match is a warmup for the T20 Cricket World Cup tournament.",
      "url": "https://indianexpress.com/article/sports/cricket/t20-world-cup-2024-india-vs-pakistan-ticket-price-usa-stadiums-9376544/",
      "imgURL": "https://images.indianexpress.com/2024/06/T20-WC-ticket-prices.jpg"
    },
    {
      "news_number": 28,
      "title": "India Reminds the World It Is More Than Modi",
      "summary": "“India cuts Modi down,” blared the headline in my hometown Kolkata’s main newspaper, the Telegraph, after our all-powerful prime minister unexpectedly lost his majority on Tuesday.\nThe opposition alliance, cunningly abbreviated INDIA, advanced to within 40 seats of claiming power in New Delhi.\nModi’s Bharatiya Janata Party will need continued support from several restive regional parties in order to govern.\nIn Kolkata, as in much of India, there was an audible sigh of relief: Voters seem to have forced an end to a decade of single-minded and remote decision-making.\nOthers will, naturally, be dismayed.",
      "url": "https://www.bloomberg.com/opinion/articles/2024-06-05/india-reminds-the-world-it-is-more-than-modi",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i2xldzYBPGBI/v1/1200x757.jpg"
    },
    {
      "news_number": 29,
      "title": "India’s economic boom won’t be derailed by its election shock",
      "summary": "New Delhi CNN —Narendra Modi has declared victory in India’s election but he’ll need the support of smaller parties to govern, a shock result that could make it harder for him to pass major economic reforms.\nExperts have highlighted land reform as an example of policies that might now be tougher for Modi to implement.\nIndia will need to address those issues if it is to capitalize on the massive rethink underway among companies on supply chains.\nDespite the surprise electoral setback for Modi’s right-wing, Hindu-nationalist Bharatiya Janata Party (BJP), experts say the world’s fastest growing major economy will continue to live up to its billing.\nThe party’s underperformance led to a plunge on India’s stock market, which had its worst day in four years Tuesday.",
      "url": "https://www.cnn.com/2024/06/05/business/india-economy-what-next-intl-hnk/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2155420911.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 30,
      "title": "T20 World Cup: India voice New York pitch concerns but ICC stands firm",
      "summary": "There are no plans in place to move any T20 World Cup fixtures out of New York despite growing fears over substandard pitches.\nSerious concerns are mounting over the unpredictable nature of the drop-in surfaces at the Nassau County International Cricket Stadium after the first two fixtures played at the venue.\nOn Monday, Sri Lanka were bowled out by South Africa for 77 – their lowest score in T20s - while India dismissed Ireland for 96 on Wednesday.\nIndia play Pakistan on Sunday at the venue in Eisenhower Park in one of the most eagerly-anticipated fixtures of the tournament with a capacity crowd of 32,000 expected.\nIt is understood an unused pitch has been designated for the India v Pakistan showdown, although there is flexibility to alter that decision depending on how other pitches play before that encounter.",
      "url": "https://www.bbc.com/sport/cricket/articles/ceddyd2yd7jo",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_sport/c646/live/61a278c0-23c2-11ef-924f-b942d815f706.jpg"
    },
    {
      "news_number": 31,
      "title": "A triumph for Indian democracy",
      "summary": "T he world’s biggest electorate has just shown how democracy can rebuke out-of-touch political elites, limit the concentration of power and change a country’s destiny.\nThe result partially derails the Modi project to renew India.\nThis outcome lowers the risk of the country sliding towards autocracy, buttresses it as a pillar of democracy and, if Mr Modi is willing to adapt, opens a new path to reforms that can sustain its rapid development.\nIt lost seats to regional parties in its heartlands in Uttar Pradesh and beyond, reflecting a revival of caste-based politics and, it seems, worries about a lack of jobs.\nWhereas his coalition partners were previously optional extras, he will now rely on them to stay in power.",
      "url": "https://www.economist.com/leaders/2024/06/05/a-triumph-for-indian-democracy",
      "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240608_LDD020.jpg"
    },
    {
      "news_number": 32,
      "title": "India election results: Modi claims victory for alliance",
      "summary": "If these trends hold, it would be a stunning setback to the populist who has never relied on coalition partners to govern.\nModi’s party is still expected to form the government and return as the prime minister for a rare third consecutive term as his National Democratic Alliance was leading in about 290 constituencies — ahead of the 272 seats needed for a majority.\nA coalition would, however, diminish Modi’s power as a strongman leader who won his party landslide victories in 2014 and 2019 elections.\n“This would be truly, you know, uncharted territory, both for Indians as well as for the prime minister,” Vaishnav said.\nSince coming to power in 2014, Modi’s BJP has governed in a coalition government but has always held a majority on its own.",
      "url": "https://apnews.com/live/india-election-results-updates",
      "imgURL": "https://dims.apnews.com/dims4/default/327234e/2147483647/strip/true/crop/4160x2340+0+89/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa4%2Ffa%2F47c580fd45b69e56081106da8490%2Fap24156545355938.jpg"
    },
    {
      "news_number": 33,
      "title": "Indian election delivers stunning setback to Modi and his party",
      "summary": "The shock result sparked feverish celebrations among India’s opposition parties and marked a rare setback for an Indian politician who had never failed to secure a majority in state or national elections over a 23-year political career.\nIn a rare move, television networks typically aligned with the BJP changed the photo accompanying the party logo from Modi to the party president, J.P. Nadda.\nIndian Prime Minister Narendra Modi drew criticism for his comments at an election rally on April 21 in Rajasthan, India.\nSome party members put on a brave face and argued that a competitive election was a good thing.\nA Hindu ascetic clad in saffron robes and a turban, Pandey cut an unusual figure at the headquarters of political party that promoted secularism.",
      "url": "https://www.washingtonpost.com/world/2024/06/04/india-election-results-modi-bjp/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3GVZ6FKM2IT5BLTNVQHGFE45QY.JPG&w=1440"
    },
    {
      "news_number": 34,
      "title": "India’s election shows the world’s largest democracy is still a democracy",
      "summary": "Voters queue up to cast their ballots at a polling station during the seventh and final phase of voting in India’s general election in Dharamsala, India on June 1, 2024.\nResults from the nation’s parliamentary elections — the largest in the world — indicate a shocking electoral setback for Prime Minister Narendra Modi and his Hindu nationalist Bharatiya Janata Party (BJP).\nAt the end of the staggered six-week election, Modi will become only the second Indian prime minister to win a third consecutive term.\nThat’s more than any Indian party won between 1984 and 2009, when Modi first came to power, and in most elections, it would have been an amazing result.\nThe ruling party’s most significant losses came in Uttar Pradesh, India’s most populous state and a longtime BJP bastion.",
      "url": "https://www.vox.com/world-politics/353785/india-election-2024-modi-bjp",
      "imgURL": "https://platform.vox.com/wp-content/uploads/sites/2/2024/06/gettyimages-2154921002.jpg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613"
    },
    {
      "news_number": 35,
      "title": "Why has India’s BJP lost its parliamentary majority?",
      "summary": "India’s Narendra Modi will have to form a coaltion government with other parties in order to secure a majority in parliament.\nNarendra Modi is expected to serve another term as prime minister of India, but with a significantly reduced majority.\nHe will have to partner up with other parties to form the next government.\nHis governing BJP failed to win a clear majority after six-week-long parliamentary elections.\nPresenter: Cyril VanierGuests:Asif Bhamla – BJP spokesman in MaharashtraValay Singh – JournalistRavi Agrawal – Editor-in-chief of Foreign Policy",
      "url": "https://www.aljazeera.com/program/inside-story/2024/6/5/why-has-indias-bjp-lost-its-parliamentary-majority",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/image-1717618742.jpg?resize=1920%2C1080&quality=80"
    },
    {
      "news_number": 36,
      "title": "A shock election result in India humbles Narendra Modi",
      "summary": "Editor’s note (June 5th): This article has been updated with the final election results.\nA HEAD OF THE general election that concluded on June 1st Narendra Modi, India’s prime minister, was expected to romp home.\nHis charisma, combined with an emphasis on infrastructure development, welfare payments to the poorest and a polarising Hindu nationalism, looked unbeatable.\nMr Modi exuded a confidence that matched those predictions.\nHe claimed that his Bharatiya Janata Party ( BJP ) and its allies would win upwards of 400 seats in the 543-seat parliament.",
      "url": "https://www.economist.com/asia/2024/06/04/a-shock-election-result-in-india-humbles-narendra-modi",
      "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240608_ASP502.jpg"
    },
    {
      "news_number": 37,
      "title": "Indian election revives Rahul Gandhi’s fortunes",
      "summary": "Try unlimited accessOnly ₹100 for 4 weeksThen ₹4,335 per month.\nComplete digital access to quality FT journalism on any device.\nCancel anytime during your trial.",
      "url": "https://www.ft.com/content/0db80b37-e770-4e4d-95b1-6bb7b7c9d713",
      "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/ftlogo-v1%3Abrand-ft-logo-square-coloured?source=update-logos&format=svg"
    },
    {
      "news_number": 38,
      "title": "Opinion: I was born into India’s lowest caste. But nothing will stop me from embracing my joy",
      "summary": "Shreeja Rao Sankul SonawaneMy community of Dalit women are doubly oppressed by caste and gender.\nDalit women like me are bound together by a sense of sisterhood woven with each other for as long as anyone can remember, and long before that.\nI think of my mentor, Beena Pallical, who made history by becoming the first Dalit woman to address the UN General Assembly.\nBut these advances have led Dalit women to significant victories and more freedom than ever before in India’s caste-tainted history.\nSeeing the only Dalit woman hockey player score a hat-trick at the Olympics, becoming the first Indian woman to do so.",
      "url": "https://www.cnn.com/2024/06/02/opinions/india-election-dalit-women-caste-joy-rao/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-521099994.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 39,
      "title": "Modi’s Magic Is Fading Fast. Who’s Next for India?",
      "summary": "Whoever becomes India’s next prime minister, the message from voters to financial markets is clear: “We have moved on from Narendra Modi.\nWhen will you?”With more than 90% of votes counted, it is almost certain that Modi’s Hindu right-wing Bharatiya Janata Party will fall short of a majority in the 543-member parliament.\nHowever, the BJP will still return to power with the help of coalition partners, unless there is an even bigger upset.\nAll it will take is a couple of key members of the National Democratic Alliance, or NDA, to switch their allegiance to the opposition INDIA coalition.",
      "url": "https://www.bloomberg.com/opinion/articles/2024-06-04/modi-s-magic-is-fading-fast-who-s-india-s-next-leader",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i1tvxoy95Dns/v1/1200x800.jpg"
    },
    {
      "news_number": 40,
      "title": "Pollster brought to tears on air over error in election results",
      "summary": "How relevant is this ad to you?\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues",
      "url": "https://www.cnn.com/videos/world/2024/06/05/pollster-sobs-polling-error-india-election-modi-lead-digvid.cnn",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/240604212459-pollster-india-election-vpx.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 41,
      "title": "India election 2024: Why Modi failed to win outright majority",
      "summary": "Mr Modi's harsh and divisive campaign, particularly targeting Muslims, could also have alienated voters in some regions.\nMr Modi’s party faced its largest setback in Uttar Pradesh (UP), a state larger than the United Kingdom and three times as populous.\nA dent of Brand Modi Mr Modi’s popularity has been also attributed to his mastery of branding, transforming routine events into spectacles and astute messaging.\nThe election results show that Brand Modi has lost some of its shine, indicating that even Mr Modi is susceptible to anti-incumbency.\nWhat worked for India's Modi and what didn’t?",
      "url": "https://www.bbc.com/news/articles/c977g8gl5q2o",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/9ecd/live/0a859a00-22a9-11ef-baa7-25d483663b8e.jpg"
    }
  ],
  "health": [
    {
      "news_number": 0,
      "title": "Supreme Court sides with Native American tribes in health care funding dispute with government",
      "summary": "WASHINGTON (AP) — The Supreme Court sided with Native American tribes Thursday in a dispute with the federal government over the cost of health care when tribes run programs in their own communities.\nThe 5-4 decision means the government will cover millions in overhead costs that two tribes faced when they took over running their health care programs under a law meant to give Native Americans more local control.\nPaying those costs for all tribes that run their own health care programs could total between $800 million and $2 billion per year, the agency said.\nHealth care spending per person by the IHS is just one-third of federal spending in the rest of the country, the Northern Arapaho Tribe in Wyoming said in court documents.\nThe majority of federally recognized tribes now contract with IHS to run at least part of their own health care programming.",
      "url": "https://apnews.com/article/native-american-tribes-healthcare-indian-health-service-2b13ca21d150ab3ee1d85c966f387d54",
      "imgURL": "https://dims.apnews.com/dims4/default/7688d2d/2147483647/strip/true/crop/4839x2722+0+252/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F78%2Fd0%2F1c171d4b9937522faae1864ecd23%2Fc065fadf04d14d869aa1d1b2a119f605"
    },
    {
      "news_number": 1,
      "title": "How to reduce health care’s climate impact? Increase telehealth",
      "summary": "How to reduce health care’s climate impact?\nA growing number of health care providers see the climate crisis as a health crisis.\nUntil the pandemic, oncology was presumed to require in-person tests and procedures that would minimize the ability to employ telemedicine.\nBut the natural experiment of the pandemic proved that parts of oncology care could be done closer to home and remotely.\nHealth care providers have been debating the pros and cons of telehealth, whether it improves access or exacerbates health care disparities, he said.",
      "url": "https://www.npr.org/sections/shots-health-news/2024/06/06/nx-s1-4992986/health-care-climate-impact-carbon-telehealth",
      "imgURL": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2120x1193+0+111/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe5%2Ff9%2Fccc3635f4e888b6b18b17a1ec44c%2Fgettyimages-2000452401.jpg"
    },
    {
      "news_number": 2,
      "title": "Mpox public health campaign was successful but cases still occur at low levels in US: Study",
      "summary": "Mpox public health campaign was successful but cases still occur at low levels in US: StudyIn summer 2022, the global mpox outbreak seemed poised to overwhelm the U.S. with cases rising exponentially every week and no signs of slowing.\nA successful public health campaign -- promoting behavior changes and vaccination -- helped cases drop dramatically.\nHowever, a new small study published Thursday and led by the University of California, Los Angeles (UCLA) says that mpox cases are still circulating at low levels in the U.S. and primarily among unvaccinated high-risk groups.\nThe mpox patients had also engaged in sex with one or more partners they met through smartphone dating apps, the study found.\nNo mpox cases were identified in other groups, including women, children or unhoused individuals.",
      "url": "https://abcnews.go.com/Health/mpox-public-health-campaign-successful-cases-occur-low/story?id=110891706",
      "imgURL": "https://i.abcnewsfe.com/a/aa689187-551f-4249-b455-d1ae5b81a058/monkeypox-gty-jef-240329_1711753421466_hpMain_16x9.jpg?w=1600"
    },
    {
      "news_number": 3,
      "title": "Health Sensors Market to Poised to Generate Revenue of USD 65.3 Billion by 2032 | Astute Analytica",
      "summary": "Get a Free Sample Copy: https://www.astuteanalytica.com/request-sample/health-sensors-marketPrime health sensors include wearable sensors (such as smartwatches and fitness trackers), implantable sensors, digestible sensors, smartphone sensors, and environmental sensors.\nThe health sensors market is driven by the need for continuous health monitoring, data tracking, and effective emergency care.\nThe wearable health sensors market is projected to expand from US$ 11.41 billion in 2024 to US$ 26 billion by 2032.\nNorth America is World’s Capital in Health Sensors Market, Rake in Over 36.5% of Global RevenueNorth America, particularly the United States and Canada, leads the global market in the consumption of health sensors due to various compelling factors.\nBy 2023, it is projected that 50% of all digital health users in North America health sensors market will be using mobile health monitoring apps regularly.",
      "url": "https://finance.yahoo.com/news/health-sensors-market-poised-generate-173000380.html",
      "imgURL": "https://media.zenfs.com/en/globenewswire.com/c69505cf1983c21fb029b9444d820471"
    },
    {
      "news_number": 4,
      "title": "Mental Health on College Campuses: Challenges and Solutions",
      "summary": "It can feel especially daunting for students who face mental health challenges, which for many were heightened by the coronavirus pandemic.\nCampuses are facing what many experts call a mental health crisis.\nFor example, 70% of students said they have struggled with mental health since starting college, according to a recent U.S. News/Generation Lab report, which surveyed 3,649 college students in March 2024.\nPer the report, only 37% of respondents searched for mental health resources at their college.\nOf students who participated in the U.S. News/Generation Lab poll and indicated they wanted mental health support, 77% were successfully connected to mental health care.",
      "url": "https://www.usnews.com/news/education-news/articles/mental-health-on-college-campuses-challenges-and-solutions",
      "imgURL": "https://www.usnews.com/dims4/USNEWS/e255d6c/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2F19%2F96%2F81a259ff4d29ae300db95975f605%2Fus-news-equity-conference-colleges-mh-2024jun05-3.jpg"
    },
    {
      "news_number": 5,
      "title": "The Popular Sugar Substitute Xylitol Could Have Some Major Heart-Health Risks",
      "summary": "Losing weight is one the best ways to lower your risk of heart disease, and cutting back on sugar can contribute to that.\nBut sweeteners that mimic the taste of sugar with fewer—or no—calories could be increasing, rather than decreasing, the risk of some heart events.\nThe study included more than 3,000 people in the U.S. and Europe, about half of whom had a history of heart disease, and almost all of whom had at least a few risk factors for heart disease.\nHazen says xylitol should be considered similar to cholesterol when it comes to heart disease.\nBut consuming more xylitol as a sugar substitute in food or drinks could be increasing any baseline risk people already have for clotting in the blood.",
      "url": "https://time.com/6985904/xylitol-heart-health-risks/",
      "imgURL": "https://api.time.com/wp-content/uploads/2024/06/GettyImages-660706480.jpg?quality=85&w=1200&h=628&crop=1"
    },
    {
      "news_number": 6,
      "title": "Extreme heat and weather threaten health at nearly every stage of life, WHO says",
      "summary": "“While awareness of climate change has increased, actions to safeguard the lives of those at most risk has barely scratched the surface of what’s needed.\nFor climate justice to be achieved, this must be urgently redressed.”Aggressive and impactful reporting on climate change, the environment, health and science.\n“It is time for policy action and financing to consider the specific needs of [maternal and newborn health] in climate change hazards,” the study says.\nBut pregnancy and birth aren’t the only stages of life affected by climate change.\nMore than a third of people displaced internationally in 2022 due to climate change were children.",
      "url": "https://www.latimes.com/environment/story/2024-06-06/worsening-heat-waves-threaten-health-at-most-stages-of-life",
      "imgURL": "https://ca-times.brightspotcdn.com/dims4/default/3a0bfcf/2147483647/strip/true/crop/3900x2048+0+276/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd3%2F68%2Fe75092ca4efb9f555bc40e84ef78%2F1324580-me-weather-feature-06-ajs.jpg"
    },
    {
      "news_number": 7,
      "title": "First-of-its-kind Youth Mental Health Corps trains young people to help their peers",
      "summary": "It was there that Santiago, reflecting on her own experiences, began thinking about young people and mental health.\nHow do I create a way for these kids to get help?”Now Santiago has helped create the Youth Mental Health Corps, a first-of-its-kind initiative that will launch this fall, initially in four states, to address the country’s youth mental health crisis.\nSurgeon General Vivek Murthy calls youth mental health “the defining public health issue of our time.”Michael D. Smith, AmeriCorps CEO, said that he was thrilled to be launching the Youth Mental Health Corps on the 30th anniversary of President Clinton swearing in the first class of Americorps members in 1994.\nStudies have shown that young Latinos living in states with anti-immigrant policies were linked to higher odds of chronic mental health conditions.\nA young person helps youth with stressors 'similar to the ones I faced'Nelly Grosso is a college junior in Denver who is part of Youth Mental Health Corps inaugural class.",
      "url": "https://www.nbcnews.com/news/latino/youth-mental-health-corps-rcna155574",
      "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240605-youth-corp-mental-health-se-1212p-b28902.jpg"
    },
    {
      "news_number": 8,
      "title": "Moringa: Benefits, Nutrition, and Risks",
      "summary": "Moringa (Moringa oleifera)—also referred to as the drumstick, horseradish, or ben oil tree—is a medicinal and nutrient-rich plant native to India.\nThe moringa plant has grown in popularity in the United States as a leaf powder, supplement, and skincare ingredient.\nMoringa as a SupplementYou can find the moringa plant in capsule, tablet, or powdered form.\nTips for Consuming MoringaThe moringa plant has an earthy flavor that can be delicious in sweet or savory dishes.\nHere are some options for adding moringa to your diet:Add moringa powder to soups and stewsBlend moringa powder into oatmeal or smoothiesEat moringa pods when they’re immature for a tender textureUse moringa powder in your favorite pasta recipeMake tea with moringa leavesA Quick ReviewMoringa trees have become popular for their various health benefits.",
      "url": "https://www.health.com/moringa-benefits-8648504",
      "imgURL": "https://www.health.com/thmb/zp2LBkZ_Y_KZQ1PLsNffnLLPn-k=/6016x0/filters:no_upscale():max_bytes(150000):strip_icc()/Health-GettyImages-900224332-3196ce4c87804bbd85357a8e130b7c45.jpg"
    },
    {
      "news_number": 9,
      "title": "Modern Medicine Can Do a Better Job Addressing Maternal Mental Health Disorders",
      "summary": "While this is often a joyous time, it can sometime lead to mental health disorders, most often anxiety and depression.\nBy investigating them in detail, he and Dr. Osborne hope, over the long term, to help turn medicine’s track record around.\nSpying on Immune Cell CommunicationDr. Osborne’s research on the first of these potential culprits has pointed toward the possibility of pre-empting postpartum depression.\nShifts in hormone levels are the second likely candidate Dr. Osborne and Dr. Power are pursuing.\nLike that research, the studies he and Dr. Osborne are conducting could — one day — make similar advancements possible.",
      "url": "https://news.weill.cornell.edu/news/2024/06/modern-medicine-can-do-a-better-job-addressing-maternal-mental-health-disorders",
      "imgURL": "https://news.weill.cornell.edu/sites/all/themes/newsroom/favicon.ico"
    },
    {
      "news_number": 10,
      "title": "Rabies",
      "summary": "Dog bites and scratches cause 99% of the human rabies cases, and can be prevented through dog vaccination and bite prevention.\nPEP consists of thorough wound washing, administration of a course of human rabies vaccine and, when indicated, rabies immunoglobulins (RIG).\nRabies from sources other than dogsIn the Americas, where dog-mediated rabies is mostly controlled, hematophagous (blood-feeding) bats are now the primary source of human rabies.\nA well performed wound risk assessment and PEP protocol consists of:extensive wound washing with water and soap for at least 15 minutes soon after an exposure;a course of rabies vaccine; andadministration of rabies immunoglobulin or monoclonal antibodies into the wound, if indicated.\nThis entails:improving access to human rabies vaccines through the efforts of the WHO and its partners, Gavi, the Vaccine Alliance, which had included human rabies vaccines in its Vaccine Investment Strategy for 2021–2025.",
      "url": "https://www.who.int/news-room/fact-sheets/detail/rabies",
      "imgURL": "https://www.who.int/images/default-source/departments/ntd-library/rabies/namibia-2022/namibia-utilises-one-health-for-rabies-control-2.tmb-1200v.jpg?Culture=en&sfvrsn=31c9878d_6"
    },
    {
      "news_number": 11,
      "title": "Early detection of dementia with default-mode network effective connectivity",
      "summary": "Study designThis was a nested case-control study designed to assess whether DMN effective connectivity can be used predict two outcomes of interest.\nFunctional connectivity analysisWe estimated functional connectivity matrices for each participant to compare predictions based on effective connectivity to an alternative rs-fMRI metric.\nModifiable risk factors analysisWe investigated which modifiable risk factors were associated with dementia-related changes in DMN effective connectivity using multiple multivariable linear regression models.\nThe effective connectivity index is simply the probability of dementia outputted from the case-control classifier trained with leave-one-out cross-validation.\nA higher value here indicates that the participant’s overall effective connectivity pattern conforms more to a dementia-like phenotype than a control-like phenotype.",
      "url": "https://www.nature.com/articles/s44220-024-00259-5",
      "imgURL": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs44220-024-00259-5/MediaObjects/44220_2024_259_Fig1_HTML.png"
    },
    {
      "news_number": 12,
      "title": "NYC Health + Hospitals Announces Comprehensive Three-Year Plan to Enhance Its Behavioral Health Services",
      "summary": "NYC Health + Hospitals Announces Comprehensive Three-Year Plan to Enhance Its Behavioral Health ServicesThe Behavioral Health Blueprint outlines six strategies to restore and maximize inpatient capacity; expand access to outpatient services; increase services to special populations; enhance social work, care management, and peer services; prevent violence and increase safety; and build the behavioral health workforce New York State’s Behavioral Health Centers of Excellence program will fund in part the transformation with $41M to rebuild, develop, and enhance core acute and outpatient behavioral health services NYC Health + Hospitals is the largest provider of behavioral health services in New York CityJun 06, 2024NYC Health + Hospitals today announced a comprehensive three-year plan to strengthen and expand its behavioral health services in a new report, Behavioral Health Blueprint: Turning Crisis into Opportunity.\n“NYC Health + Hospitals stands as a leader in providing behavioral health care, already serving more than 76,000 patients a year for mental health and substance use needs.\nI would like to thank NYC Health + Hospitals for joining this effort by developing an ambitious plan to guide their behavioral health care services into the future.”“This blueprint and bold investment show once again that excellence in behavioral health is core to NYC Health + Hospital’s mission,” said NYC Health + Hospitals President and CEO Mitchell Katz, MD.\nNYC Health + Hospitals will continue:Renovating behavioral health inpatient units.\nStrategy 6: Develop the Health System’s WorkforceIn light of a nationwide shortage of behavioral health staff, NYC Health + Hospitals will invest in programs to recruit, train and retain the staff critical to the operations of New York City’s largest behavioral health provider.",
      "url": "https://www.nychealthandhospitals.org/pressrelease/nyc-health-hospitals-announces-comprehensive-three-year-plan-to-enhance-its-behavioral-health-services/",
      "imgURL": "https://hhinternet.blob.core.windows.net/uploads/2024/06/nyc-health-hospitals-announces-comprehensive-three-year-plan-to-enhance-its-behavioral-health-services-feature.jpg"
    },
    {
      "news_number": 13,
      "title": "Supreme Court sides with Native American tribes in health care funding dispute with government",
      "summary": "The Supreme Court is siding with Native American tribes who said they faced increased costs after taking over management of their own health care programs from the federal governmentWASHINGTON -- The Supreme Court sided with Native American tribes Thursday in a dispute with the federal government over the cost of health care when tribes run programs in their own communities.\nThe 5-4 decision means the government will cover millions in overhead costs that two tribes faced when they took over running their health care programs under a law meant to give Native Americans more local control.\nThe Department of Health and Human Services had argued it isn't responsible for the overhead costs associated with billing insurance companies, Medicare and Medicaid.\nPaying those costs for all tribes that run their own health care programs could total between $800 million and $2 billion per year, the agency said.\nThe majority of federally recognized tribes now contract with IHS to run at least part of their own health care programming.",
      "url": "https://abcnews.go.com/US/wireStory/supreme-court-sides-native-american-tribes-health-care-110897465",
      "imgURL": "https://i.abcnewsfe.com/a/9d7518e2-8092-4030-93cd-8d08b673444d/wirestory_2b13ca21d150ab3ee1d85c966f387d54_16x9.jpg?w=1600"
    },
    {
      "news_number": 14,
      "title": "Charlottesville Radio Group Radiothon Raises More Than $82,000 for UVA Health Children’s",
      "summary": "The Battle Building at UVA Health Children's.\nAs part of the 2024 UVA Health Children's Week of Giving, the Cares for Kids Radiothon raised $82,091 through five radio stations that broadcast inspiring stories from UVA patients’ families, child life specialists and hospital leaders.\nWeek of Giving sponsors included the Children’s Hospital Advisory Board, Dairy Market, Crutchfield, Flow Automotive, Children’s Dentistry of Charlottesville, Hunter Wyant Insurance, The Forum Hotel, Birch & Bloom, Rent-A-Center, Shenanigans and Wegmans.\nThis year’s overall UVA Health Children’s Week of Giving fundraising total – which includes the proceeds from the radiothon as well as an online fundraiser – was $110,734.\n“We are so thankful for the 250 donations, 29 volunteers, patients, families and UVA Health team members who made it all possible,” Chandler said.",
      "url": "https://newsroom.uvahealth.com/2024/06/06/charlottesville-radio-group-radiothon-raises-more-than-82000-uva-health-childrens/",
      "imgURL": "https://newsroom.uvahealth.com/wp-content/uploads/2020/02/ChildrensHospitalBattleBuilding5.jpg"
    },
    {
      "news_number": 15,
      "title": "ECU Health Medical Center celebrates 2024 Project SEARCH graduates",
      "summary": "The Project SEARCH program at ECU Health Medical Center began in 2015 through partnerships with Pitt County Schools, RHA Health Services and the North Carolina Division of Vocational Rehabilitation Services.\nStudents complete internships in various departments at the hospital, including the ECHO Lab, Endoscopy Center, Environmental Services, SurgiCenter, hospital cafeterias, Hospitality and the Neuroscience Intermediate Unit.\n“Project SEARCH gives our students support to transition into the workforce through skills development and a customized job search in the second half of the program,” said Katie Houmard, Project SEARCH instructor.\nProject SEARCH has proven results with a 65 percent employment and 90 percent retention rate nationally.\nProject SEARCH is now an international program with over 716 program sites in 48 states and 11 countries.",
      "url": "https://www.ecuhealth.org/ecu-health-medical-center-celebrates-2024-project-search-graduates/",
      "imgURL": "https://www.ecuhealth.org/wp-content/uploads/2024/06/ProjectSearchGraduation-2024.jpg"
    },
    {
      "news_number": 16,
      "title": "Global and Community Health Professor Ali Weinstein elected to the Society for Health Psychology Executive Committee",
      "summary": "BodyAli Weinstein, professor of Global and Community Health and Senior Scholar in the Center for Advancement and Well-Being.\nPhoto by Emma Anderson/College of Public Health“I have a good working understanding of the Society and I understand the importance of service from membership in order to keep it going strong,” Weinstein said.\n“It was an honor to be elected by my peers for this position.”Weinstein has always been involved with SfHP, considering it one of her “home” professional organizations as a health psychologist.\nLast year, she received the Barbara A. Keeton Volunteer of the Year Award in recognition of her service to SfHP.\nThe Member-at-Large position is a three-year term that will begin after the APA conference in early August 2024.",
      "url": "https://publichealth.gmu.edu/news/2024-06/global-and-community-health-professor-ali-weinstein-elected-society-health-psychology",
      "imgURL": "https://publichealth.gmu.edu/sites/g/files/yyqcgq286/files/styles/large/public/2024-06/ali_weinstein_thumbnail.jpg?itok=TPrfxLbQ"
    },
    {
      "news_number": 17,
      "title": "Israel strikes U.N-run school in Gaza; a Georgia clinic cares for the uninsured",
      "summary": "Israel strikes U.N-run school in Gaza; a Georgia clinic cares for the uninsuredGood morning.\nThe Good Samaritan clinic in Gwinnett County, Georgia is dedicated to caring for the uninsured.\nFor many patients at Good Samaritan, it may be the first time they've ever seen a doctor.\nChief Financial Officer Greg Lang says he wants to see the U.S. move away from insurance-based health care.\n🎧 Listen to why Lang thinks health care should be a private transaction between provider and patient, and hear from a Good Samaritan nurse about the personal impact she makes at the clinic.",
      "url": "https://www.npr.org/2024/06/06/g-s1-3133/up-first-newsletter-israel-gaza-un-school-airstrike-insurance-health-care",
      "imgURL": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6720x3780+0+428/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fcf%2F73%2Ff5a1e843484b896ee1b85fcee401%2Fap24158296516406.jpg"
    },
    {
      "news_number": 18,
      "title": "2024) – District Health Department 10",
      "summary": "Several studies have confirmed that separation from nature is detrimental to human development, health and wellbeing, and that regular contact with nature is required for good mental health.\nFamily Health & Fitness Day, 06/08/2024Every year, on the second Saturday of June, the NRPA promotes Family Health & Fitness Day.\nTake a walk to visit your local park or trail – something as simple as a daily walk can help you live a healthier life.\n– something as simple as a daily walk can help you live a healthier life.\nQuick LinksNRPA | Family Health & Fitness Day is June 08, 2024",
      "url": "https://www.dhd10.org/family-health-and-fitness-day-6-8-2024/",
      "imgURL": "https://www.dhd10.org/wp-content/themes/glacial/images/dhd_favicon.png"
    },
    {
      "news_number": 19,
      "title": "Supreme Court Rules For Tribes Aiming to Recoup Health Costs (1)",
      "summary": "The Supreme Court ruled against the Biden administration on how to divvy up a limited pot of money for tribal health care.\nThe 5-4 ruling written by Chief Justice John Roberts on Thursday said tribes can sue the federal government to recoup certain administrative expenses associated with running their own health care programs.\nThe law allows tribes to run their own health care programs using money the Indian Health Service would otherwise tap to provide the same care.\nThe question for the justices was whether the government also had to reimburse administrative costs associated with third-party payers like Medicare, Medicaid, and private insurers.\nDivert FundingThe dissent, however, said the court’s decision upends the government’s “long-settled understanding” that tribes must pay for these costs.",
      "url": "https://news.bloomberglaw.com/us-law-week/supreme-court-rules-for-tribes-seeking-to-recoup-health-costs",
      "imgURL": "https://db0ip7zd23b50.cloudfront.net/dims4/default/26c8e12/2147483647/legacy_thumbnail/1920x740%3E/quality/90/?url=http%3A%2F%2Fbloomberg-bna-brightspot.s3.amazonaws.com%2F46%2F0d%2F651b27b64d22924b3b8898a28a62%2Fsupreme-court-photographer-anna-moneymaker-bloomberg.jpg"
    },
    {
      "news_number": 20,
      "title": "Biden-Harris Administration Expands Access to Mental Health and Substance Use Services with Addition of 10 New States to CCBHC Medicaid Demonstration Program",
      "summary": "The CCBHC Medicaid Demonstration Program provides states with sustainable funding that helps them expand access to mental health and substance use services, supporting President Biden’s Unity Agenda and the Biden-Harris Administration’s efforts to tackle the country’s mental health and addiction crises.\n“Certified Community Behavioral Health Clinics serve anyone who requests care for mental health or substance use conditions.\n“For our communities to thrive, behavioral health, including mental health, needs to be prioritized,” said CMS Administrator Chiquita Brooks-LaSure.\nCCBHCs were created to transform mental health and substance use treatment across the country and provide sustainable funding for robust community outpatient mental health treatment.\nTo learn how to get support for mental health, drug or alcohol issues, visit FindSupport.gov.",
      "url": "https://www.hhs.gov/about/news/2024/06/04/biden-harris-administration-expands-access-mental-health-substance-use-services-addition-10-new-states-ccbhc-medicaid-demonstration-program.html",
      "imgURL": "https://www.hhs.gov/sites/default/files/styles/og_image_style/public/news_release.png?itok=7Yn3VSO9"
    },
    {
      "news_number": 21,
      "title": "News Flash • BOC pass resolution sending Mental Health and P",
      "summary": "",
      "url": "https://www.washtenaw.org/CivicAlerts.aspx?AID=2750",
      "imgURL": "https://www.washtenaw.org/ImageRepository/Document?documentID=36199"
    },
    {
      "news_number": 22,
      "title": "Watch: Prince William replies to D-Day vet's question about Kate's health",
      "summary": "Kate, the Princess of Wales, is feeling “better,” Prince William said Wednesday, as his wife continues her cancer treatment out of the public eye.\nWilliam was speaking to a veteran at a D-Day anniversary event in the English city of Portsmouth.June 6, 2024",
      "url": "https://www.nbcnews.com/video/prince-william-replies-to-d-day-vet-about-kate-s-health-212397125529",
      "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/mpx/2704722219/2024_06/williamddayUK_POOL-ntdygq.jpg"
    },
    {
      "news_number": 23,
      "title": "Unexpected health diagnosis inspires woman to create bakery",
      "summary": "CINCINNATI (WXIX) - An unexpected health diagnosis forced a woman to change her diet, but it inspired her to start a business.\nJessica Stern-Enzi started Beyond Grain Bakery six years ago after she was diagnosed with diabetes and an autoimmune thyroid disease.\nWhile doing so, she discovered a need in the market - an allergy-friendly bakery.\n“[It] started out as a keto bakery,” explains Stern-Enzi.\nI try to bake as naturally as possible.”Stern-Enzi says making changes to her diet and opening a new bakery was challenging.",
      "url": "https://www.fox19.com/2024/06/06/unexpected-health-diagnosis-inspires-woman-create-bakery/",
      "imgURL": "https://gray-wxix-prod.cdn.arcpublishing.com/resizer/v2/VOYNA67XAJEGHJOAJWF337TON4.jpg?auth=7494975a044837c913b545111361dfe6327051b8a1e18f1cf3a8bdb3991f652f&width=1200&height=600&smart=true"
    },
    {
      "news_number": 24,
      "title": "14th meeting of the European Environment and Health Task Force",
      "summary": "Members of the European Environment and Health Task Force (EHTF) will convene for its 14th meeting, hosted by the National Institute for Public Health and the Environment (RIVM) in Utrecht.\nThe 2-day event will review the progress achieved since the Seventh Ministerial Conference on Environment and Health, held in Budapest, Hungary in 2023.\nWithin the Budapest Declaration, the “Roadmap for healthier people, a thriving planet and a sustainable future 2023–2030” guides countries in accelerating the transitions needed towards making communities sustainable.\nIt serves as an instrument for Member States to provide policy direction in the field of environment and health within the Region.\nThe EHTF meets annually in the period between Ministerial Conferences on Environment and Health.",
      "url": "https://www.who.int/europe/news-room/events/item/2024/06/26/default-calendar/14th-meeting-of-the-european-environment-and-health-task-force",
      "imgURL": "https://cdn.who.int/media/images/librariesprovider2/default-album/events/moment-from-the-7th-ministerial-conference-on-environment---20183441.tmb-1200v.jpg?sfvrsn=a37f360c_1"
    },
    {
      "news_number": 25,
      "title": "Study Finds Home Health Aides Struggle with Mental Health",
      "summary": "Home health aides (HHAs) are vulnerable to stress, isolation and depressive symptoms, which impact their own health as well as their patients’ desire to age in place, according to Weill Cornell Medicine researchers.\nThe researchers also explored the participants’ attitudes toward mental health and well-being which can carry stigma due to personal and cultural factors.\nHome health care also has the added benefit of lower cost than institutionalized care.\nThe new study outlines ways to address the challenges faced by HHAs through improving salaries and benefits and interventions that support mental health.\nOrganized peer coaching, for instance, could help train and support aides, and enhance workplace safety and healthy behavior.",
      "url": "https://news.weill.cornell.edu/news/2024/06/study-finds-home-health-aides-struggle-with-mental-health",
      "imgURL": "https://news.weill.cornell.edu/sites/all/themes/newsroom/favicon.ico"
    },
    {
      "news_number": 26,
      "title": "Mr José Luis Castro appointed as WHO Director-General Special Envoy for Chronic Respiratory Diseases",
      "summary": "The World Health Organization (WHO) is pleased to announce the appointment of Mr José Luis Castro as WHO Director-General Special Envoy for Chronic Respiratory Diseases.\nChronic respiratory diseases (CRD), including asthma and chronic obstructive pulmonary disease (COPD), affect nearly half a billion people worldwide.\n\"With his profound expertise and longstanding commitment to improving global health, Mr Castro is uniquely positioned to support our efforts in tackling chronic respiratory diseases.\n\"I am deeply honored to serve as the WHO Director-General Special Envoy for CRD,\" said Mr José Luis Castro.\nHe joins other notable Special Envoys such as Sir Liam Donaldson, WHO Director-General Special Envoy for Patient Safety, and Dr Vanessa Kerry, WHO Director-General Special Envoy for Climate Change and Health.",
      "url": "https://www.who.int/news/item/06-06-2024-mr-jose-luis-castro-appointed-as-who-director-general-special-envoy-for-chronic-respiratory-diseases",
      "imgURL": "https://cdn.who.int/media/images/default-source/people/who-people/mr-jose-castro.tmb-1200v.jpg?sfvrsn=e9a5953d_1"
    },
    {
      "news_number": 27,
      "title": "UW Health: Nurses piloting generative AI",
      "summary": "MADISON, Wis. (UW HEALTH PRESS RELEASE) - A growing group of nurses at UW Health are trialing the use of generative artificial intelligence, AI, to determine how it can be used to address health care workforce shortages and burnout, and improve the care experience for patients.\nIn September, the first cohort of nurses began using the draft messages in response to patient messages in MyChart.\nAs AI continues to evolve rapidly and spread across industries, UW Health nurses have stepped up to help shape how AI can be used to benefit patients, nursing and the health care industry as a whole, according to Rudy Jackson, chief nurse executive, UW Health.\nThe ambulatory residency program began in 2021 and the inpatient program began in 2004.\nSince that program began, the first-year retention rate at UW Health for nurses has been 97%.",
      "url": "https://www.weau.com/2024/06/06/uw-health-nurses-piloting-generative-ai/",
      "imgURL": "https://gray-weau-prod.cdn.arcpublishing.com/resizer/v2/G5UPSC5NZBGNJHMYFLCXXDPYXI.jpg?auth=8e7e124a507d157d36baed36bdb59aaf9468fde6c1d583ab6377eabe6c530bb0&width=1200&height=600&smart=true"
    },
    {
      "news_number": 28,
      "title": "Prince William gives update on Kate Middleton's health amid cancer treatment",
      "summary": "Prince William shared an update on Kate Middleton's health this week, nearly three months after Kate announced she had been diagnosed with cancer.\nAccording to Kensington Palace, Kate started a course of preventative chemotherapy in late February.\nPrince William, Prince of Wales and Catherine, Princess of Wales arrive for their visit to SportsAid at Bisham Abbey National Sports Centre to mark World Mental Health Day on Oct. 12, 2023 in Marlow, England.\nBritain's Prince William, the Prince of Wales speaks, during the Government of Canada ceremony to mark the 80th anniversary of D-Day, at Juno Beach, in Courseulles-sur-Mer, Normandy, France, June 6, 2024.\nThe palace has not disclosed publicly what type of cancer Charles was diagnosed with or what type of treatment he is undergoing.",
      "url": "https://abcnews.go.com/GMA/Culture/prince-william-kate-middleton-amid-cancer-treatment/story?id=110896174",
      "imgURL": "https://i.abcnewsfe.com/a/52f119cb-ea89-4062-bda7-ec143ad549f6/kate-will-file-gty-ml-240606_1717681551667_hpMain_16x9.jpg?w=1600"
    },
    {
      "news_number": 29,
      "title": "Governor Hochul Announces Agreement With Kaleida Health and Brooks-TLC Health Systems to Build New Hospital in Chautauqua County",
      "summary": "New York State Health Commissioner Dr. James McDonald said, “Today’s announcement is a reflection of Governor Hochul’s commitment to delivering first-class, equitable, and accessible health care in New York State.\nAnd passion from everyone in Northern Chautauqua County who worked so hard to see this day come to fruition.\nIn closing, I want to say thank you to Governor Hochul.\nGovernor Kathy Hochul's announcement of the collaboration between Kaleida Health and Brooks-TLC Health Systems to construct a new hospital in the Village of Fredonia signifies a monumental victory for Chautauqua County.\nI extend profound gratitude to Governor Hochul, as well as to Kaleida and Brooks-TLC for their steadfast dedication to advancing healthcare excellence in our county.”Dunkirk Mayor Kate Wdowiasz said, “Thank you Governor Hochul, your faith in our community is a gift.",
      "url": "https://www.governor.ny.gov/news/governor-hochul-announces-agreement-kaleida-health-and-brooks-tlc-health-systems-build-new",
      "imgURL": "https://www.governor.ny.gov/sites/default/files/styles/cover_image_660x400_/public/2024-06/brooks-hospital_hero-01.jpg?h=81f9c8fc&itok=HIWuoipk"
    },
    {
      "news_number": 30,
      "title": "Singer Halsey 'lucky to be alive' after health struggles",
      "summary": "Halsey 'lucky to be alive' after health struggles2 days ago Riyah Collins , BBC Newsbeat ShareGetty Images Halsey hinted she was receiving treatment for leukamia and lupus in an Instagram postGrammy-nominated singer Halsey says she's \"lucky to be alive\" after struggling with her health.\nIn a series of photos and videos, she's seen in hospital and saying she feels \"like an old lady\".\n\"Long story short, I’m lucky to be alive,\" she wrote in the caption, where she also announced her new album.\nHalsey shared the health update while announcing her fifth studio album and releasing its lead single, The End.\nIn it, she sings about how \"every couple of years now, the doctor says I'm sick\".",
      "url": "https://www.bbc.com/news/articles/cyrrpylp8ego",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/baad/live/6c854cf0-2317-11ef-96c3-99f9322e70a9.jpg"
    },
    {
      "news_number": 31,
      "title": "New president of CHI Health St. Elizabeth announced",
      "summary": "(KOLN) - CHI Health announced the new president of the St. Elizabeth Hospital on Thursday.\n“For nearly five years of my career with CHI Health, St. Elizabeth has felt like home to me.\nI’m eager and grateful for the opportunity to continue our mission of providing exceptional care to our patients and community.”DeJong was announced as the interim president of St. Elizabeth in January this year and has been with CHI Health since 2011.\nHe started as a financial counselor, and most recently working as the vice president of operational finance for CHI Health Nebraska Heart and St. Elizabeth.\nHe is involved in the Lincoln community, as he serves on the board for several organizations including the Lincoln Chamber of Commerce and the Community Health Endowment.",
      "url": "https://www.1011now.com/2024/06/06/new-president-chi-health-st-elizabeth-announced/",
      "imgURL": "https://gray-koln-prod.cdn.arcpublishing.com/resizer/v2/RHZPHQMMWBDM5GODZLXZHZJMLQ.jpg?auth=e4326f5b87e7408c00095a0b56c24393ad01abc14406b4fe93db9d7244baae72&width=1200&height=600&smart=true"
    },
    {
      "news_number": 32,
      "title": "OhioHealth and The Health Plan Extend Coverage for Southeastern Ohio",
      "summary": "Southeastern Medical Center_17-1OhioHealth Southeastern Medical Center has reached an agreement with The Health Plan, bringing back in-network coverage for Medicare Advantage and Commercial members.\nThe agreement extends coverage for The Health Plan members to all OhioHealth facilities and OhioHealth Physician Group providers and clinics.\nThe agreement addressed the transition that occurred when The Health Plan moved out of network after Superior Med became OhioHealth Physician Group earlier this year.\nWhile this change initially affected The Health Plan's coverage, OhioHealth Southeastern Medical Center remained in-network throughout.\nWith OhioHealth’s network now accessible to The Health Plan members, individuals can benefit from a variety of medical services within their community.",
      "url": "https://newsroom.ohiohealth.com/ohiohealth-and-the-health-plan-extend-coverage-for-southeastern-ohio/",
      "imgURL": "https://content.presspage.com/uploads/1460/a0c603e6-de9a-4670-a30d-20aa0334be57/1920_southeasternmedicalcenter-17-1.jpg?10000"
    },
    {
      "news_number": 33,
      "title": "Wyden concerned about ‘unacceptable’ conditions at Roseburg VA Health System • Oregon Capital Chronicle",
      "summary": "The Roseburg VA Health Care System failed to evaluate more than half of the veterans under its care for suicide risk when they needed it, a recent federal report has found.\nThe Roseburg veterans system provides primary and specialty medical care to about 40,000 veterans in Douglas, Lane, Coos and Curry counties in Oregon and northern California through its main medical center and clinics.\nThe Roseburg VA Medical Center campus has 32 buildings on a 200-acre campus, and the system operates clinics in Brookings, Eugene and North Bend.\nSandra Kidd, a spokesperson with the Roseburg system, said officials take the report seriously.\n“We will continue to work together to serve our veterans and meet their health care needs,” Kidd said.",
      "url": "https://oregoncapitalchronicle.com/2024/06/06/wyden-concerned-about-unacceptable-conditions-at-roseburg-va-health-system/",
      "imgURL": "https://oregoncapitalchronicle.com/wp-content/uploads/2024/03/Ron-Wyden.jpg"
    },
    {
      "news_number": 34,
      "title": "What are the health care issues that voters are focused on?",
      "summary": "What are the health care issues that voters are focused on?\nA MARTÍNEZ, HOST:All this week, we're focused on health care as part of our We, The Voters, series.\nMARTÍNEZ: How does health care then overlap with other issues that voters believe are important to them?\nMARTÍNEZ: President Biden has tried to use the Inflation Reduction Act to address health care costs, but Gabriel, do voters recognize it?\nAnd the fact that, you know, the Inflation Reduction Act doesn't scream health care or reduction of health care costs.",
      "url": "https://www.npr.org/2024/06/06/nx-s1-4983097/what-are-the-health-care-issues-that-voters-are-focused-on",
      "imgURL": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
    },
    {
      "news_number": 35,
      "title": "A visit to a clinic in Georgia that provides health care only to the uninsured",
      "summary": "A visit to a clinic in Georgia that provides health care only to the uninsuredA MARTÍNEZ, HOST:How do you get health care if you don't have insurance?\nIt still means millions of people without coverage, though, something we wanted to explore as part of our \"We, The Voters\" series focusing on health care.\nWe're met at the Good Samaritan Clinic by Greg Lang.\nLANG: I often describe our health care system as being in a sister-wife marriage because there's always three people in bed.\nYou have your health care provider, you have your patient, and you have your insurance company.",
      "url": "https://www.npr.org/2024/06/06/nx-s1-4985057/a-visit-to-a-clinic-in-georgia-that-provides-health-care-only-to-the-uninsured",
      "imgURL": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
    },
    {
      "news_number": 36,
      "title": "Human Resources offers ongoing free mental health webinars throughout 2024",
      "summary": "UNIVERSITY PARK, Pa. — As part of Penn State’s ongoing efforts to promote mental health among its employees, the University is offering additional free seminars and access to an online mental health “fitness studio.”“Mental health is so vitally important to our overall well-being and impacts our lives in both big and small ways.\nWe as Penn State want to provide our valued employees the tools and opportunities for them to maintain and improve their mental health,” said Jennifer Wilkes, vice president for Human Resources and chief human resources officer.\nJust like daily workouts that benefit physical health, exercising your mind is essential for overall well-being.\nThrough SupportLinc, Mindstream is free to use for full-time benefits-eligible employees.\nSessions range from three to 20 minutes to fit into your daily life with a focus on mental health, personal development, work-life balance and leadership skills.",
      "url": "https://www.psu.edu/news/human-resources/story/human-resources-offers-ongoing-free-mental-health-webinars-throughout-2024/",
      "imgURL": "https://psu-gatsby-files-prod.s3.amazonaws.com/s3fs-public/styles/16_9_1000w/public/2024/06/photo.jpg?h=2aaf7c94&itok=UZf_u2k6"
    },
    {
      "news_number": 37,
      "title": "Seventy-seventh World Health Assembly",
      "summary": "The Seventy-seventh World Health Assembly is being held in Geneva, Switzerland, on 27 May – 1 June 2024.\nThe theme of this year’s Health Assembly is: All for Health, Health for All.\nProceedings will be webcast live from this web page.\nSimultaneous interpretation will be available in Arabic, Chinese, English, French, Russian and Spanish.",
      "url": "https://www.who.int/about/accountability/governance/world-health-assembly/seventy-seventh",
      "imgURL": "https://cdn.who.int/media/images/default-source/world-health-assembly/wha76/20230530_wha_closing_ceremony_pal20476.tmb-1200v.jpg?sfvrsn=3b65859b_2"
    },
    {
      "news_number": 38,
      "title": "The Truth About Prebiotic Sodas",
      "summary": "The sodas come in fun flavors like Cherry Vanilla and Orange Cream, and carry an alluring claim: They’re good for your gut.\nThat pitch has helped prebiotic soft drink brands like Poppi and Olipop stand out in the soda aisle.\n(Probiotic products, by comparison, contain live microbes themselves.)\nBut nutrition experts say you don’t need a special soda to reap those benefits: Many foods, like garlic, onions, peas, beans, lentils, grains and some fruits, are naturally rich in prebiotic fibers.\n“If you eat a high fiber diet, you’re taking care of your prebiotics pretty well,” said Marion Nestle, an emeritus professor of nutrition, food studies and public health at New York University.",
      "url": "https://www.nytimes.com/2024/06/06/well/prebiotic-soda-poppi-olipop.html",
      "imgURL": "https://static01.nyt.com/images/2024/06/05/multimedia/05WELL-POPPI1-zgct/05WELL-POPPI1-zgct-facebookJumbo.jpg"
    },
    {
      "news_number": 39,
      "title": "Better maternity leave, child care, health: This new group advocates for moms",
      "summary": "And they also will have information they can take back to their employers, such as how to access tax breaks for child care.\nBut when the pandemic hit, a lack of child care and issues like her patients being unable to mask made it impossible to continue that work.\nNow she has her own business, but she still needs child care.\nFind out more about the Chamber of MothersYou can find out more about the national organization and the Tampa Bay chapter at chamberofmothers.com/local-chapters.\nThere is also a Facebook group started for the Chamber of Mothers Tampa Bay chapter.",
      "url": "https://www.tampabay.com/life-culture/kids-family/2024/06/06/chamber-of-mothers-tampa-women-working-mom-child-care/",
      "imgURL": "https://www.tampabay.com/resizer/8vj5S2S7zPwITR9rnI9fC0S2yh0=/1200x675/smart/cloudfront-us-east-1.images.arcpublishing.com/tbt/C6HTPOQDYFAA5FEZW3NI3OYAEY.jpg"
    },
    {
      "news_number": 40,
      "title": "In funding crisis, Denver Health Medical Center wants voters to approve a sales tax",
      "summary": "Sales tax requested by Denver Health Medical Center to help with funding crisisSales tax requested by Denver Health Medical Center to help with funding crisisSales tax requested by Denver Health Medical Center to help with funding crisisTimes have been getting tougher and tougher in health care.\nLynne went before a Denver City Council committee Wednesday to ask them to advance a ballot question to Denver voters requesting a sales tax hike.\nA hospital tax would add to that as well as two others under consideration for referral to voters.\n\"Combined the three that we're looking at, Denver Health and these other two would raise the city's sales tax in Denver to 9.65%.\nBut that, too, he realizes is a tough sell to Denver metro area voters, even though Denver Health treats those brought in from outside the area, including at its lauded Level One Trauma Center.",
      "url": "https://www.cbsnews.com/colorado/news/denver-health-medical-center-wants-voters-approve-sales-tax-funding-crisis/",
      "imgURL": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/06/06/7c9a04db-005a-4c84-a2a8-be24562156d4/thumbnail/1200x630/e106f6d5f0665e9720b720c1133b5169/denver-health-1.jpg?v=94cbb61397dbf7eca3740fa55510ba88"
    },
    {
      "news_number": 41,
      "title": "UAMS, ACH Pediatric Mental Health Program Presents School-Based Mental Health Symposium on July 31",
      "summary": "View Larger ImageUAMS, ACH Pediatric Mental Health Program Presents School-Based Mental Health Symposium on July 31By Yavonda ChaseThe University of Arkansas for Medical Sciences (UAMS) and Arkansas Children’s Hospital are partnering to improve access to mental health education and resources in pediatric primary care settings and schools.\nThe ARMAPP team of psychiatrists and psychologists provides education and consultations on mental health conditions for both pediatric primary care providers and school-based personnel across Arkansas.\nABOUT ARKANSAS CHILDREN’SArkansas Children’s is the only health system in the state solely dedicated to caring for Arkansas’ nearly 700,000 children.\nArkansas Children’s Northwest (ACNW), the first and only pediatric hospital in the northwest Arkansas region, is a level IV pediatric trauma center.\nUAMS includes UAMS Health, a statewide health system that encompasses all of UAMS’ clinical enterprise.",
      "url": "https://news.uams.edu/2024/06/06/uams-ach-pediatric-mental-health-program-presents-school-based-mental-health-symposium-on-july-31/",
      "imgURL": "https://news.uams.edu/wp-content/uploads/2024/06/GettyImages-1761561252-scaled.jpg"
    },
    {
      "news_number": 42,
      "title": "Many Americans Are Using Marijuana to Manage Health Issues",
      "summary": "By Ernie Mundell HealthDay ReporterHealthDayTHURSDAY, June 6, 2024 (HealthDay News) -- One in six patients serviced by a major California health care system said they used marijuana regularly, with many citing health reasons for doing so, a new study finds.\nIn the study, Gelberg's team looked at the medical records of almost 176,000 patients enrolled in the UCLA Health system.\nThe researchers found that about 30,000 (17%) of the patients said they had used marijuana at least once over the prior three months.\nWhen asked why they used the drug, a large majority (76%) said they used it to help manage health issues.\nMost people who said they used marijuana recreationally say they also used it sometimes to manage a health symptom.",
      "url": "https://www.usnews.com/news/health-news/articles/2024-06-06/many-americans-are-using-marijuana-to-manage-health-issues",
      "imgURL": "https://www.usnews.com/static/images/favicon.ico"
    },
    {
      "news_number": 43,
      "title": "New app You Flourish launches in Colorado to support LGBTQ+ mental health",
      "summary": "COLORADO SPRINGS, Colo. (KKTV) -During Pride Month, the new You Flourish app is making strides in supporting the LGBTQ+ community by addressing prevalent mental health issues such as depression, stress, and substance abuse.\nStudies show that LGBTQ+ individuals are twice as likely to face such challenges compared to other demographics.\nWith $845,000 allocated, the You Flourish app is now available for free to Colorado residents.\nThe app connects members to mental health and healthcare professionals who are affirming of LGBTQ+ identities and offers a space for users to connect with peers facing similar challenges.\nMental health experts including the founder emphasizes the urgency of accessible care for the LGBTQ+ community, noting the increased risk of mental health issues and suicide.",
      "url": "https://www.kktv.com/2024/06/06/new-app-you-flourish-launches-colorado-support-lgbtq-mental-health/",
      "imgURL": "https://gray-kktv-prod.cdn.arcpublishing.com/resizer/v2/2ANITVHHABBUXGFVCDODOXZGDA.png?auth=1ae231d690a242ea3e8dfb0ea4df09c66c018ed9ef05103d140bee402cd281ef&width=1200&height=600&smart=true"
    },
    {
      "news_number": 44,
      "title": "Board awards health care contract over objection of losing bidder",
      "summary": "The Board of Public Works unanimously approved a $724 million contract for pretrial detention medical and mental health services Wednesday over the objections of a troubled incumbent.\nIt also put the board in a difficult position of having to decide the fate of a contract as the losing bidder appeals to the Maryland State Board of Contract Appeals.\nThe company appealed those denials to the Maryland State Board of Contract Appeals.\nBut Joseph W. Sedtal, deputy secretary of administration for the Department of Public Safety and Correctional Services, urged the board to approve the contract despite the contract appeals, citing the “immediate needs” of the agency.\nThe contract awarded Wednesday to Centurion is on top of a $1.7 billion contract the company was awarded to handle health care for the state’s prison system.",
      "url": "https://marylandmatters.org/2024/06/05/board-awards-health-care-contract-over-objection-of-losing-bidder/",
      "imgURL": "https://marylandmatters.org/wp-content/uploads/2024/06/DSC_0131-scaled.jpeg"
    },
    {
      "news_number": 45,
      "title": "Dover Health Acquires Chicago-Area Hospice, Home Health Agencies",
      "summary": "St. Louis-based Dover Health has expanded into the Chicago region with the purchase of Centered Care Hospice and Palliative Care and Cornerstone Home Health.\n“Our mission is to help every senior and their family thrive through personalized, holistic health and wellness.”AdvertisementDover Health is a subsidiary of the senior living and health care services operator The Dover Companies, which launched the home health and hospice business in March.\nIts parent organization also operates senior living, pharmacy, development, independent living, personal care, assisted living and memory care businesses, among others.\nThe Dover Companies’ other brands include Cedarhurst Senior Living, Medicine Express Long-Term Care Pharmacy, Dover Development, Dover Capital and Brahms Construction.\nThe company’s growth plans are focused on Midwestern markets, Brandy Pratt, vice president of hospice for Dover Health, told Hospice News in an email when the company launched.",
      "url": "https://hospicenews.com/2024/06/06/dover-health-acquires-chicago-area-hospice-home-health-agencies/",
      "imgURL": "https://hospicenews.com/wp-content/uploads/sites/6/2024/06/pexels-chaitaastic-1797195.jpg"
    },
    {
      "news_number": 46,
      "title": "1st fatal human case of bird flu subtype confirmed in Mexico: WHO",
      "summary": "The World Health Organization confirmed on Wednesday the first-ever fatal case of a subtype of bird flu in Mexico.\nIt is the first laboratory-confirmed human case of the H5N2 strain of bird flu, or avian influenza, reported globally and the first-ever reported case in Mexico.\nThis strain is different than the bird flu strain that is currently circulating in livestock in the United States and has infected three dairy workers in the U.S.\nFabrice Coffrini/AFP via Getty Images, FILEThe patient's relatives said the person had underlying conditions and they had been bedridden for three weeks for other reasons prior to contracting bird flu, the WHO said.\nTest results eventually revealed the patient was infected with bird flu subtype H5N2, which has never been documented in humans before.",
      "url": "https://abcnews.go.com/Health/1st-fatal-human-case-bird-flu-subtype-confirmed/story?id=110875384",
      "imgURL": "https://i.abcnewsfe.com/a/23e41af5-ae17-4c15-b06c-f700e4623341/who-gty-er-230403_1680550243801_hpMain_16x9.jpg?w=1600"
    },
    {
      "news_number": 47,
      "title": "Sanford report details pledge to patients, communities",
      "summary": "Sanford Health is dedicated to ensuring high-quality care is accessible to all patients, regardless of where they live, health challenges or other barriers to care.\nTwo-thirds of the patients Sanford Health serves live in rural areas where many face unique challenges.\nSanford Health is committed to supporting our patients, residents and communities in ways that extend beyond the walls of our clinics, hospitals and facilities,” said Bill Gassen, president and CEO of Sanford Health.\nCommunity OutreachIn 2022, Sanford Health provided significant financial support to over 500 nonprofit organizations serving communities across its footprint.\nHere for good., Leadership in Health Care, News, People & Culture, Research, Rural Health, Sanford Stories, Virtual Care",
      "url": "https://news.sanfordhealth.org/news/sanford-report-details-pledge-to-patients-communities/",
      "imgURL": "https://news.sanfordhealth.org/wp-content/uploads/2021/10/019073-01522P-Sanford-Center-Exterior-at-Night-800x600-1-scaled-e1634050687932.jpg"
    }
  ],
  "sports": [
    {
      "news_number": 0,
      "title": "Opinion: I just don’t get watching organized sports",
      "summary": "It’s usually these professional sport high holidays where I’m cornered into admitting I’m sports agnostic.\nThe winning and losing of watching professional sports is a faux drama, a soap opera with injuries.\nThe difference is, of course, that the wins and losses of politics don’t benignly reset at the start of the next season.\nIt’s the watching, and caring about, professional sports as an adult that eludes my understanding.\nForgetting who he was talking to, he began his explanation by comparing his home team to another professional underdog team.",
      "url": "https://www.cnn.com/2024/06/06/us/watching-sports-fan-nba-finals-ijdgi-cec/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/20240605-nba-organized-sports-ijdgi.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 1,
      "title": "Meet Jeffrey Kessler, the attorney who has the NCAA on the ropes after latest win vs. powerful sports leagues",
      "summary": "\"As long as my clients don't think I'm a pain in the butt – I feel that's my audience,\" Kessler told CBS Sports.\nWe know this because as lead attorney in the House case, Kessler won the big one.\n\"He's a powerhouse,\" said former Clemson cornerback Martin Jenkins, a lead plaintiff in a previous Kessler case that led to this moment, \"an absolute powerhouse.\nHuma had already recruited Jenkins to be the lead plaintiff in what became the landmark Jenkins vs. NCAA case.\nA Supreme Court stacked by a Republican administration traditionally unfriendly to labor made one of the most labor-friendly decisions in history.",
      "url": "https://www.cbssports.com/college-football/news/meet-jeffrey-kessler-the-attorney-who-has-the-ncaa-on-the-ropes-after-latest-win-vs-powerful-sports-leagues/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/05/f04c63f4-11ea-4863-a178-2adc10f809aa/thumbnail/1200x675/2d7e925155dd8ff1c50805e313c2491f/gettyimages-478218372-1.jpg"
    },
    {
      "news_number": 2,
      "title": "NBC Sports Chicago is closing. What that means for NBC Sports Philadelphia.",
      "summary": "AdvertisementWith no remaining TV rights with any local teams, NBC Sports Chicago will sunset in the fall once the White Sox season is over, leaving NBC with just four regional sports networks — NBC Sports Philadelphia, NBC Sports Bay Area, NBC Sports Boston, and NBC Sports California.\nNo immediate changes are expected at NBC Sports Philadelphia because of what’s happening in Chicago, thanks to some major differences between the networks.\nThe Phillies are amid a 25-year, $2.5 billion deal that will keep their games on NBC Sports Philadelphia through 2041.\nBefore a 2017 rebranding, NBC Sports Philadelphia was known as Comcast SportsNet, which was launched in Philadelphia on Oct. 1, 1997.\nStill no way to stream NBC Sports Philadelphia directlyThe only way to watch Phillies, Sixers, and Flyers games on NBC Sports Philadelphia is to subscribe to a service that carries the network.",
      "url": "https://www.inquirer.com/phillies/nbc-sports-philadelphia-phillies-future-nbc-sports-chicago-tv-20240605.html",
      "imgURL": "https://www.inquirer.com/resizer/NF4G9V713SpQx-ELl44Rh2_iZ9I=/760x507/smart/filters:format(webp)/cloudfront-us-east-1.images.arcpublishing.com/pmn/2HMVL6247NDVXDGX2OBJHB72QU.jpg"
    },
    {
      "news_number": 3,
      "title": "Male sports media disgraces itself in attempts to cover Caitlin Clark's rookie WNBA season",
      "summary": "If your numbers drop off early in your rookie season, that's not a cause to panic.\nBut male-dominated mainstream media outlets tasked with covering a historic WNBA season, in which Clark is a central character, face a similarly steep learning curve.\nMonday's Pat McAfee Show opened with a Caitlin Clark PowerPoint:<br><br>\"I would like the media people that continue to say, 'This rookie class, this rookie class, this rookie class'.\n\"I would like the media people who continue to say 'This rookie class, this rookie class, this rookie class...' Nah, just call it what it is,\" he said .\nAnd taken together, all these stunts threaten to suck the fun out of a historic WNBA season.",
      "url": "https://www.cbc.ca/sports/basketball/opinion-morgan-campbell-caitlin-clark-1.7226154",
      "imgURL": "https://i.cbc.ca/1.7226166.1717674611!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/storm-fever-basketball.jpg"
    },
    {
      "news_number": 4,
      "title": "MLB announces sports betting suspensions for 5 players",
      "summary": "The Pirates issued the following statement following MLB's announcement: “We are extremely disappointed in Tucupita’s actions and are fully supportive of Major League Baseball’s ruling.\nThe Pirates, along with MLB, the Players Association, and every Club, work to ensure all involved within our game are aware of the rules and policies around gambling.\nWhile the thorough investigation revealed no evidence of any games being compromised, influenced, or manipulated in any way in this case, protecting the integrity of our game is paramount.\"",
      "url": "https://www.mlb.com/news/mlb-announces-sports-betting-violation-suspensions",
      "imgURL": "https://img.mlbstatic.com/mlb-images/image/private/t_2x1/t_w1536/mlb/iye2prrosfomkdvbzuvx.jpg"
    },
    {
      "news_number": 5,
      "title": "Proposed NC bill could reshape sports schedules for UNC system schools",
      "summary": "GREENVILLE, N.C. (WITN) - Sports rivals always draw big crowds, and House Bill 965 could put those games on the schedule more frequently.\n“I feel like the community really comes together when we play rivals.\nA bill filed Tuesday by Republican lawmakers would require NC State and UNC Chapel Hill to play either ECU, Appalachian State, or UNCC at least twice every six years, with one game at home and one away.\nAn official from the House said this could encourage larger schools to play smaller NC universities, boosting the economic impact on those communities.\nThe proposed bill must still clear two House committees before a floor vote is held.",
      "url": "https://www.witn.com/2024/06/05/proposed-nc-bill-could-reshape-sports-schedules-unc-system-schools/",
      "imgURL": "https://gray-witn-prod.cdn.arcpublishing.com/resizer/v2/VRNEQMYFFFAE5HB4YCQ3VWYCGI.jpg?auth=5aa3c3a71f174f639e7d0ff8b1ac5a28c851fe4158208163efa2db95ab2d2669&width=1200&height=600&smart=true"
    },
    {
      "news_number": 6,
      "title": "These 5 College Athletes Are Shaking Up Women’s Sports",
      "summary": "Women’s sports — especially women’s college athletics — are achieving new heights thanks to extraordinary athletes like Caitlin Clark.\nIn fact, this year’s women’s NCAA championship, which featured Clark’s University of Iowa team facing off against the South Carolina Gamecocks, drew a larger television audience than the men’s championship.\nClark also became the all-time NCAA Division I leading scorer this past season, across both men’s and women’s basketball.\nIn collaboration with Us Weekly and PlayBooked, Brand Innovators proudly announces the formation of the All American Creator Team, a groundbreaking initiative designed to honor exceptional female college athletes who excel not only in their athletic achievements but also in brand partnerships and social media influence.\nKeep scrolling to learn more about the All American Creator 1st Team: five college athletes who are shaking up women’s sports, both in their athleticism and social media skills.",
      "url": "https://www.usmagazine.com/entertainment/pictures/these-5-college-athletes-are-shaking-up-womens-sports/",
      "imgURL": "https://www.usmagazine.com/wp-content/uploads/2024/05/These-5-College-Athletes-Are-Shaking-Up-Women-s-Sports-On-and-Off-the-Field-GettyImages-1477641911-jadajpg-251.jpg?crop=0px%2C68px%2C2000px%2C1051px&resize=1200%2C630&quality=86&strip=all"
    },
    {
      "news_number": 7,
      "title": "The fiercest political clash in sports",
      "summary": "“It started to take a mental toll.”Story continues below advertisement Advertisement Story continues below advertisement AdvertisementSo she did what athletes do.\nThe level of indignation is disproportionate to the minuscule number of known trans athletes at all levels of sport.\nScience remains inconclusive about the extent to which transgender women have physiological advantages over cisgender women.\nStory continues below advertisement Advertisement Story continues below advertisement AdvertisementFor as much as she dislikes the tactic, Jules Gill-Peterson cannot think of a more brilliant political strategy.\nStory continues below advertisement Advertisement Story continues below advertisement Advertisement“We’re every stripe of the rainbow, essentially,” Miller said.",
      "url": "https://www.washingtonpost.com/sports/interactive/2024/transgender-sports-debate-politics/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YBEJGNNEIZDJPLT6P2GFGD3AOY.jpg&w=1200"
    },
    {
      "news_number": 8,
      "title": "Best in Georgia high schools: AJC's high school athletes of the year",
      "summary": "She also won state titles in the long jump and triple jump at the Class 3A track meet this spring.\nHe is a two-time wrestling individual state champion and won a track state title in the 400 meters as a freshman.\nThe two-time all-state player was fifth in the area tournament, which his team won by seven strokes.\nIt was the first riflery title, team or individual, in school history.\nHe helped lead the Panthers to their second consecutive team title and second in school history.",
      "url": "https://www.ajc.com/sports/high-school/the-ajc-athletes-of-the-year-for-high-school-sports/Q265DVBK35D5HPZOY7J6OZLLVU/",
      "imgURL": "https://www.ajc.com/resizer/imKY3Rtut8bAnLTlvkbFoto1Q48=/1200x630/cloudfront-us-east-1.images.arcpublishing.com/ajc/7GRWCXSDQGPSTBIDVPE2GM55MA.JPG"
    },
    {
      "news_number": 9,
      "title": "Women better at sport during period, study suggests",
      "summary": "Women better at sport during period, study suggests1 day ago Aurelia Foster , Health reporter, BBC News ShareGetty Images Sports injuries could be linked with fluctuating hormones during the menstrual cycle, researchers saySportswomen make fewer mistakes and have quicker reactions when they are on their period, a study suggests.\nIt could explain why women playing contact sports appear injury prone in their luteal phase, between ovulation and menstruation, University College London researchers say.\nDuring the luteal phase, women experience: a drop in oestrogen, which stimulates parts of the brain.\n\"We wondered if injuries could be a result of a change in athletes’ timing of movements throughout the cycle,\" Dr Ronca told BBC News.\nAnd she hoped the study would mean women playing contact sports could adapt their game plan around their menstrual cycle.",
      "url": "https://www.bbc.com/news/articles/cl446z20mvjo",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/0aae/live/162c92f0-233a-11ef-94ce-2524c2e905df.jpg"
    },
    {
      "news_number": 10,
      "title": "Batting Around: Who's the best closer in MLB? A's flamethrower Mason Miller challenges veterans",
      "summary": "Throughout the season the CBS Sports MLB experts will bring you a weekly Batting Around roundtable breaking down pretty much anything.\nR.J. Anderson: I think you have to give that title to Mason Miller right now.\nWe're here in June and he's striking out nearly two batters per inning.\nClase is right behind Miller for me.\nAnyway, to answer the question, I'll go with Clase over Hader and Miller, especially now that he's rediscovered the swing-and-miss-ability that eluded him at times last season.",
      "url": "https://www.cbssports.com/mlb/news/batting-around-whos-the-best-closer-in-mlb-as-flamethrower-mason-miller-challenges-veterans/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/04/96d658b4-6522-4858-aa74-45aee47e89a6/thumbnail/1200x675/722a0e090bdd794af7b7dff996cbfa62/miller-usatsi.png"
    },
    {
      "news_number": 11,
      "title": "Charlie Bradley Inducted into the Sports Club of Tampa Bay Hall of Fame",
      "summary": "About USF Men's BasketballTAMPA, Fla. (June 6, 2024) – Nearly four decades after he last played a game for the USF men's basketball program, Charlie Bradley is fondly remembered by Tampa Bay area sports fans.Still.Bradley was inducted Wednesday night into the Sports Club of Tampa Bay Hall of Fame at Higgins Hall, further cementing his legacy as one of the most electrifying athletes ever to play for the Bulls.\nBut USF set me up for the rest of my life and I will be forever grateful to my school.\n''Without fail, Bradley sits along the baseline under the basket, near the USF bench, at home games.\n''Bradley, a freshly inducted Hall of Famer, heard the cheers again — including the emotional reaction from fans who wistfully remembered the days when C.B.\nSeason tickets for the 2023-24 USF men's basketball slate are on sale now.",
      "url": "https://gousfbulls.com/news/2024/6/6/mens-basketball-charlie-bradley-inducted-into-the-sports-club-of-tampa-bay-hall-of-fame.aspx",
      "imgURL": "https://gousfbulls.com/images/2023/2/16/Bradley_cover_photo.jpg?preset=large.socialmediaimage"
    },
    {
      "news_number": 12,
      "title": "Five Warhawks Named to Athlon Sports Preseason All-Sun Belt Team",
      "summary": "Five ULM football players earned spots on Athlon Sports' Preseason All-Sun Belt Conference team, the magazine revealed.Junior offensive linemanwas voted second-team offense to headline ULM's selections.\nThree Warhawks garnered third-team recognition including running back, linebackerand cornerbackrounded out the preseason all-conference list for ULM with a fourth-team selection at defensive line.Fisher, a native of Allen, Texas, is a two-year starter for the ULM offensive line.\nSmith's season-long run was a 62-yard rushing touchdown in ULM's 17-13 victory over Army in week one.A senior linebacker from Monroe, Glass collected third-team defensive honors.\nSeason tickets are now on sale, and fans can secure their seats by visiting the ULM football season ticket page Fans can receive updates by following @ULM_FB on X/Twitter and by liking ULM Athletics on Facebook.\nFans can also follow the team on Instagram at ulmfootball",
      "url": "https://ulmwarhawks.com/news/2024/6/6/football-five-warhawks-named-to-athlon-sports-preseason-all-sun-belt-team.aspx",
      "imgURL": "https://ulmwarhawks.com/images/2024/6/6/ElijahFisher.jpg?preset=large.socialmediaimage"
    },
    {
      "news_number": 13,
      "title": "Monumental Sports & Entertainment Announces Robinhood as the 2024 Jersey Patch Partner for the Washington Mystics",
      "summary": "Washington, D.C. (June 6, 2024) – Today, Monumental Sports & Entertainment (MSE) announces Robinhood, the financial services platform that pioneered commission-free stock trading, as the jersey patch partner for the Washington Mystics.\n“We’re thrilled to welcome Robinhood as the Mystics jersey patch partner and introduce them to the most electric fanbase in all of sports,” said Alycen McAuley, Chief Business Officer for the Washington Mystics.\n“We’re excited to bring Robinhood’s mission to women’s sports through our first-ever WNBA partnership with the Washington Mystics,” said Vlad Tenev, CEO and Co-Founder of Robinhood Markets.\nSecurities trading is offered to self-directed customers by Robinhood Financial.\nRobinhood Financial is a member of the Financial Industry Regulatory Authority (FINRA).",
      "url": "https://monumentalsports.com/2024/06/monumental-sports-entertainment-announces-robinhood-as-the-2024-jersey-patch-partner-for-the-washington-mystics/",
      "imgURL": "https://monumentalsports.com/wp-content/uploads/2019/06/logo.svg"
    },
    {
      "news_number": 14,
      "title": "James Madison Places Second in Sun Belt’s Bubas Cup for 2023-2024",
      "summary": "Football earned its first bowl bid in program history in its second year of NCAA reclassification to the FBS level.\nMen's soccer was ranked as high as eighth and finished 18while lacrosse was as high as second and finished 16.\nBoth volleyball and baseball received votes during the season in national polls.Points for the Bubas Cup are awarded based on regular season finish for sports that have a regular season conference schedule.\nStandings for the sports of men's and women's soccer are determined by points rather than winning percentage.The Vic Bubas Cup is named after the Sun Belt Conference's first Commissioner.\nBubas was a three-time ACC Coach of the Year at Duke in the 1960s, taking his team to three Final Fours.",
      "url": "https://jmusports.com/news/2024/6/6/administration-james-madison-places-second-in-sun-belts-bubas-cup-for-2023-2024.aspx",
      "imgURL": "https://d1hg55pco9dr97.cloudfront.net/images/2024/6/6/Sun_Belt_trophy_beach.jpg?preset=large.socialmediaimage"
    },
    {
      "news_number": 15,
      "title": "North Platte Kids Club and Sports Shoppe team up to provide running shoes for annual 5K",
      "summary": "(KNOP) - The North Platte Kids Club and Sports Shoppe are teaming up once again for an annual 5K run.\nParticipants from kindergarten to sixth grade are able to get fitted for a pair of running shoes.\nEach year, the Sports Shoppe donates between 100 to 145 pairs of shoes depending on the number of kids in the program.\nThe partnership is in its fourth year and always brings a whole lot of smiles for these kids.\nClick here to subscribe to our KNOP News 2 daily digest and breaking news alerts delivered straight to your email inbox.",
      "url": "https://www.knopnews2.com/2024/06/06/north-platte-kids-club-sports-shoppe-team-up-provide-running-shoes-annual-5k/",
      "imgURL": "https://gray-knop-prod.cdn.arcpublishing.com/resizer/v2/JLUD4JCZUJFXPI5ZHMNVWSICAA.bmp?auth=f8d5ebf8345294283950ff9b4ac80b0c604e59e87c7e3378273c9043007dd31a&width=1200&height=600&smart=true"
    },
    {
      "news_number": 16,
      "title": "Fox Sports going deep in digital for soccer coverage",
      "summary": "Fox Sports is gearing up for its Summer of Soccer, and heavily investing in the digital space.\nKicking off Friday, June 14, the hosts of the Fox Soccer Now franchise will present coverage through the tournaments’ conclusion on July 14.\n“Realistically, most fans can’t watch up to six games again,” said Michael Bucklin, SVP of digital at Fox Sports.\n“The digital space is fun because we can keep them connected.”Fox’s digital coverage will be featured across all social media livestreaming platforms for the first time (Facebook, Twitter/X and YouTube), as well as the Fox Sports app.\nFox will produce the content nearly exclusively in vertical video, making an “enormous shift” to the vertical aspect.",
      "url": "https://www.sportsbusinessjournal.com/Articles/2024/06/06/fox-sports-digital-talent-summer-soccer-coverage",
      "imgURL": "https://www.sportsbusinessjournal.com/-/media/Images/Daily/2024/06/06/SOCIAL/SOCIAL-Summer-of-Soccer-Fox-Sports.ashx"
    },
    {
      "news_number": 17,
      "title": "As the school year wraps up, an early look at 5 issues the NJSIAA may face in 2024-25",
      "summary": "Here are five of the biggest issues that are either here, or lurking, in New Jersey high school athletics.\nIt’s not the first time the NJSIAA has been criticized for an error at the end of a marquee event.\nThe next week will see the spring season end with more eyes (and more cameras) on every event.\nParents and high school players know that nothing tethers a coach or athletic director from staying in a situation, so why should they?\nThe NJSIAA has kept it as a pilot program for now, but eventually it will become a full-fledged spring sport and take away athletes from other spring sports.",
      "url": "https://www.northjersey.com/story/sports/high-school/2024/06/06/nj-hs-sports-5-big-issues-njsiaa-2024-25/73977945007/",
      "imgURL": "https://www.northjersey.com/gcdn/authoring/authoring-images/2024/02/15/PNJM/72608447007-021424-gbk-srds-teaneck-005.JPG?crop=3749,2109,x0,y0&width=3200&height=1801&format=pjpg&auto=webp"
    },
    {
      "news_number": 18,
      "title": "THIS DAY IN SPORTS HISTORY: 6/6",
      "summary": "1992 – Mets first baseman Eddie Murray picks up career RBI #1,510, making him the career leader for switch hitters, passing Mickey Mantle.\n1999 – Andre Agassi becomes the fifth men’s tennis player to complete the career Grand Slam after winning the French Open.\n2011 – The Bowl Championship Series strips USC of its 2004 football national championship after the Trojans were hit with NCAA sanctions for numerous violations.\n2013 – Less than a month after winning the NBA Coach of the Year Award, George Karl is fired by the Denver Nuggets.\n2018 – LeBron James passes Michael Jordan for the most 30 plus point games in NBA playoff history with 109.",
      "url": "https://www.regionsports.com/2024/06/06/this-day-in-sports-history-6-6/",
      "imgURL": "https://www.regionsports.com/wp-content/uploads/2020/08/tdish-graphic4.jpg"
    },
    {
      "news_number": 19,
      "title": "Successful June Boat Fair showcases TWG sports and cultural heritage",
      "summary": "Leveraging the area's rich water recreation resources, the event featured TWG sports demonstrations and activities, including Dragon Boat, Canoe, and MotoSurf.\nCitizens enjoyed demonstrations of Zongzi-making, a traditional Chinese food, as well as hands-on activities in Chinese mugwort weaving, salted duck egg production, paper dragon boat folding, and sugar painting.\nThe event coincided with the Dragon Boat Festival and International Children's Day, making it a perfect celebration for families.\nThis successful event highlighted the integration of TWG sports with local culture, enhancing public engagement and promoting cultural heritage.\nThe June Boat Fair not only celebrated sports but also provided a vibrant cultural experience, setting a high standard for the upcoming events in the TWG Twelve Monthly Fairs series.",
      "url": "https://www.theworldgames.org/news/The-World-Games-2025-33/Successful-June-Boat-Fair-showcases-TWG-sports-and-cultural-heritage-2539",
      "imgURL": "https://www.theworldgames.org/img/contents/2539/header-col8-1528.jpg?1717661607"
    },
    {
      "news_number": 20,
      "title": "Washington Mystics and Audacy Announce Partnership for Live Radio Broadcasts",
      "summary": "Live Mystics games, featuring audio from Monumental Sports Network, will be available on The Team 980 starting tonightWashington, D.C. (June 6, 2024) – The Washington Mystics and Audacy announced today a partnership to broadcast live Mystics games on The Team 980 (WTEM-AM), the new Mystics flagship station, throughout the 2024 WNBA season.\nWhile most radio broadcasts will air on The Team 980, select games will air on 106.7 The Fan (WJFK-FM) and The Bet Washington (WJFK-AM), and all games will be streamed locally on the Audacy app.\nThe Team 980 is Washington, D.C.’s first all-sports radio station.\n“Demand for Mystics live game coverage is at an all-time high and adding a radio broadcast will allow even more fans to follow our team throughout the season,” said Alycen McAuley, Chief Business Officer for the Washington Mystics.\nThe network holds exclusive local television media rights for the NHL’s Washington Capitals, NBA’s Washington Wizards and WNBA’s Washington Mystics games.",
      "url": "https://monumentalsports.com/2024/06/washington-mystics-and-audacy-announce-partnership-for-live-radio-broadcasts/",
      "imgURL": "https://monumentalsports.com/wp-content/uploads/2019/06/logo.svg"
    },
    {
      "news_number": 21,
      "title": "Ranking new QB-WR duos for 2024 NFL season: C.J. Stroud-Stefon Diggs pairing atop list; Bears rookies make cut",
      "summary": "Odunze also led the FBS in receiving yards last year with 1,640, which is why he was picked in the top 10.\nColeman led the ACC in receiving touchdowns last season with 11, and was a stud specialist as well.\nThe two-time Unanimous All-American recorded the most receiving yards (2,474) and receiving touchdowns (28) in a two-year span in Ohio State history, and is the only player in Big Ten history to record 14 receiving touchdowns in multiple seasons.\nStroud and Stefon DiggsDiggs' projected receiving stats: 89 receptions, 1,124 yards, 7 TDsThe last time Diggs switched teams was great for him.\nSince joining the Buffalo Bills, no player caught more passes than Diggs, and his 5,372 receiving yards and 37 receiving touchdowns ranked fourth.",
      "url": "https://www.cbssports.com/nfl/news/ranking-new-qb-wr-duos-for-2024-nfl-season-c-j-stroud-stefon-diggs-pairing-atop-list-bears-rookies-make-cut/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/06/7e68f5c1-65c9-4fa5-9363-0c8451bac327/thumbnail/1200x675/5dc911634a33554d3cd442c64f9e6109/odunze-caleb-g.jpg"
    },
    {
      "news_number": 22,
      "title": "End of the 'analyst army'? Why revenue sharing could curb college football's off-field staff swell",
      "summary": "Despite his long list of accomplishments, there was no grand welcome or red-carpet arrival when he joined Nick Saban's analyst army.\nHe could take experienced coaches who may have failed elsewhere and bring them into his Alabama program as off-field analysts.\nNew Alabama coach Kalen DeBoer's on-field staff is actually slightly more expensive than Saban's from 2023, but the program has slimmed down its off-field analyst workforce from 12 to eight.\nEx-Rutgers offensive coordinator John McNulty and former Tide linebacker Jamey Mosley are the lone analyst holdovers from Saban's last staff.\n\"If you look at it just from a revenue place: By having another coach, another analyst, does it grow our revenue number?",
      "url": "https://www.cbssports.com/college-football/news/end-of-the-analyst-army-why-revenue-sharing-could-curb-college-footballs-off-field-staff-swell/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/05/d343e48c-9be3-454d-bc07-23e89e2f515b/thumbnail/1200x675/7de126e9bb9f24183ccc17ec06965b54/mike-locksley-1.jpg"
    },
    {
      "news_number": 23,
      "title": "Lakers reportedly targeting UConn's Dan Hurley; NBA Finals start tonight; MLB All-Star ballot time",
      "summary": "THE BOSTON CELTICS AND THE DALLAS MAVERICKSWelcome to the NBA Finals, friends.\nChristian Pulisic, fresh off his best season, comes in at No.\nBut just as importantly as those stats, for the first time in his career, Pulisic showed an ability to regularly get on the pitch, and stay there.\nHe played 36 out of 38 league games for Milan, a career best, and only the second time he's ever cracked the 30 game barrier ...\n📺 What we're watching Thursday⚾ Cubs at Reds, 7:10 p.m. on MLB Network🏀 NBA Finals -- Game 1: Mavericks at Celtics, 8:30 p.m. on ABC",
      "url": "https://www.cbssports.com/nba/news/lakers-reportedly-targeting-uconns-dan-hurley-nba-finals-start-tonight-mlb-all-star-ballot-time/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/04/bff27d70-af2a-4283-ab79-30f399669621/thumbnail/1200x675/793649c09d37feeb1876d480bc15f816/luka-brown-celtics-mavericks-getty.png"
    },
    {
      "news_number": 24,
      "title": "2024 U.S. Open odds, golf picks: Tiger Woods, Rory McIlroy predictions by model that nailed the Masters, PGA",
      "summary": "According to the latest 2024 U.S. Open odds, Scheffler is the 4-1 favorite, while Rose is a 65-1 longshot.\nThis same model has also nailed a whopping 12 majors entering the weekend, including three straight Masters and the 2024 PGA Championship.\nHow to make 2024 U.S. Open picksThe model is targeting three golfers with 2024 U.S. Open odds of 20-1 or longer who will make surprising runs.\nWho will win the 2024 U.S. Open, which longshots will stun the golfing world, and where will Tiger Woods and Rory McIlroy finish?\n2024 U.S. Open odds, fieldSee the full U.S. Open 2024 picks, best bets, and predictions here.",
      "url": "https://www.cbssports.com/golf/news/2024-u-s-open-odds-golf-picks-tiger-woods-rory-mcilroy-predictions-by-model-that-nailed-the-masters-pga/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2023/11/27/0d9752e0-31e3-4208-84d5-9dc7c0de23bd/thumbnail/1200x675/93c7fa617770f155204d067ea0aed72b/tiger.jpg"
    },
    {
      "news_number": 25,
      "title": "Top NFL rookie WRs: Projected 2024 statistics for Marvin Harrison Jr., Malik Nabers, Rome Odunze and more",
      "summary": "We are right around the corner from training camp, which means the NFL offseason is about to become the NFL preseason.\nA total of 35 wide receivers were selected in the 2024 NFL Draft, the second-most drafted position this year behind the 36 cornerbacks selected.\nYou don't have to be selected in the first round to make an immediate impact at the next level.\nWe saw fifth-round pick Puka Nacua break the rookie receiving record last year, while third-round picks Tank Dell and Josh Downs made considerable contributions for their respective squads as well.\nWe have the projected stats for the top 14 rookie wide receivers this upcoming season thanks to CBS Sports' Fantasy team, complete with receptions, receiving yards and receiving touchdown numbers.",
      "url": "https://www.cbssports.com/nfl/news/top-nfl-rookie-wrs-projected-2024-statistics-for-marvin-harrison-jr-malik-nabers-rome-odunze-and-more/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/01/10/46ac07df-2326-4a8f-ac25-60fd6281ff57/thumbnail/1200x675/d55c3be05ae83a6c710740d2ebc80187/getty-marvin-harrison-jr-ohio-state.jpg"
    },
    {
      "news_number": 26,
      "title": "Hamden Middle School sports to be cut as district faces $3.1 million deficit",
      "summary": "The Hamden community is concerned after Monday’s school budget vote passed, which includes cutting sports at Hamden Middle School.\nHamden Public Schools superintendent Gary Highsmith requested $6.6 million from the town.\nThe legislative council allocated $3.5 million dollars to the district, which left a $3.1 million shortfall.\nThese are the decisions I have to make,” Hamden Public Schools Superintendent Gary Highsmith said.\nHamden Mayor Lauren Garrett, whose son is a soon-to-be middle school student, is asking to review the school budget and look at state funds as a way to keep the sports programs next school year.",
      "url": "https://www.nbcconnecticut.com/news/local/hamden-middle-school-sports-to-be-cut-as-district-faces-3-1-million-deficit/3306934/",
      "imgURL": "https://media.nbcconnecticut.com/2024/06/hamden-middle-school-060524.jpg?quality=85&strip=all&resize=1200%2C675"
    },
    {
      "news_number": 27,
      "title": "City leaders approve plans for hotel, indoor sports facility at Northport Shore development",
      "summary": "NORTHPORT, Ala. (WBRC) - With the sports complex project underway in Northport, city leaders approved plans this week for some amenities around the park near the Black Warrior River.\nMonday, the city council approved $840,000 to a firm to develop plans for a hotel and indoor sports facility near Kentuck Park.\nThis will be near a much larger project at River Run park that will include several baseball and softball fields.\nCity leaders broke ground on the sports complex earlier this year.\nParents and city leaders say these projects are much needed and will have a huge economic impact for the city.",
      "url": "https://www.wbrc.com/2024/06/06/city-leaders-approve-plans-hotel-indoor-sports-facility-northport-shore-development/",
      "imgURL": "https://gray-wbrc-prod.cdn.arcpublishing.com/resizer/v2/IPAJMTM2FFHANDNJJOLAOPJR4A.bmp?auth=79f8dc7253070839c9b16850f22a06c288e2970a53e2b177c3102b2149418ac7&width=1200&height=600&smart=true"
    },
    {
      "news_number": 28,
      "title": "Beloved Sports Bar Exiles Gets an Adams Morgan Sibling",
      "summary": "Now, it has a new sibling in Adams Morgan: Easy Tiger Tavern, which opened June 1 after a months-long delay.\nEasy Tiger replaces the former Pop’s Sea Bar on Columbia Road, and it caters to its own transatlantic pair of fanbases: Arsenal and Louisiana State University.\nView this post on Instagram A post shared by Easy Tiger Tavern (@easytigerdc)The team wanted Easy Tiger to be a friendly rival to Exiles—an Arsenal bar versus a Liverpool one.\nOpen until 2 AM, Easy Tiger is already a raucous scene.\n“That’s what we wanted here.”Easy Tiger Tavern, 1817 Columbia Rd., NW.",
      "url": "https://www.washingtonian.com/2024/06/06/beloved-sports-bar-exiles-gets-an-adams-morgan-sibling/",
      "imgURL": "https://www.washingtonian.com/wp-content/uploads/2024/06/IMG_9709.jpg"
    },
    {
      "news_number": 29,
      "title": "For Cowboys' Micah Parsons, results will inform offseason process",
      "summary": "National Football League For Cowboys' Micah Parsons, results will inform offseason process Published Jun.\nADVERTISEMENTThe conversation is a bit more nuanced for Micah Parsons, who reported for this week’s mandatory sessions after dipping in and out during voluntary work.\nIs Micah Parsons missing from OTAs a setback for Cowboys?\nFollowing the early postseason exit, Parsons said on his \"The Edge with Micah Parsons\" podcast that he wanted to be a bigger part of shaping the team’s culture moving forward.\nWhen should the Cowboys pay Micah Parsons?",
      "url": "https://www.foxsports.com/stories/nfl/cowboys-micah-parsons-results-inform-offseason-process",
      "imgURL": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/06/1408/814/Parsons2.jpg?ve=1&tl=1"
    },
    {
      "news_number": 30,
      "title": "Mike McCarthy believes Cowboys QB Dak Prescott 'is having his best offseason program that we've had' together",
      "summary": "\"I understand what it looks like, what it may look like from that side understanding the lack of moves that get done,\" Cowboys quarterback Dak Prescott said Wednesday.\nMcCarthy highlighted quarterback Prescott's poised production throughout the Cowboys' offseason program as an example of his team's resolve amid an uncertain future.\n\"I think Dak is having his best offseason program that we've had, and he's had really good offseason programs the whole time (since McCarthy become Cowboys coach in 2020),'' McCarthy said.\nI think the offensive perimeter group and the quarterbacks have really excelled through this offseason program.\nPlus, Prescott and the bulk of the aforementioned crucial Cowboys contributors are playing to earn their next contract in the 2024 season.",
      "url": "https://www.cbssports.com/nfl/news/mike-mccarthy-believes-cowboys-qb-dak-prescott-is-having-his-best-offseason-program-that-weve-had-together/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/06/ddce8d6b-b603-4a1c-8b66-78f4daea10fd/thumbnail/1200x675/e4fb0310acfa604a576b0b40801d9572/gettyimages-1908164595.jpg"
    },
    {
      "news_number": 31,
      "title": "2024 U.S. Open odds, golf predictions, picks: Scottie Scheffler projection by model that called last 2 majors",
      "summary": "The U.S. Open 2024 will begin on Thursday, June 13 from Pinehurst No.\nOthers high up the 2024 U.S. Open odds board include Rory McIlroy (9-1), Xander Schauffele (10-1), Brooks Koepka (12-1) and Jon Rahm (12-1).\nBefore locking in your 2024 U.S. Open picks or Scottie Scheffler props, be sure to see the golf predictions and projected leaderboard from the proven computer model at SportsLine.\nNow with the U.S. Open 2024 field taking shape, SportsLine simulated the tournament 10,000 times, and the results were surprising.\n2024 U.S. Open odds, fieldGet full 2024 U.S. Open picks, best bets, and predictions here.",
      "url": "https://www.cbssports.com/golf/news/2024-u-s-open-odds-golf-predictions-picks-scottie-scheffler-projection-by-model-that-called-last-2-majors/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/05/15/2e00407c-df9a-48b1-ab01-c4c0d74bdbce/thumbnail/1200x675/6ab3d05590e06c7118a3422b1017aaf4/scottie-scheffler-2-usatsi-1.jpg"
    },
    {
      "news_number": 32,
      "title": "Mid-Ohio Valley Sports Announcements",
      "summary": "***Wirt County Sports HOF nominees soughtThe second class for the Wirt County Sports Hall of Fame will be taking nominations until Friday, June 28.\nHigh school play will be from 3-4:30 p.m. and middle school play will be from 4:30-6.\n***Marietta Pioneer Club Golf OutingNow in its 39th year, the Marietta College Pioneer Club Golf Outing is set for Friday, July 19 at the Marietta Country Club.\nThe entry fee is $120 per golfer ($480 per foursome) and includes 18 holes of golf, cart, golf favors, and refreshments on the course.\nTo register for the Pioneer Club Golf Outing, visit tinyurl.com/56pbamad.",
      "url": "https://www.newsandsentinel.com/news/community-news/2024/06/mid-ohio-valley-sports-announcements-81/",
      "imgURL": "https://ogden_images.s3.amazonaws.com/www.newsandsentinel.com/images/2024/02/09222227/ImageSports-1100x733.jpg"
    },
    {
      "news_number": 33,
      "title": "Chiefs player goes into cardiac arrest, in stable condition, per report; team cancels all activities",
      "summary": "The Kansas City Chiefs were forced to postpone practice on Thursday after a medical emergency that occurred at the facility, the team announced.\nAccording to multiple reports, the Chiefs' medical staff responded to the situation immediately and Thompson is now in stable condition at the hospital.\nDue to the situation, the Chiefs canceled all team activities scheduled for Thursday and they postponed a Thursday media session until Friday.\nThe Chiefs will be back on the field for next week for their mandatory minicamp, which runs June 11-13.\nAfter minicamp, the team will be off until training camp starts in late July.",
      "url": "https://www.cbssports.com/nfl/news/chiefs-player-goes-into-cardiac-arrest-in-stable-condition-per-report-team-cancels-all-activities/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/06/5d335664-a1d0-47be-bf5e-0f493c366ac1/thumbnail/1200x675/f400cbc9517bf39518b056d7e9f5a070/chiefs-field-g.jpg"
    },
    {
      "news_number": 34,
      "title": "NBC SPORTS PRESENTS COMPREHENSIVE LIVE COVERAGE OF 124th U.S. OPEN AT PINEHURST NO. 2 JUNE 13-16 ACROSS NBC, PEACOCK, AND USA NETWORK",
      "summary": "Pre-championship coverage begins Monday, June 10, with Golf Central Live From the U.S. Open on GOLF Channel and Peacock.\nIn total, NBC Sports will provide nearly 300 hours of championship coverage surrounding the 2024 U.S. Open , including traditional Thursday-Sunday coverage, featured groups and streaming coverage on Peacock, and week-long Live From studio coverage.\n2 in 1999, 2005, and 2014:Dan Hicks – play-by-play and reporter NBC Sports’ coverage at Pinehurst in 1999, 2005 and 2014.\nThis marks his 25 th U.S. Open for NBC SportsU.S. Open for NBC Sports Tommy Roy – produced NBC’s U.S. Open coverage at Pinehurst in 1999, 2005 and 2014.\nAmerican Express is Presenting Sponsor of NBC Sports’ U.S. Open Featured Groups coverage.",
      "url": "https://www.nbcsports.com/pressbox/press-releases/nbc-sports-presents-comprehensive-live-coverage-of-124th-u-s-open-at-pinehurst-no-2-june-13-16-across-nbc-peacock-and-usa-network",
      "imgURL": "https://nbcsports.brightspotcdn.com/dims4/default/54b1836/2147483647/strip/true/crop/1282x721+319+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2F22%2Fdd%2F64e4c6e74996a142c1ea320a986b%2Fuso-logo-full-color-final.png"
    },
    {
      "news_number": 35,
      "title": "Local kids find winning combination in sports, art",
      "summary": "The students participated in an “art in sport” competition run by the Al Oerter Foundation, created in honor of four-time Olympic gold medalist Al Oerter.\nThe foundation’s core program is Art of the Olympians, which showcases the creative endeavors of Olympians.\nIn the U.S., the only other entries came from Will Rogers Elementary School and Eagleview Middle School in Colorado Springs, Colorado.\nMiddle school students Hoffman, Cunniff and Wilson tied for second place in the overall competition.\nAll LPHS art students entered the competition as an assignment for class, though second-place winner Fitzsimmons said that she didn’t realize it was a contest until halfway through the painting process.",
      "url": "https://www.adirondackdailyenterprise.com/news/local-news/2024/06/local-kids-find-winning-combination-in-sports-art/",
      "imgURL": "https://ogden_images.s3.amazonaws.com/www.adirondackdailyenterprise.com/images/2024/06/05192708/ArtSport1.jpg"
    },
    {
      "news_number": 36,
      "title": "Once a college football star, Rep. Colin Allred now stumping for athlete protection amid House v. NCAA fallout",
      "summary": "From 2001-05, Allred played linebacker at Baylor University and landed in the NFL for five seasons with the Tennessee Titans.\nWith five years to play four seasons, many college athletes are chasing short-term payouts that may not last very long.\nCongressional leaders have been openly discussing various bills in support of college athletics since NIL entered the equation in 2021.\nIronically, one of the top public advocates for college athletics legislation is his opponent.\nIn an era when Republicans and Democrats rarely agree on anything, college athletics has quickly become a target for reform.",
      "url": "https://www.cbssports.com/college-football/news/once-a-college-football-star-rep-colin-allred-now-stumping-for-athlete-protection-amid-house-v-ncaa-fallout/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/06/1ae2606c-f2e3-40f0-afd5-2d19e1ff7748/thumbnail/1200x675/a085ebcd18f978740040720a2e76b1e5/colin-allred.jpg"
    },
    {
      "news_number": 37,
      "title": "News, Sports, Jobs - The Nashua Telegraph",
      "summary": "John Draper Finnern June 6, 2024 John Draper Finnern, 81, died Wednesday, May 29, 2024, at home in Hollis, NH.\nHe was born on June 25, 1942, in Los Angeles, CA, the son of the late Arnold and Virginia (Draper) Finnern.\nJohn graduated from Darien ... Raymond “Ray” C. Lavallee June 6, 2024 Raymond “Ray” C. Lavallee, 94, of Merrimack, New Hampshire passed away peacefully on Sunday, June 2, 2024.\nShe was also predeceased by her ...Raymond (Ray) George Paulhus June 5, 2024 Raymond (Ray) George Paulhus, 80, of Nashua NH passed away on May 25, 2024 surrounded by his loved ones after a short stay at the Community Hospice House in Merrimack, NH.\nHe is survived by his eldest sister, Adrienne ...Kenwood “Woody” C. Jones Jr. June 5, 2024 passed away May 24, 2024 after a long and courageous battle with Parkinson's Disease.",
      "url": "https://www.nashuatelegraph.com/obituaries-memorials/obituaries/",
      "imgURL": "http://d14e0irai0gcaa.cloudfront.net/www.nashuatelegraph.com/images/2017/03/07170214/fblike.jpg"
    },
    {
      "news_number": 38,
      "title": "Too big to fail? Bankrupting NCAA would have been needed new chapter for college sports",
      "summary": "A loss would have bankrupted the NCAA, heaped long-denied money on athletes, and opened a new chapter for college sports.\nThere is a prevailing sense the NCAA is “too big to fail” and that collapse would irrevocably destabilize college athletics.\nCollege athletics still need reformThe House v. NCAA settlement leaves us at a similar juncture: College athletics still need to be reformed, and it must be real reform, not merely self-serving protections for the NCAA.\nThe college football playoff structure must be rationalized.\n(It’s worth remembering that 95% of college athletes do not get money, even under the current system, and they would need to be recruited by a PCA program.)",
      "url": "https://www.indystar.com/story/opinion/columnists/2024/06/05/indianapolis-ncaa-settlement-nil-college-sports/73971123007/",
      "imgURL": "https://www.indystar.com/gcdn/authoring/authoring-images/2024/05/23/USAT/73827009007-ncaalogoflag.jpg?crop=6870,3867,x0,y357&width=3200&height=1802&format=pjpg&auto=webp"
    },
    {
      "news_number": 39,
      "title": "Inter-County Conference names spring sports all-stars",
      "summary": "The Inter-County Conference recognized all-stars for the 2024 spring sports season.\nStudent-athletes from Berlin Brothersvalley, Meyersdale, North Star, Rockwood and Windber are named from the West Division.\nBaseballBerlin Brothersvalley: Pace Prosser (infielder)Meyersdale: Karter Schurg (outfielder), Spencer Whitfield (infielder)North Star: Vance Kimmel (pitcher), Cayden Turner (infielder), Nolan Weible (outfielder), Connor Yoder (infielder)Rockwood: Carson Brown (outfielder), Aaron Show (pitcher), Josh Wagner (outfielder), Hunter Whipkey (pitcher)Windber: Mason Horner (designated hitter), Lucas Oleksa (catcher), Lucas Rummel (outfielder), Andrew Scalia (infielder)North Star infielder Bryson Durst was an honorable mention.\nMoving onNorth Star knocks off Serra Catholic in PIAA Class 2A baseball first roundSoftballBerlin Brothersvalley: Elsie Barna (catcher), Taylor Hillegass (outfielder), Coral Prosser (infielder), Elena Ritchey (pitcher)Meyersdale: Izabella Donaldson (pitcher), Laurel Daniels (infielder), Kendell Donaldson (outfielder), Marcella Dupre (outfielder)Rockwood: Brooke Snyder (infielder)Windber: Rylee Baer (designated player), Nici Costlow (outfielder), Kaylie Gaye (infielder) and Skylee Miller (pitcher)Survive and advanceLong Gone: Meyersdale junior sends Red Raiders to PIAA 1A softball quarterfinalsBoys track and fieldMeyersdale: Nolan Easton (400-meter relay), Dylan Hay (400 relay), Levi Hersch (400 relay), Bryson Hetz (javelin), Tristin Ohler (100, 200, 400 relay), Jordan Synowietz (discus)Windber: Tanner Barkley (3200 relay), Michael Dusack (3200 relay), Joe McKelvey (1600, 3200, 3200 relay), Garrett Page (3200 relay)Girls track and fieldBerlin Brothersvalley: Deborah Bozovich (400, 1600 relay), Lexi Fairman (400 relay), Addisyn Glessner (pole vault, 400 relay), Mikaela Glessner (1600 relay), Lynndee Ickes (100 hurdles), Avery Ogburn (400 and 1600 relays), Mercy Sechler (400 and 1600 relays)Meyersdale: Aurora Comfort (3200)Windber: Heather Carney (triple jump, 3200 relay), Kendall Decewicz (3200 relay), Mayson Oyler (3200 relay), Rachel Russo (3200 relay)",
      "url": "https://www.dailyamerican.com/story/sports/high-school/2024/06/06/inter-county-conference-honors-spring-sports-all-stars/73985740007/",
      "imgURL": "https://www.dailyamerican.com/gcdn/authoring/authoring-images/2024/05/16/NTDA/73710753007-d-5-track-may-24-081.JPG?crop=972,547,x0,y101&width=972&height=547&format=pjpg&auto=webp"
    },
    {
      "news_number": 40,
      "title": "JMU Claims TowneBank Royal Rivalry Challenge for Second Straight Year",
      "summary": "Thanks for visiting !\nThe use of software that blocks ads hinders our ability to serve you the content you came here to enjoy.\nWe ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here.\nThank you for your support!",
      "url": "https://jmusports.com/news/2024/6/6/administration-jmu-claims-townebank-royal-rivalry-challenge-for-second-straight-year.aspx",
      "imgURL": "https://d1hg55pco9dr97.cloudfront.net/images/2024/6/6/Royal_Rivalry.jpg?preset=large.socialmediaimage"
    },
    {
      "news_number": 41,
      "title": "Taunton Eats: Favorite Portuguese foods, live music at Taunton Sports' Holy Ghost Feast",
      "summary": "This week, Taunton Sports Club is gearing up for its Holy Ghost Feast.\nPlus, we've got fish and chips, s'mores lattes, outdoor dining, and even a fun Father's Day special from a local bakery.\nLet’s dig in:Holy Ghost Feast at Taunton Sports ClubTaunton Sports Club, 33 Baker Rd.\nW., has announced the schedule for the 2024 Holy Ghost Feast.\nTaunton Eats:Crue Brew Brewery fundraiser for Jett Foundation; Frankie & Dia's helps TacTPatio now open at The PearlYou can dine al fresco at The Pearl, 76 Weir St., Taunton.",
      "url": "https://www.tauntongazette.com/story/lifestyle/food/2024/06/06/taunton-eats-holy-ghost-feast-2024-at-taunton-sports-club/73991181007/",
      "imgURL": "https://www.tauntongazette.com/gcdn/presto/2021/07/12/NTDG/5b738d2d-28f5-41a1-9278-90f81f3d95e0-DSC05754.jpg?crop=1699,956,x0,y86&width=1699&height=956&format=pjpg&auto=webp"
    },
    {
      "news_number": 42,
      "title": "2024 Belmont Stakes odds, predictions: Favorites, picks and more",
      "summary": "Horse Racing 2024 Belmont Stakes odds, predictions: Favorites, picks and more Updated Jun.\nThe Belmont Stakes on Saturday wraps up several weeks of prestigious horse races.\nBelmont Stakes schedule & how to watchTV: FOX, FOX Sports appLocation: Saratoga Race Course, Saratoga Springs, NYDate: Saturday, June 8, 2024Post time: 6:41 p.m.\nETRecapping last yearLast year's Belmont Stakes was one for the history books.\nBelmont Stakes post-position draw, oddsThe post-position draw was held on Monday, and here are the latest odds as of June 4.",
      "url": "https://www.foxsports.com/stories/other/2024-belmont-stakes-odds-predictions-favorites-picks-more",
      "imgURL": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/06/1408/814/2024-06-04_Belmont-Stakes-Talent-Hub-File_16x9.jpg?ve=1&tl=1"
    },
    {
      "news_number": 43,
      "title": "Former National Team Stars Wes Morgan, Jimmy Conrad And Melissa Ortiz Join FOX Sports’ Digital Coverage Of UEFA EURO 2024™ And CONMEBOL Copa América 2024™",
      "summary": "Ortiz represented her country in the Olympics, Copa América and Central American Games, and also played professionally in the Icelandic, American and Colombian leagues.\n“They join our newest star, Wes Morgan, who brings the experience of two Copa América tournaments with Team Jamaica while simultaneously earning an esteemed career in the EPL.\nThe network’s social channels will also feature near real-time match highlights, Q&As with FOX Soccer personalities, online giveaways and more.\nFOX SPORTS APP – FOX Sports will stream all UEFA EURO 2024™ and CONMEBOL Copa América 2024™ matches live on the FOX Sports app.\nFOLLOW ALONG – Follow FOX Soccer across all social media platforms, including Facebook, Instagram, TikTok, Twitter and YouTube.",
      "url": "https://www.foxsports.com/presspass/blog/2024/06/06/former-national-team-stars-wes-morgan-jimmy-conrad-and-melissa-ortiz-join-fox-sports-digital-coverage-of-uefa-euro-2024-and-conmebol-copa-america-2024/",
      "imgURL": "https://foxsports-wordpress-www-prsupports-prod.s3.amazonaws.com/uploads/sites/2/2024/06/123TalentAnnounce.png"
    },
    {
      "news_number": 44,
      "title": "UConn's Dan Hurley in talks with Lakers, will make decision 'in near future'",
      "summary": "National Basketball Association UConn's Dan Hurley in talks with Lakers, will make decision 'in near future' Updated Jun.\nHurley's plan is to have his mind made up on the decision weighing on him in the near future, a source said.\nHurley told his team — which is No.\nADVERTISEMENT\"He deals with things mentally where he's constantly seeking to prove what he can do,\" a source told FOX Sports.\nShould Dan Hurley leave UConn for the Lakers?",
      "url": "https://www.foxsports.com/stories/nba/uconns-dan-hurley-talks-lakers-make-decision-in-near-future",
      "imgURL": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/04/1408/814/UConnHurley.jpg?ve=1&tl=1"
    },
    {
      "news_number": 45,
      "title": "2024 Memorial Tournament purse, prize money: Payouts for golfers, winner's share from $20 million pool",
      "summary": "The PGA Tour's seventh signature event of the season is being held this week as the 2024 Memorial Tournament takes center stage at Muirfield Village.\nWhile the Memorial marks one of the last big-money tournaments on the PGA Tour schedule, it also kicks off a highly lucrative three-week stretch in professional golf.\nThose who play themselves into the weekend will vie for a $4 million winner's check, matching the sum paid out at the Genesis Invitational and Arnold Palmer Invitational on the PGA Tour calendar.\nThose inside the top 11 will all clear $500,000, every player inside the top 21 will make more than $250,000 and those inside the top 50 will clear at least $52,000.\nLet's take a look at the payout list for the 2024 Memorial Tournament.",
      "url": "https://www.cbssports.com/golf/news/2024-memorial-tournament-purse-prize-money-payouts-for-golfers-winners-share-from-20-million-pool/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/04/f15af5a3-76a5-4128-a6ac-a97e400261f2/thumbnail/1200x675/78c182b124fddf84acd5d4ce0d121760/memorial-tournament-trophy-g.jpg"
    }
  ],
  "finance": [
    {
      "news_number": 0,
      "title": "The unexpected origins of a modern finance tool",
      "summary": "In the early 1600s, the officials running Durham Cathedral, in England, had serious financial problems.\nAecroid’s Tables: Economic Calculations and Social Customs in the Early Modern Countryside,” appearing in the current issue of the Journal of Modern History.\nThe Durham leaders did levy intermittent fees on tenants, but that led to angry responses and court cases.\nChurch leaders could simply plug in the numbers as compromise solutions.\nPerforming fairnessThe discounting tables from books did not only work because the price was right.",
      "url": "https://news.mit.edu/2024/unexpected-origins-modern-finance-tool-discounting-0606",
      "imgURL": "https://news.mit.edu/sites/default/files/images/202406/MIT_Deep-Discounts-01-PRESS.jpg"
    },
    {
      "news_number": 1,
      "title": "Stocks mixed ahead of Friday jobs report, Nvidia slips: Yahoo Finance",
      "summary": "Stocks (^DJI,^GSPC, ^IXIC) are trading mixed as investors await Friday's jobs report.\nNvidia (NVDA) is off its highs, now slipping below a $3 trillion market capitalization.\nYahoo Finance trending tickers include Nio Inc. (NIO), Lyft Inc (LYFT).\nET - Vance Howard, Howard Capital Management CEO & Portfolio Manager3:30 p.m.\nET - George Gianarikas, Canaccord Genuity Managing Director5:00 p.m.",
      "url": "https://finance.yahoo.com/video/stocks-mixed-ahead-friday-jobs-172600781.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/pYBYEcDK1sX_ZE425k3w8g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2019-09/1af93af0-db18-11e9-bff7-e34690b9be52"
    },
    {
      "news_number": 2,
      "title": "NC lawmakers push new campaign finance rules. Critics call it political 'money laundering'",
      "summary": "A new proposal from North Carolina Republican lawmakers could enact what state elections officials have described as a loophole that would give corporations outsize influence over state elections.\nThe change being proposed by Republican lawmakers would allow those corporate-funded 527s to donate to state political parties here in North Carolina.\nPolitical parties can already receive unlimited donations, and they can also give unlimited amounts of money to their parties’ candidates.\nThe proposal introduced Thursday would allow business and labor leaders to use political parties as a sort of middleman, to give money directly to their favored candidate.\nNorth Carolina Elections Director Karen Brinson Bell wrote in that memo that if this sort of contribution system were to be allowed, \"there would be a significant loophole in North Carolina law.\"",
      "url": "https://www.wral.com/story/nc-lawmakers-push-new-campaign-finance-rules-critics-call-it-political-money-laundering/21470047/",
      "imgURL": "https://images.wral.com/asset/news/local/2007/09/17/1823483/1823483-1443149091-400x300.jpg"
    },
    {
      "news_number": 3,
      "title": "Ahead of 2025 Jubilee, Pope Francis rallies global finance heads to back debt relief",
      "summary": "Pope Francis meets with academic experts, policymakers, officials from multilateral institutions and religious leaders meeting with the Pontifical Academy of Social Sciences to discuss the foreign debt crisis June 5, 2024, at the Vatican.\nThe pope went on to call for a \"new international financial architecture\" that breaks the financial-debt cycle that has contributed to a current global debt now estimated at $313 trillion.\nThe meeting comes as major legislation is being considered in New York and in the United Kingdom on sovereign debt restructuring and at a time when both church leaders and development groups are pushing for greater foreign debt relief.\n\"Ecological debt and foreign debt are two sides of the same coin that mortgages the future,\" the pope told conference participants.\n(CNS/Lola Gomez)Eric LeCompte, the leader of Jubilee USA, a network of religious and development groups that advocates for international debt relief, described the pope's remarks as \"powerful and forceful.\"",
      "url": "https://www.ncronline.org/vatican/vatican-news/ahead-2025-jubilee-pope-francis-rallies-global-finance-heads-back-debt-relief",
      "imgURL": "https://www.ncronline.org/files/2024-06/20240605T0800-VATICAN-LETTER-JUBILEE-DEBT-1777756%20web.jpg"
    },
    {
      "news_number": 4,
      "title": "‘I’m looking for a man in finance' — here’s why TikTok’s viral video is no joke",
      "summary": "Just ask content creator Megan Boni, who posted a clip from her account @girl_on_couch on April 30 hashing out a new song.\nThe lyrics are simply: \"I'm looking for a man in finance, trust fund, 6'5\", blue eyes…\" Her 20-second video has more than 38 million views and counting.\nAccording to \"Fair Play\" author Eve Rodsky, \"You can joke about things if they don't feel serious to you, but it's sort of like joking about reproductive rights.\"\n\"It comes back to not understanding our history,\" Rodsky said.\n\"There are a lot of single women who are looking but not finding what they want,\" Lewis added.",
      "url": "https://www.cnbc.com/2024/06/04/tiktoks-im-looking-for-a-man-in-finance-video-is-no-joke.html",
      "imgURL": "https://image.cnbcfm.com/api/v1/image/107424027-1717520705806-107424027-1717520646090-gettyimages-690423102-shangaj22couple387.jpg?v=1717520753&w=1920&h=1080"
    },
    {
      "news_number": 5,
      "title": "The coding languages that will get you a job in banking and finance, ranked",
      "summary": "Experience in these programming languages are requested in 18% and 14% of financial services job listings, respectively.\nNo other programming language occupies more than 6% of the market share for technology job listings.\nThe best object-oriented programming languages for a job in financial servicesObject oriented programming languages operate under the same broad paradigm as procedural languages, but with a key difference.\nPython, one of the big three programming languages for jobs in finance, occupies over 60% of all jobs requiring a scripting programming language.\nWhich programming languages should I learn for a job in finance?",
      "url": "https://www.efinancialcareers.com/news/programming-languages-for-a-career-in-finance",
      "imgURL": "https://cdn.filestackcontent.com/5WVFhXCHS2gLQia5FueW"
    },
    {
      "news_number": 6,
      "title": "Should you buy expensive stocks?",
      "summary": "In one sense such stock splits ought not to matter much: they merely lower the share price, usually returning it to somewhere near $100, in order to make small trades easier.\nEach Nvidia share, however, will become ten.\nTwo years ago both Alphabet and Amazon split each of their shares into 20.\nDividend yields, for instance, were once a popular tool for assessing prospective returns.\nPlainly, there is no stretch of the imagination by which these payouts explain the stocks’ spectacular returns.",
      "url": "https://www.economist.com/finance-and-economics/2024/06/05/should-you-buy-expensive-stocks",
      "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240608_FND002.jpg"
    },
    {
      "news_number": 7,
      "title": "News Flash • Westmont Finance Department Awarded Achievement",
      "summary": "",
      "url": "https://westmont.illinois.gov/CivicAlerts.aspx?AID=1999",
      "imgURL": "https://westmont.illinois.gov/Common/Images/CivicAlerts/HomeModuleIconShare.png"
    },
    {
      "news_number": 8,
      "title": "Public Finance Group Ranked in Chambers USA Guide – Jackson Walker",
      "summary": "In its first-ever guide to the top Texas firms for Public Finance, Chambers and Partners ranked Jackson Walker in the 2024 USA Guide released today.\nIn addition, Public Finance partners Rick A. Witte, Todd B.\nIn the 2024 guide, Chambers noted that Jackson Walker “has a strong Texas-based public finance practice.\nWith more than 140 years of collective experience, the Public Finance group has represented practically every type of entity that can borrow funds on a tax-exempt basis or provide tax-exempt financing in more than $200 billion of public finance transactions.\nConstruction of public infrastructure in connection with residential development, including the financing thereof, throughout the state is vitally important.",
      "url": "https://www.jw.com/news/chambers-2024-public-finance/",
      "imgURL": "https://www.jw.com/wp-content/uploads/2024/05/2024-Chambers-Public-Finance.jpg"
    },
    {
      "news_number": 9,
      "title": "Justin Young named new UCAR Chief Financial Officer",
      "summary": "Justin Young named new UCAR Chief Financial Officer Young has a long history at UCAR and has served in multiple finance leadership roles since joining the organization in 1998.\nJustin Young has been selected to serve as Chief Financial Officer (CFO) of the University Corporation for Atmospheric Research (UCAR), effective June 10, 2024.\nYoung has served within the UCAR Finance team for more than 26 years, and has spent more than six years as the organization’s Deputy Chief Financial Officer.\n“I care deeply about this organization and the talented and dedicated people who serve its mission,” said Young.\n“Justin is wholeheartedly committed to our mission, and he understands the importance of our work to society,” said UCAR President Antonio Busalacchi.",
      "url": "https://news.ucar.edu/132960/justin-young-named-new-ucar-chief-financial-officer",
      "imgURL": "https://news.ucar.edu/profiles/custom/ncar_ucar_umbrella/themes/custom/koru/libraries/koru-base/img/app-favicons/news/favicon.ico"
    },
    {
      "news_number": 10,
      "title": "Michael J. Todd named W&M’s executive VP for finance & administration",
      "summary": "Michael J. Todd, an imaginative and inspiring leader in higher education, has been named William & Mary’s executive vice president for finance & administration, President Katherine A. Rowe announced today.\nMichael J. Todd (Courtesy photo)Todd, who currently serves as vice president for finance & administration at Lehigh University, brings a wealth of leadership experience at both public and private institutions.\n“A rising star in higher education, Mike Todd brings the expertise and imagination William & Mary needs to keep evolving to excel,” Rowe said.\n“Throughout the search process, I was impressed by the commitment and passion of the faculty, staff and stakeholders with whom I met.\nPreviously, Todd served as associate vice president for research for the University of North Carolina systems.",
      "url": "https://news.wm.edu/2024/06/06/michael-j-todd/",
      "imgURL": "https://wmit-news-prod.s3.amazonaws.com/wp-content/uploads/2024/06/04143917/1260-1080x720.jpg"
    },
    {
      "news_number": 11,
      "title": "US Treasury Requests Information on AI Use in Finance",
      "summary": "The U.S. Department of the Treasury (Treasury) released a request for information on the Uses, Opportunities, and Risks of Artificial Intelligence (AI) in the Financial Services Sector.\nBuilding on Treasury’s recent work on cybersecurity and fraud in AI and recent initiatives by other federal agencies, Treasury is seeking public comment on the uses of AI in the financial services sector and the opportunities and risks presented by developments and applications of AI within the sector.\n“Treasury is proud to be playing a key role in spurring responsible innovation, especially in relation to AI and financial institutions.\nOur ongoing stakeholder engagement allows us to improve our understanding of AI in financial services,” said Under Secretary for Domestic Finance Nellie Liang.\nTreasury is seeking a broad range of perspectives on this topic and is particularly interested in understanding how AI innovations can help promote a financial system that delivers inclusive and equitable access to financial services.",
      "url": "https://www.marketsmedia.com/us-treasury-requests-information-on-ai-use-in-finance/",
      "imgURL": "https://www.marketsmedia.com/wp-content/uploads/2017/03/iStock-510674920.jpg"
    },
    {
      "news_number": 12,
      "title": "Nvidia stock pulls back after topping $3 trillion market cap mark",
      "summary": "Nvidia stock (NVDA) retreated in early trading on Thursday, after a rip-roaring rally sent the company past a $3 trillion market cap for the first time.\nWednesday's move pushed the chip giant past Apple, making it the second-most-valuable company on the US stock market before the early retreat.\nNvidia is the tech industry's go-to supplier for AI chips and integrated software.\nAMD (AMD) and Intel (INTC) are pushing forward with their own AI chips with the goal of outmaneuvering Nvidia.\nAnd with companies spending billions on AI chips, any price savings will certainly be welcome.",
      "url": "https://finance.yahoo.com/news/nvidia-stock-pulls-back-after-topping-3-trillion-market-cap-mark-141014695.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/oo3AhJBc83TAyfoH8pE76g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-06/5b3e4690-2146-11ef-97df-2f3b499b3ad9"
    },
    {
      "news_number": 13,
      "title": "Why North Africa's nomad community needs climate finance",
      "summary": "Frontline communities around the world are shouldering the deleterious injustices of climate change, especially in Africa despite it emitting only around 4% of total global carbon emissions.\nAs someone familiar with the experience of displacement, I have witnessed how climate change strikes at the heart of our culture and identity.\nNow, the Intergovernmental Panel on Climate Change predicts a doubling of drought frequency in North Africa to come.\nConflicts over territory and diminishing water-dependent resources, once unthinkable, now disrupt the social cohesion and hospitality for which nomadic communities are renowned.\nRich historic-emitter countries must honour their obligations to provide climate finance under the United Nations Framework Convention on Climate Change (UNFCCC).",
      "url": "https://www.climatechangenews.com/2024/06/06/north-africas-disappearing-nomad-why-my-community-needs-climate-finance/",
      "imgURL": "https://cdn.climatechangenews.com/files/2024/06/06135945/Morocco-nomad.jpeg"
    },
    {
      "news_number": 14,
      "title": "New board advisors help Center for Municipal Finance broaden its scope",
      "summary": "The Center for Municipal Finance at the University of Chicago's Harris School of Public Policy has appointed six new members to its board of advisors.\n\"It was a chance to broaden the scope, bring in some other perspectives,\" Center for Municipal Finance Director Justin Marlowe said of its new board advisors.\n\"The Center for Municipal Finance has helped students and faculty leverage traditional avenues and pair them with modern media and outreach.\nDaghestani, like his fellow appointees, has \"already added value to the student experience,\" said Center for Municipal Finance Director Justin Marlowe.\nDaghestani said his recent experience with Harris School students taught him that the school is preparing them well.",
      "url": "https://www.bondbuyer.com/news/center-for-municipal-finance-adds-to-board-of-advisors",
      "imgURL": "https://arizent.brightspotcdn.com/dims4/default/2fcbc9a/2147483647/strip/true/crop/1800x945+0+182/resize/1200x630!/quality/90/?url=https%3A%2F%2Fsource-media-brightspot.s3.us-east-1.amazonaws.com%2F9c%2F4b%2Fa1e560c14e75a1632b616c5df591%2Fjmarloweharris.png"
    },
    {
      "news_number": 15,
      "title": "How Finance Officers Can Shake Things Up",
      "summary": "Good trouble.”Local government finance officers might be the last people you would think of as troublemakers of any kind.\nTheir job, after all, is to keep cities and counties out of trouble by ensuring that tax dollars are managed responsibly.\nThe truth is that finance officers are people too, not human calculators.\nA recent paper by the Government Finance Officers Association argues that “segmented pricing” — charging people based on their ability and willingness to pay — can lead to higher revenue collection.\nSingle-family neighborhoods typically don’t produce enough tax revenue to maintain their infrastructure over the long term.",
      "url": "https://www.governing.com/finance/how-finance-officers-can-shake-things-up",
      "imgURL": "https://erepublic.brightspotcdn.com/dims4/default/999559b/2147483647/strip/true/crop/840x408+0+7/resize/1440x700!/quality/90/?url=http%3A%2F%2Ferepublic-brightspot.s3.us-west-2.amazonaws.com%2F4b%2F95%2F02a1f74642e0954f51fe77e967fd%2Fkleine-budgets-sidewalk.jpg"
    },
    {
      "news_number": 16,
      "title": "Best Financial Innovations 2024",
      "summary": "In October, it powered the first digital bond issuance on Euroclear’s Digital Financial Market Infrastructure.\nInnovation: New Cash Management ProgramCompany: Intesa SanpaoloThe bank’s New Cash Management Program consists of two innovative solutions for corporate customers: the Multi-Currency Optimizer and Virtual Account Management.\nInnovation: Jeel WeyayCompany: Weyay BankFebruary 2024 marked the launch of Jeel Weyay, an innovative digital banking experience for children ages 8-14, featuring a creatively designed card and access to their banking application.\nTop Financial Innovations: Corporate Banking Innovation Company Omnify Arab Bank Mobile App Design Bank Millennium Workforce Payments Platform Papaya Global Smart Nudge Standard BankArab Bank’s innovation lab.\nTop Financial Innovations: SME Innovations Innovation Company Pulsoo Banco BPI Business Banking ePay Boubyan Bank Naturália OTP GroupInnovation: PulsooCompany: Banco BPIThe Pulsoo app gives small-business owners a holistic approach to managing financial and regulatory positions.",
      "url": "https://gfmag.com/banking/best-financial-innovations-2024/",
      "imgURL": "https://s44650.pcdn.co/wp-content/uploads/2024/06/best-financial-innovations-2024-scaled.jpg"
    },
    {
      "news_number": 17,
      "title": "Now Updated: PACs' Pre-Primary Campaign Finance Reports",
      "summary": "Now Updated: PACs' Pre-Primary Campaign Finance ReportsVPAP has integrated throughout its website the campaign finance transactions included in PACs' pre-primary disclosures that were due on Monday, June 3.\nA new law implemented last year created a different filing schedule for state PACs, with some dates occurring outside of candidate reporting deadlines.\nBelow are each party's Top 5 Leadership PACs who raised the most money during the filing period.\nRepublicans$372,050 A Safer Virginia PAC (Attorney General Jason Miyares) $314,498 Spirit of Virginia (Governor Glenn Youngkin) $211,960 Winsome PAC (Lt.\nJay Jones) $8,800 The Way Ahead (Former Gov.",
      "url": "https://www.vpap.org/updates/4776-now-updated-pacs-pre-primary-campaign-finance-reports-2024/",
      "imgURL": "https://s3.amazonaws.com/vpap-production/static/base/share_fb.png"
    },
    {
      "news_number": 18,
      "title": "MBTA Audit and Finance Committee - June 6, 2024",
      "summary": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code",
      "url": "https://www.statehousenews.com/mbta-audit-and-finance-committee---june-6-2024/collection_4a162a6a-240f-11ef-bb60-97cf1044d4cc.html",
      "imgURL": "https://bloximages.chicago2.vip.townnews.com/statehousenews.com/content/tncms/assets/v3/editorial/3/5d/35d00968-240f-11ef-8e77-7b082910b517/6661c4906bf50.preview.jpg?crop=1920%2C1008%2C0%2C35&resize=1200%2C630&order=crop%2Cresize"
    },
    {
      "news_number": 19,
      "title": "Has DBS Group (DBSDY) Outpaced Other Finance Stocks This Year?",
      "summary": "Investors interested in Finance stocks should always be looking to find the best-performing companies in the group.\nIs DBS Group Holdings Ltd (DBSDY) one of those stocks right now?\nDBS Group Holdings Ltd is one of 854 companies in the Finance group.\nThe Finance group currently sits at #12 within the Zacks Sector Rank.\nThis shows that DBS Group Holdings Ltd is outperforming its peers so far this year.",
      "url": "https://finance.yahoo.com/news/dbs-group-dbsdy-outpaced-other-134010665.html",
      "imgURL": "https://media.zenfs.com/en/zacks.com/105b2acef7bf0873f24b78932b1fdc3c"
    },
    {
      "news_number": 20,
      "title": "FBN® Finance Surpasses $2 Billion in Financing Provided to Growers",
      "summary": "Farmers turn to FBN Finance as they seek relief from high interest ratesCHICAGO & SAN CARLOS, Calif., June 06, 2024--(BUSINESS WIRE)--Farmers Business Network, Inc. (FBN®), the AgTech platform and farmer-to-farmer network, today announced that its lending unit, FBN Finance, has surpassed $2 billion in financing provided to growers across the United States.\nIn recent months, FBN Finance further streamlined the financing process for farmers with its digital payments platform for operating line customers.\nFBN Finance has ag loan advisors located throughout U.S. rural communities.\nEarlier this spring, FBN Finance surpassed more than $1 billion in Operating Lines.\nThose looking to learn more about financing solutions from FBN Finance should visit www.fbn.com/financing or call 866-551-3950.",
      "url": "https://finance.yahoo.com/news/fbn-finance-surpasses-2-billion-140000492.html",
      "imgURL": "https://media.zenfs.com/en/business-wire.com/c265ee5046c167984b89e48d4b3a47ef"
    },
    {
      "news_number": 21,
      "title": "IRS says it will refund taxes extracted from Ohioans who got financial assistance after Norfolk Southern derailment disaster",
      "summary": "Most people who received money from Norfolk Southern in the wake of last year’s fiery train derailment in eastern Ohio won’t have to pay taxes on millions of dollars in aid payments after all.\n“I don’t know why they didn’t do that from the very beginning,” East Palestine resident Misti Allison said.\nLater this month, they’ll be able to hear the result of the National Transportation Safety Board’s investigation into the derailment at a hearing in East Palestine.\nU.S. Sen. Sherrod Brown of Ohio said it shouldn’t have taken the IRS this long to realize the derailment was a disaster.\n“This is a long overdue step — the people of East Palestine should never have had to pay taxes on assistance they needed in the wake of the train derailment,” Brown said.",
      "url": "https://fortune.com/2024/06/05/irs-refund-taxes-disaster-ohio-brown/",
      "imgURL": "https://fortune.com/img-assets/wp-content/uploads/2024/06/GettyImages-1247414116-e1717631611331.jpg?resize=1200,600"
    },
    {
      "news_number": 22,
      "title": "A very basic guide to the latest GameStop stock surge for people who know nothing about finance",
      "summary": "Overwhelmed by the news surrounding the GameStop stock surge?\nThat’s the same year he started posting analyses of GameStop stock in the Reddit forum r/wallstreetbets, which has 16 million members.\n“The idea that I used social media to promote GameStop stock to unwitting investors and influence the market is preposterous,” Gill said.\nAfter Gill posted the gamer meme on X, even without the mention of GameStop or stock, GameStop stock surged again.\nThe post had around 21,000 comments, with users cheering Gill’s return and chiming in to say they would be buying GameStop stock the following morning.",
      "url": "https://www.yahoo.com/news/a-very-basic-guide-to-the-latest-gamestop-stock-surge-for-people-who-know-nothing-about-finance-170819798.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/97nmhYMNRDtdAlyCozFDnQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2021-02/7061fdf0-7591-11eb-ae6f-aabe36c8914a"
    },
    {
      "news_number": 23,
      "title": "FAVO Capital & Stewards Investment Capital Win Structured Finance Deal of the Year at Global Private Banking Innovation Awards 2024",
      "summary": "This time at the Global Private Banking Innovation Awards 2024 in the category of Structured Finance Deal of the Year.\nShaun Quin - President of FAVO Capital, Suneeta Motala - Marketing Director of Stewards Investment Capital & Nathaniel Tsang Mang Kin - Head of Financial Operations at Stewards Investment Capital.\nGlobal Private Banking Innovation Awards 2024 are known as the world's most authoritative and transparently judged private wealth awards recognising the most innovative products and services, innovative technological and digital capabilities, scalable customisations across the global private banking landscape.\nCongratulations to the entire team at Stewards Investment Capital & FAVO Capital for this well-deserved award.\"\nFor more information visit: favocapital.comAbout Stewards Investment CapitalStewards Investment Capital is boutique investment advisory leader with a 25-year legacy within the Stewards affiliation of companies.",
      "url": "https://www.morningstar.com/news/accesswire/872556msn/favo-capital-stewards-investment-capital-win-structured-finance-deal-of-the-year-at-global-private-banking-innovation-awards-2024",
      "imgURL": "https://www.morningstar.com/favicon.ico"
    },
    {
      "news_number": 24,
      "title": "Women in Business Retreat opens up communications, paths in finance",
      "summary": "Around one table, a mix of Bryant students, local high school students, faculty, and industry professionals had only just met each other, and the gulfs between their lives and ages and levels of experience seemed wide.\nThe idea for the on-campus event, says Derderian, came from her work teaching basic finance education to high school students, with Bryant Finance students helping to deliver the lesson plan.\nBryant students, faculty, and staff pose with the famous \"Fearless Girl\" statue in New York City.\nAmong the high school students on campus that day was Cortes’s younger sister, Alexandra.\nIf these students start now in high school, they’ll be so much better prepared,” she suggested.",
      "url": "https://news.bryant.edu/women-business-retreat-opens-communications-paths-finance",
      "imgURL": "https://news.bryant.edu/sites/news/files/2024-06/Womens%20business%20retreat%20header-compressed.jpg"
    },
    {
      "news_number": 25,
      "title": "Why Arm chips pose a threat to Intel and AMD’s PC dominance",
      "summary": "Intel (INTC) and AMD (AMD) are staring down a new competitor in the PC market: Arm (ARM).\nBut Microsoft, Arm, and Qualcomm say they’ve worked out the kinks — and that Arm-based PCs will be as reliable as Intel and AMD-based offerings.\nMicrosoft turned to Arm-based Qualcomm chips to power its new Surface Pro tablet and Surface Laptop, rather than Intel or AMD processors.\nAccording to Reuters, Arm CEO Rene Haas says other other manufacturers will be rolling out Arm chips in the future.\nThe companies both rolled out their own answers to the Arm-based Qualcomm chips during their respective keynotes at Computex 2024 in Taipei, Taiwan, this week.",
      "url": "https://finance.yahoo.com/news/why-arm-chips-pose-a-threat-to-intel-and-amds-pc-dominance-180840226.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/kng4SzLykKC0zRAR1sX6Jg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-06/619cbcc0-235c-11ef-aff5-ddb4cf5836eb"
    },
    {
      "news_number": 26,
      "title": "Most Innovative Banks Globally 2024",
      "summary": "The next step is the adoption of generative AI to increase our capabilities further.”HSBCHSBC delivered the world’s first multicurrency digital bond offering in February 2024.\nIn addition to being a game-changer for future digital bond issuances, this was the largest-ever digital bond deal.\nThe multicurrency digital bond issuance included the US dollar, Chinese offshore renminbi, Hong Kong dollar, and the euro.\nSantanderBy migrating its corporate and investment banking business to a new cloud-based digital banking platform, Gravity, Santander can now benefit from parallel processing.\nSantander estimates that the Gravity platform will operate more than a trillion technical executions within the bank’s systems every year.",
      "url": "https://gfmag.com/banking/most-innovative-banks-globally-2024/",
      "imgURL": "https://s44650.pcdn.co/wp-content/uploads/2024/06/most-innovative-banks-2024.jpg"
    },
    {
      "news_number": 27,
      "title": "European banks are making heady profits in Russia",
      "summary": "Raiffeisen is one of a dozen lenders that Russia deems “systemically” important to its economy.\nThe combined profits of the five EU banks with the largest Russian operations have tripled, reaching nearly €3bn in 2023.\nIn May America threatened to curb Raiffeisen’s access to its financial system because of the bank’s Russian dealings.\nRussia, for its part, is starting to seize the assets of Western banks it deems “unfriendly”.\nWestern lenders’ Russian paper profits are at risk of turning to ash.",
      "url": "https://www.economist.com/finance-and-economics/2024/06/06/european-banks-are-making-heady-profits-in-russia",
      "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240608_FNP001.jpg"
    },
    {
      "news_number": 28,
      "title": "Bloomberg Businessweek: From HBCU to Finance",
      "summary": "Browse all episodesBloomberg Businessweek: From HBCU to FinanceBloomberg Businessweek From HBCU to Finance Arrow Right 26:14Watch Carol and Tim LIVE every day on YouTube: http://bit.ly/3vTiACF.\nMarcus Shaw, CEO at AltFinance, discusses helping students at Historically Black Colleges and Universities enter the world of private equity.\nFort Worth, Texas Mayor Mattie Parker talks about the development and expansion of one of the fastest-growing cities in the country.\nHosts: Tim Stenovec and Molly Smith.\nProducer: Paul Brennan.",
      "url": "https://www.bloomberg.com/news/audio/2024-06-06/bloomberg-businessweek-from-hbcu-to-finance-podcast?srnd=businessweek-v2",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/icvZgtyvDS60/v0/500x500.png"
    },
    {
      "news_number": 29,
      "title": "What does modern finance look like? Planful customers share financial planning field lessons",
      "summary": "(Andrea Sorenson (YMCA) at Planful Perform '24)Is there such a thing as modern financial planning?\nModern finance - as defined by customersPlanful has framed modern FP&A in an aspirational context, via a \"continuous planning\" mantra.\nAfter all, if \"modern finance\" is simply an elusive/feel-good concept designed to sell more software, we should push back.\nAfter the event, I went back into the interviews, in search of standout examples of financial planning in action.\nMy takeWhatever we consider \"modern\" in a financial planning context is going to vary by industry, and by organization.",
      "url": "https://diginomica.com/what-does-modern-finance-look-planful-customers-share-financial-planning-field-lessons",
      "imgURL": "https://diginomica.com/sites/default/files/images/2024-06/ymca%20-%20andrea%20sorenson.jpg"
    },
    {
      "news_number": 30,
      "title": "Pensions vs. lottery: which has the best chance of financial success?",
      "summary": "Many people dream of a lottery win but you could have better odds of financial success by investing in your pension.\nMillions play the National Lottery or EuroMillions each week, hoping to win multimillion-pound jackpots.\nThe prizes may be life-changing but there’s only a \"slim chance\" of actually winning, said retirement savings platform PensionBee.\nInstead, you could be better off putting the £2 cost of a weekly ticket into your pension pot.\nFrom our morning news briefing to a weekly Good News Newsletter, get the best of The Week delivered directly to your inbox.",
      "url": "https://theweek.com/personal-finance/pensions-vs-lottery-which-has-the-best-chance-of-financial-success",
      "imgURL": "https://cdn.mos.cms.futurecdn.net/Apq3s2BT3oU2qwYPsRiHRg-1200-80.jpg"
    },
    {
      "news_number": 31,
      "title": "Pathward Research Reveals the Balancing Act Executives Face as they Navigate Delivering Embedded Finance Solutions",
      "summary": "Eighty-two percent of U.S. executives who are considering embedded finance solutions plan to implement them in the next two years.\nNot surprisingly, the research shows that the expansion of embedded finance solutions is expected to take place rapidly.\nAmong the executives who currently offer embedded finance solutions, nearly all have seen embedded finance as a revenue driver, including 53% who note it is a primary driver.\nPathward works closely with our partners to build strong risk, fraud and compliance frameworks into these embedded finance solutions.\"\nExecutives Acknowledge Embedded Finance Comes with ComplexitiesAs with any new fintech solution, executives have concerns when it comes to embracing embedded finance.",
      "url": "https://finance.yahoo.com/news/pathward-research-reveals-balancing-act-120700021.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/Bk6wdh5sKivZ41mZvCpjaA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD00MTM-/https://media.zenfs.com/en/business-wire.com/d8261f392af1a43cda3cf7010a789535"
    },
    {
      "news_number": 32,
      "title": "Innovate Finance Launches Second Pride in FinTech Powerlist",
      "summary": "From The Markets Innovate Finance Launches Second Pride in FinTech PowerlistInnovate Finance, the industry body for UK FinTech, has launched its second Pride in FinTech Powerlist 2024.\nThe initiative, supported by Google and Zopa Bank, is part of Innovate Finance’s ongoing commitment to champion diversity in the UK FinTech and Financial Services industry.\nThrough the Pride in FinTech initiative, Innovate Finance is working to create a safe space for the LGBTQIA+ community and inspire future generations of the industry.\nOur hope is that this Powerlist helps share the stories of these individuals who are inspiring current and future generations.”Lou Smith, Chair of Innovate Finance, said: “We are excited to launch our second Pride in FinTech 2024 in celebration and recognition of the LGBTQIA+ community within the FinTech sector.\nMore action is needed to boost diversity and inclusion in the industry, and Pride in FinTech will help us spotlight the diverse voices in UK FinTech.",
      "url": "https://www.marketsmedia.com/innovate-finance-launches-second-pride-in-fintech-powerlist/",
      "imgURL": "https://www.marketsmedia.com/wp-content/uploads/2015/06/second-wave-of-fintech-innovation-at-hand.jpg"
    },
    {
      "news_number": 33,
      "title": "Milwaukee Public Schools submits missing financial information to state",
      "summary": "Milwaukee Public Schools submitted missing financial data and a corrective action plan to the Department of Public Instruction, which could mean the district won’t lose millions of dollars in state funding.\n“MPS also provided initial submission of content related to a corrective action plan, and we are working with them to finalize a corrective action plan.\nTo avoid the financial cuts, the state needs information from MPS by July 1 and a corrective action plan that will then face DPI approval.\nMPS hired a financial consultant Todd Gray this week, who recently assisted the Glendale-River Hills School District.\nThe former superintendent of the Waukesha School District will be paid up to $48,000, according to the district.",
      "url": "https://www.wpr.org/news/milwaukee-public-schools-submits-missing-financial-information-to-state",
      "imgURL": "https://www.wpr.org/wp-content/uploads/2023/11/board_meeting.png"
    },
    {
      "news_number": 34,
      "title": "Want to avoid woke stockmarket rules? List in Texas",
      "summary": "“E quities in Dallas ,” cried the traders in “Liar’s Poker”, an account by Michael Lewis of his life as a junior banker in the late 1980s.\nDemotion from New York to the backwater of Texas would be a humiliation.\nWho wants to sling shares to yokels?\nOn June 4th an upstart Texas Stock Exchange ( TxSE ) said it had received $120m in funding from financial giants including BlackRock, a fund manager, and Citadel Securities, a marketmaker.\nThe TxsE will, its boss wrote, be the best-capitalised challenger to the New York Stock Exchange.",
      "url": "https://www.economist.com/finance-and-economics/2024/06/06/want-to-avoid-woke-stockmarket-rules-list-in-texas",
      "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240608_FNP002.jpg"
    },
    {
      "news_number": 35,
      "title": "Elite Capital & Co. Wins the ACQ5 “Project Management & Finance Company of the Year”, the Oldest UK's Coveted Award",
      "summary": "Elite Capital & Co. LimitedLONDON, June 06, 2024 (GLOBE NEWSWIRE) -- Mr. George Matharu, President of Elite Capital & Co. Limited, announced today the success of being the \"Project Management & Finance Company of the Year 2024\" by ACQFIVE Global Awards, the Oldest UK's Coveted Award, as the result of enormous effort and teamwork within the company since it was founded in 2012.\nNews-6June2024-1200“We have received a letter stating that Elite Capital & Co. Limited has been awarded the Project Management & Finance Company of the Year by ACQFIVE Global Awards 2024, as being one of the influencers of global finance,” Mr. George Matharu said.\nElite Capital & Co. Limited is a Financial Management company that provides project-related services including Management, Consultancy, and Funding, particularly for large infrastructure and mega commercial projects.\nElite Capital & Co. Limited offers a wealth of experience in Banking and Financial transactions and has a range of specialized advisory services for private clients, medium and large corporations as well as governments.\nThe ACQFIVE Global Awards mark a significant milestone as they celebrate their 21st anniversary.",
      "url": "https://finance.yahoo.com/news/elite-capital-co-wins-acq5-093500796.html",
      "imgURL": "https://media.zenfs.com/en/globenewswire.com/1e9ae20757b5f04f9c19fcfa9115b85b"
    },
    {
      "news_number": 36,
      "title": "US weekly jobless claims edge higher, Q1 labor costs revised lower",
      "summary": "\"The level (of weekly jobless claims) remains in a range that suggests the labor market remains tight,\" said Thomas Simons, U.S. economist at Jefferies.\nPRODUCTIVITY, LABOR COSTS REVISED LOWERU.S. worker productivity grew slightly less than previously estimated in the first quarter but exceeded market expectations, and unit labor costs rose by less than first thought, data from the Labor Department also showed on Thursday.\nStory continuesUnit labor costs rose at a 4.0% annualized rate, down from the first estimate of 4.7%.\nEconomists had projected labor costs to be revised up to 4.9%.\nProductivity accelerated and labor costs were subdued through much of 2023, ending at 3.5% and unchanged, respectively, in the fourth quarter.",
      "url": "https://finance.yahoo.com/news/us-weekly-jobless-claims-rise-124221918.html",
      "imgURL": "https://media.zenfs.com/en/reuters-finance.com/623850a1ae43f2af0f3a9f03ca35bc0d"
    },
    {
      "news_number": 37,
      "title": "More debate among Augusta officials over bid to audit parks and rec department",
      "summary": "Jennifer MillerSpecial to The Augusta ChronicleAfter reviewing more information, hearing more recommendations, and responding to more motions, Augusta commissioners this week sent a bid proposal to audit the Parks and Recreation Department back to committee for review.\nLast week, during a Finance Committee meeting, commissioners questioned how a bid to conduct the audit that arrived after the deadline was recommended for approval by city staff.\nOn May 14, the commission’s Finance Committee was presented with a package recommending the city hire Marcum LLP to conduct an independent financial audit of the recreation department for $141,367.\nMore:Bid to audit Augusta parks and recreation department questioned by commissionersAfter consulting with attorneys and verifying a timestamp on the package, a staff evaluation committee reconsidered UHY’s bid of $71,664 and changed its recommendation.\nThat’s what the problem is.”After more debate, the commission unanimously voted to send it back to the Finance Committee.",
      "url": "https://www.augustachronicle.com/story/news/politics/2024/06/06/augusta-finance-committee-to-review-bid-to-audit-parks-and-rec-department/73995089007/",
      "imgURL": "https://www.augustachronicle.com/gcdn/presto/2023/06/09/NAUG/8e026bfd-541d-4254-9cd8-4e3659c7efb3-NEWS-AUResearchPendletonKingPark-2023-07-KG.JPG?crop=8255,4644,x0,y0&width=3200&height=1801&format=pjpg&auto=webp"
    },
    {
      "news_number": 38,
      "title": "Climate-Related Financial Risk: How, When, And For Whom?",
      "summary": "Mapping The Climate Risk TrajectoryThe potential impacts of climate change on financial systems manifest through two primary channels: physical risk and transition risk.\nPhysical risk relates to damage caused to property, land, and infrastructure by extreme weather and natural disasters.\nBoth types of risk will likely rise over the next two decades, with transition risk escalating with efforts to mitigate carbon emissions and physical risk manifesting as global temperatures rise.\nAfter 2050, physical risk is expected to dominate, though transition risk will also persist if climate action falls short before this date.\nCase When Climate Risk Is Not Considered An Investment RiskThere are instances where climate risk may not be perceived as an investment risk, especially when externalities have not been adequately addressed.",
      "url": "https://www.climatepolicyinitiative.org/climate-related-financial-risk-how-when-and-for-whom/",
      "imgURL": "https://www.climatepolicyinitiative.org/wp-content/uploads/2024/06/pexels-plato-terentev-3804555-5911686-scaled.jpg"
    },
    {
      "news_number": 39,
      "title": "Coresky Initiates Seed Round of Financing Following Strategic Brand Upgrade",
      "summary": "CoreskySingapore , June 06, 2024 (GLOBE NEWSWIRE) -- Coresky, as a leading player in its overall ecological business landscape, is thrilled to announce its official entry into the seed round of financing stage, marking a significant milestone following a strategic brand upgrade in the first half of 2024.\nCoresky has spent the past six months focusing on product enhancements, business expansion and strategic development to achieve this critical moment.\nThe collaboration between Coresky and Tido Capital offers comprehensive ecological incubation support for allocation projects, including investment, financial advisory, strategic guidance, marketing, branding, presale facilitation, and listing aid.\nCoresky converts the primary market investment quota limited to venture capital institutions in the crypto market into divisible asset-packaged NFTs that can be allocated to retail investors, and provides good liquidity.\nThe projects successfully allocated on Coresky so far are TrendX, Coral Finance, CESS, Kartparty, KIP, LumiTerra, OORT, Atem, Copycat Finance,etc.",
      "url": "https://finance.yahoo.com/news/coresky-initiates-seed-round-financing-160000725.html",
      "imgURL": "https://media.zenfs.com/en/globenewswire.com/a7e14a6663e89732f8c1db02c587a9cc"
    },
    {
      "news_number": 40,
      "title": "Janet Yellen warns AI in finance poses ‘significant risks’",
      "summary": "For instance, Yellen will note that the “complexity and opacity” of AI models could cause problems.\nThe problem is that many AI models operate as a “black box,” meaning their inner workings are impenetrable to outsiders.\nIf Wall Street firms are relying on mysterious AI models, regulators will struggle to understand how safe their systems truly are.\nLikewise, Yellen will say there is a “concentration” risk linked to the fact that there are only a few companies providing AI models.\nAI models have a history of making stuff up, often in a convincing way.",
      "url": "https://www.cnn.com/2024/06/05/business/janet-yellen-artificial-intelligence/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2154814040.jpg?c=16x9&q=w_800,c_fill"
    }
  ],
  "politics": [
    {
      "news_number": 0,
      "title": "Religion and politics create the sharpest divides over LGBTQ+ Americans, poll shows",
      "summary": "Politics and religion, not education, race or income, are the biggest indicators of how Americans feel about LGBTQ+ rights and the place of queer people in society.\n“A lot of members have stopped going because they have gay and lesbian children, and of course they feel differently,” Jackson said.\nIn 1985, nearly 2 in 3 people said they would be very upset if their child was gay or lesbian.\nCalifornia Americans deeply divided on issues involving queer children, poll shows Americans want kids to learn LGBTQ+ history.\nJackson, the Ventura County grandmother, said she worries about the increasing visibility of transgender, nonbinary, gay and lesbian people — in entertainment, politics and advertising.",
      "url": "https://www.latimes.com/politics/story/2024-06-06/lgbtq-poll-religion-politics-americans",
      "imgURL": "https://ca-times.brightspotcdn.com/dims4/default/d64bf3d/2147483647/strip/true/crop/5300x2783+0+375/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F9e%2Fc0%2Fdf01e2934c28809ea14f9e8c2ade%2Fgettyimages-2149254052.jpg"
    },
    {
      "news_number": 1,
      "title": "Jun 8th 2024 Edition",
      "summary": "Narendra Modi looks likely to serve a third term as India’s prime minister, after his Bharatiya Janata Party and its allies won a slim majority.\nThe ruling alliance won 293 seats, compared with the opposition’s 234.\nMr Modi had claimed that they would win upwards of 400 seats.\nThe BJP itself lost 63 seats compared with the last election in 2019.\nImran Khan, a former prime minister of Pakistan, was acquitted of leaking state secrets in a ruling by the high court in Islamabad.",
      "url": "https://www.economist.com/the-world-this-week/2024/06/06/politics",
      "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240608_WWP002.jpg"
    },
    {
      "news_number": 2,
      "title": "Video: Wisconsin voters share frustrations with 2024 rematch",
      "summary": "How relevant is this ad to you?\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues",
      "url": "https://www.cnn.com/2024/06/04/politics/video/winsconsin-voters-zeleny-hnk-digvid",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/20240605-3-way-splits.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 3,
      "title": "DOD failed to share rules on partisan politics before election season",
      "summary": "The Pentagon failed to properly train and guide troops about off-limits political activities ahead of the 2024 presidential election season, a federal watchdog said.\nThe IG asked the Pentagon to share a memorandum immediately with all service members to outline what they can’t do during a presidential election.\nAttached was a “quick guide” on what service members could and couldn’t do according to DOD rules.\nThe IG determined the memo lacked comprehensiveness and failed to reach all service members.\nFrom 2019 through February 13, 2024, the DOD Inspector General hotline received 58 calls about troops engaging in partisan activities, the IG said.",
      "url": "https://www.militarytimes.com/news/your-military/2024/06/04/dod-failed-to-share-rules-on-partisan-politics-before-election-season/",
      "imgURL": "https://www.militarytimes.com/resizer/tD1CYgX3mJYRPjdp1EyTSGTFs2Q=/1024x0/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/archetype/RKKA3AX7QNFUZEOSUVHCGFAI3E.jpg"
    },
    {
      "news_number": 4,
      "title": "Trump again suggests political opponents may face prosecution, too",
      "summary": "Former president Donald Trump on Tuesday criticized his conviction in New York and suggested that his political opponents might face similar prosecution, even as he also said it would be “terrible” to jail his former rival Hillary Clinton.\nTrump, the presumptive Republican nominee for president, had falsely claimed in another recent interview that he never called for Clinton to be jailed.\nAdvertisement“But they want to do it,” Trump said, appearing to refer to his opponents.\nAt a July 2016 rally, when some in the crowd called for Clinton to be jailed, Trump said he would not be “Mr.\n“You know what, I’m starting to agree with you.”But after his election, on Nov. 9, 2016, Trump changed his tune.",
      "url": "https://www.washingtonpost.com/politics/2024/06/04/trump-newsmax-opponents-jail-clinton/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YOF3SD6WEOQ6PG7GGX572TLYYQ_size-normalized.jpg&w=1440"
    },
    {
      "news_number": 5,
      "title": "Fox News Politics: Potential Perjury",
      "summary": "Welcome to Fox News’ Politics newsletter with the latest political news from Washington D.C. and updates from the 2024 campaign trail.\nWhat's happening…- Biden accused of trying to ‘out-Republican Republicans’- Squad Democrats furious over Netanyahu invitation to congress- Trump catching up to Biden on fundraisingProposed PerjuryAs Hunter Biden faces criminal gun charges in Delaware, House Republicans are sending criminal referrals to the Justice Department recommending that the president's son and brother be charged with making false statements to Congress about \"key aspects\" of the impeachment inquiry of President Biden, Fox News Digital has learned.\nHouse Oversight Committee Chairman James Comer, R-Ky., House Judiciary Committee Chairman Jim Jordan, R-Ohio, and House Ways and Means Committee Chairman Jason Smith, R-Mo., who have been leading the inquiry, sent the criminal referrals of Hunter Biden and James Biden to Attorney General Merrick Garland and Special Counsel David Weiss on Wednesday, saying the alleged false statements \"implicate Joe Biden’s knowledge and role in his family’s influence peddling schemes and appear to be a calculated effort to shield Joe Biden from the impeachment inquiry.\"\nWhite House‘LIKE A SON’: Former top Biden adviser with deep business ties to China spotted inside Hunter Biden gun trial …Read more'MISTAKE': Biden accused by own party of 'trying to out-Republican the Republicans' on border …Read more'HE ADMIRES DICTATORS': Kamala Harris tells Jimmy Kimmel that he's right to be worried about what Trump could do to him …Read more'THIS IS JOE BIDEN': Biden's old age concerns aren't 'going away' soon, CNN reporter says …Read more'FOUR MORE YEARS, PAUSE': 5 recent gaffes by President Biden …Read more'NATIONAL SECURITY ISSUE': Former WH doctor raises alarms on Biden's mental state after WSJ report …Read moreCapitol Hill'TOO DANGEROUS': Gaetz pushes immigration ban on this nationality …Read more'TOO MUCH AT STAKE': Nancy Mace confronts House Republican who endorsed her opponent …Read more'SECOND' MATTERS: Lawmakers invoke Hunter Biden in gun law chats …Read more'IT'S ABSURD': 'It's absurd': Congress takes bipartisan action after Cuban officials' tour secure parts of major airport …Read more'FULL OF IT': Possible McConnell replacement takes Democrat IVF claims head on with major announcement …Read moreSUPREME ETHICS: Dems accused of ethics violations after demanding Justice Alito recusal …Read more'FEARMONGERING': Contraception bill would bulldoze religious liberty, 'parental rights,' Republicans say …Read more'ACCUSED WAR CRIMINAL': Squad Dems furious at Netanyahu being invited to Congress …Read moreTales from the Campaign TrailLEFT OUT: 'The View' co-host warns Biden will 'lose' if he lives in fear of the left-wing …Read more'TRUST OF VOTERS': New Mexico DA who indicted Alec Baldwin fends off primary challenge …Read moreMAGA MUDSLINGING: Brutal swing state primary takes center stage as accusations of ‘disloyalty’ to Trump swirl …Read moreMAGA BUCKS: Trump catching up to Biden's fundraising with super PAC …Read moreTrials and TribulationsPUT ON PAUSE: Georgia court freezes Fani Willis' sweeping election case against Trump …Read more'PROTECT THE INTEGRITY': Manhattan prosecutors oppose Trump request to lift gag order, urge court to 'protect the integrity' of case …Read moreAcross AmericaPARTY OVER CLIMATE: NY's Dem governor indefinitely halts congestion pricing plan reportedly over November concerns …Read moreSubscribe now to get Fox News Politics newsletter in your inbox.",
      "url": "https://www.foxnews.com/politics/fox-news-politics-potential-perjury",
      "imgURL": "https://static.foxnews.com/foxnews.com/content/uploads/2022/05/Hunter-joe-CC-closer.jpg"
    },
    {
      "news_number": 6,
      "title": "Andy Kim upended New Jersey politics. Now he’s on track to become a senator",
      "summary": "Now he’s on track to become a senatortoggle caption Seth Wenig/APAndy Kim couldn’t rest one evening last September.\nHer candidacy added a layer of high-profile political nepotism to a primary race already shaped by corruption as Menendez refused to drop out.\nIn March, Murphy dropped out of the Senate primary race.\nA federal appeals court upheld a preliminary injunction that bars the use of the line balloting system in Tuesday’s Democratic primary.\n'”Kim readily admits he doesn’t have all the answers to that question, but if he is elected this November, it won’t involve toeing the party line.",
      "url": "https://www.npr.org/2024/06/04/nx-s1-4951228/andy-kim-upended-new-jersey-politics-now-hes-on-track-to-become-a-senator",
      "imgURL": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4977x2800+0+0/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F9d%2Ff5%2F4a0a0d0e4c1085bd5ed1a8ae4669%2Fap24064833090836.jpg"
    },
    {
      "news_number": 7,
      "title": "The Boston Globe",
      "summary": "US to send new $225m military aid package to Ukraine, officials sayThe new aid package comes as President Biden used his speech at the American cemetery in Normandy to vow that the US “will not walk away” from the defense of Ukraine and allow Russia to threaten more of Europe.",
      "url": "https://www.bostonglobe.com/nation/politics/",
      "imgURL": "https://www.bostonglobe.com/pf/resources/images/logo-bg.jpg?d=477"
    },
    {
      "news_number": 8,
      "title": "Adults care about gender politics way more than kids, doctor says. So why is it such a big deal?",
      "summary": "\"A big hope for the book is that it'll expand the nuance through which people think about gender,\" Turban says over a recent Zoom call.\nIt seems like people love to cherry-pick data points that fit their viewpoint (either for or against gender-affirming care).\nSomething that gets missed a lot in talking about this is that some kids are going to go on puberty blockers.\nWhat I gather is that kids are talking about trans issues, but not in the same way that adults are talking about it.\nAnd so I'm hesitant to, to necessarily predict what things are going to be like in five years.",
      "url": "https://www.usatoday.com/story/life/health-wellness/2024/06/04/trans-kids-gender-identity-politics-jack-turban/73956648007/",
      "imgURL": "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/04/15/USAT/73333891007-20230401-t-041152-z-771251485-rc-2-b-50-arbxxp-rtrmadp-3-usalgbt.JPG?crop=5499,3093,x0,y573&width=3200&height=1800&format=pjpg&auto=webp"
    },
    {
      "news_number": 9,
      "title": "Clocktower developer: ‘It’s not possible’ for politics to stop housing project that could rise to nearly 200 feet",
      "summary": "Quick Take Local developer Workbench formally introduced its ambitious proposal for the Clocktower Center to the community in a virtual meeting Wednesday.\nThe 16-story, 260-unit vision for the project would reset the potential development intensity in Santa Cruz County.\nIn a resumé filled with first-of-their-kind projects in Santa Cruz County, local developer Workbench’s Clocktower Center proposal could prove to be its most ambitious to date.\nLocal zoning for the Clocktower Center lot allows buildings 35 to 50 feet tall.\nThat notion was repeated in the Q&A section during Wednesday’s Clocktower Center meeting.",
      "url": "https://lookout.co/clocktower-developer-its-not-possible-for-politics-to-stop-housing-project-that-could-rise-to-nearly-200-feet/",
      "imgURL": "https://lookout.co/wp-content/uploads/2024/04/Screenshot-2024-04-03-at-4.16.35-PM.png"
    },
    {
      "news_number": 10,
      "title": "Several Pa. House Republicans boo officers who defended Capitol on Jan. 6",
      "summary": "According to Democratic lawmakers, several GOP lawmakers hissed and booed, with a number of Republicans walking out of the chamber in protest.\nThe Pennsylvania House has 203 members — 102 Democrats and 101 Republicans.\nI and other members of our caucus also had their pictures taken with the former officers,” House Republican Leader Bryan Cutler said in an emailed statement.\nThe Capitol officers, he said, deserved to be greeted with the same respect.\nAfter Wednesday’s walkout, the Iraq War veteran accused Pennsylvania House Republicans of having “abandoned the truth” and “sided with those who attacked us.”",
      "url": "https://www.washingtonpost.com/politics/2024/06/06/pennsylvania-house-republicans-capitol-walkout/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/J2JAKBXLWFMAVXVGXWNBOCZFJM.jpg&w=1440"
    },
    {
      "news_number": 11,
      "title": "Podcast: Why Does The U.S. Care About Taiwan? : The NPR Politics Podcast : NPR",
      "summary": "And this dates back to the early days of the Cold War, when that's explicitly what Taiwan was for.\nWhen the president - recent president in Taiwan was inaugurated, gave his speech, you know, China then sent ships all around Taiwan, almost like a blockade.\nIn Taiwan, his political party - President Lai's political party - has said that nothing - the status quo between China and Taiwan has not changed.\nFENG: Pretty closely in Taiwan because the U.S. is a really, really important security guarantor of Taiwan.\nBOWMAN: No, I think that's right.",
      "url": "https://www.npr.org/transcripts/1197963790",
      "imgURL": "https://media.npr.org/assets/img/2024/06/05/landscape-1600x900px-40-_wide-f8cb78eee896e9cf4efb508e632cd73e3a08b927.png?s=1400&c=100&f=png"
    },
    {
      "news_number": 12,
      "title": "‘Standing Together’ against far-right Israeli hate in Jerusalem",
      "summary": "But this year, standing in the way of the far-right marchers in an effort to protect innocent bystanders were around 60 activists of the Jewish-Palestinian activist group, Standing Together.\nThe event has since swollen, there were up to 70,000 participants in 2022 when gangs of ultranationalist Israeli youth rampaged through the Old City.\nThe route itself, which deliberately traverses through the Muslim Quarter of the Old City, has long been a source of controversy.\nNevertheless, in East Jerusalem on Thursday morning, activists from Standing Together are busy removing many of the traces of yesterday’s far-right provocations.\nHardliner and ultra-orthodox numbers are growing, Lee Green conceded, but “they remain a minority.",
      "url": "https://www.aljazeera.com/news/2024/6/6/jewish-israelis-and-palestinians-push-back-against-hatred",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/2024-06-05T130124Z_1172009956_RC2058ARCM8R_RTRMADP_3_ISRAEL-PALESTINIANS-JERUSALEM-DAY-MARCH-1717598092.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 13,
      "title": "Video: Rep. Byron Donalds was asked to clarify Jim Crow remarks. Hear his response",
      "summary": "How relevant is this ad to you?\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues",
      "url": "https://www.cnn.com/2024/06/05/politics/video/byron-donalds-jim-crow-remarks-black-family-sot-newsnight-digvid",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/still-20671252-900949-still.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 14,
      "title": "Council green-lights Mayor Cherelle Parker’s budget plans, including $100 million for a Northeast Philly drug rehab center",
      "summary": "Mayor Cherelle L. Parker and City Council President Kenyatta Johnson hold a news conference hours after the mayor’s budget passed in City Council early Thursday morning.\nRead moreMayor Cherelle L. Parker’s approach to her administration’s first city budget was to focus on investing in the popular public safety and cleaning programs she campaigned on and to avoid drama during negotiations with City Council.\nThe deal also represents a significant moment for City Council President Kenyatta Johnson, who took the helm in January after former President Darrell L. Clarke decided not to seek reelection.\nFunding for drug treatment, quality-of-life, and public safetyNegotiations came down to the wire due to a handful of sticking points.\nIn the end, Council approved $100 million in capital funding this year, and lawmakers can add more in the next budget.",
      "url": "https://www.inquirer.com/politics/philadelphia/mayor-cherelle-parker-city-council-budget-triage-centers-taxes-20240606.html",
      "imgURL": "https://www.inquirer.com/resizer/vm5xTKjoAVyXD2uA_BHiiqa0ZyU=/760x507/smart/filters:format(webp)/cloudfront-us-east-1.images.arcpublishing.com/pmn/DUXWYGDZWNAMZJPYD5OWSP5BRA.jpg"
    },
    {
      "news_number": 15,
      "title": "Trump’s VP search enters a new phase: From the Politics Desk",
      "summary": "Plus, chief political analyst Chuck Todd asks if Trump's guilty verdict would matter more if President Joe Biden was more popular.\nTrump’s VP search enters a new phaseBy Henry J. Gomez, Matt Dixon, Jonathan Allen and Dasha BurnsDonald Trump’s search for a running mate is intensifying, as the former president awaits sentencing on felony charges and prepares for next month’s Republican National Convention.\nRead more → ⚖️ Hunter Biden latest: Hunter Biden’sex-wife and ex-girlfriend took the stand Wednesday, testifying about his substance abuse.\nMeanwhile, House Republicans sent criminal referrals to the Justice Department recommending that Hunter Biden and James Biden be charged with making false statements to Congress.\nMeanwhile, House Republicans sent criminal referrals to the Justice Department recommending that Hunter Biden and James Biden be charged with making false statements to Congress.",
      "url": "https://www.nbcnews.com/politics/trump-vp-search-new-phase-politics-desk-rcna155679",
      "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-05/240522-3x2-jd-vance-marco-rubio-doug-burgum-ew-1232p-60e4e5.jpg"
    },
    {
      "news_number": 16,
      "title": "Debate over liability expansions continue",
      "summary": "ALBANY, N.Y. -- At the crux, the arguments for and against bills the state Legislature is considering to expand corporate liability in New York are simple.\nOpponents like the Lawsuit Reform of Alliance in New York said they will make living in the state more expensive.\nI don't think these lobbyists are really worried about an increase in liability.\n\"If the aim is to pay more people more money, the money has to come from somewhere.\n\"They're not set up and they're not intended to help individuals with individuals problems.",
      "url": "https://spectrumlocalnews.com/nys/capital-region/politics/2024/06/05/wrongful-death-expansion-passes--other-liability-expansions-under-consideration",
      "imgURL": "https://s7d2.scene7.com/is/image/TWCNews/gavel_getty"
    },
    {
      "news_number": 17,
      "title": "Biden makes his play for anti-Trump Republicans he hopes can give him a second term",
      "summary": "Washington CNN —Donald Trump hasn’t shown much interest in reaching out to Republicans who think he’s an existential threat.\nOr, he argued, “they’re likely to stay home.”Hutchinson told CNN he won’t stay home himself, but he won’t vote for Biden or Trump.\n“This swath of Republican strategist types are literally begging the Biden campaign to give them a reason to support him,” a former House Republican leadership aide told CNN.\n“You can hold your nose and vote for Biden and not be in public screaming about it.\nBut Purcell has also not yet heard from the Biden campaign this time.",
      "url": "https://www.cnn.com/2024/06/06/politics/biden-anti-trump-republicans/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2156085528.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 18,
      "title": "Trump says he’d have ‘every right’ to seek prosecutions of political foes",
      "summary": "It has to stop because otherwise we’re not going to have a country,” Trump said, before baselessly accusing President Biden and his family of crimes.\n“Tonight in prime time, America saw Donald Trump consumed by rage and visibly rattled following his felony conviction,” Biden campaign spokesman Michael Tyler said.\n“Donald Trump is so consumed with personal grievance that he does not care who he hurts so long as Donald Trump benefits.”Trump, the presumptive Republican presidential nominee, continues to claim without evidence that his prosecutions are politically motivated and that his political rivals are behind them.\nAdvertisementOn Wednesday, Hannity also asked whether Trump would pledge to “restore equal justice” if reelected, tacitly validating Trump’s false claims that his prosecutions were politically motivated.\nannounced Tuesday that GOP lawmakers would “do everything we can” to target the Justice Department and other jurisdictions that investigated or charged Trump.",
      "url": "https://www.washingtonpost.com/politics/2024/06/06/trump-hannity-retribution-biden/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WGGFM3E2PRAMVNWMK42F6UUTMA.jpg&w=1440"
    },
    {
      "news_number": 19,
      "title": "Vote expected to limit single-use plastics in New York after bill printing error",
      "summary": "It was first updated late Monday and would mandate companies with a net income over $5 million reduce their plastic packaging products by 30% in 12 years.\nLawmakers argue the system will shift the onus of managing plastic waste away from localities to the companies responsible.\nPokalsky said state business leaders do not oppose an EPR program, but the current bill will reduce product choice and increase costs for consumers.\n\"New York estimates it will save $150 million on waste disposal every year once this is fully enacted,\" Glick said.\nIt's unclear if her concerns about affordability impacting the November elections could also dissuade her from signing the EPR bill into law.",
      "url": "https://spectrumlocalnews.com/nys/central-ny/politics/2024/06/05/vote-expected-to-limit-single-use-plastics-after-bill-printing-error",
      "imgURL": "https://s7d2.scene7.com/is/image/TWCNews/web-bf-plastic-takeout-container-food-take-out-06302023"
    },
    {
      "news_number": 20,
      "title": "Donald Trump election subversion conspiracy case indefinitely paused by Georgia appeals court",
      "summary": "CNN —A Georgia appeals court has halted the election subversion conspiracy case against Donald Trump and several of his co-defendants – a massive victory for the former president seeking to push further legal issues until 2025 if he can’t beat them altogether.\nThe new order filed on Wednesday from the Georgia Court of Appeals is the latest indication that a trial in the state-level Georgia election subversion case will not occur before the 2024 presidential election.\nThe appeals court is expected to rule on the disqualification issue by March 2025, though it could issue a ruling sooner.\nThe DA can ask the appeals court to fast track a decision in this matter if it chooses.\nLike the Georgia case, the Florida documents case has no set trial date.",
      "url": "https://www.cnn.com/2024/06/05/politics/georgia-trump-fani-willis-trial-delay/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/20240605-fani-willis-donald-trump-split-060524.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 21,
      "title": "N.Y. Judge Mark Grisanti won't be reappointed",
      "summary": "New York Court of Claims Judge Mark Grisanti, who is also an acting justice of the state Supreme Court, will not be reappointed to a second term by Gov.\nKathy Hochul following a confrontation between Buffalo officers back in 2020, Spectrum News 1 learned Wednesday.\nThat is when Mark Grisanti appeared to have pushed an officer.\nGrisanti's attorney, Terry Connors, told Spectrum News 1 in a statement that \"Judge Grisanti has not received formal notification regarding his reappointment.\nHochul's new nominations to the state Court of Claims and is expected to replace Grisanti.",
      "url": "https://spectrumlocalnews.com/nys/central-ny/politics/2024/06/05/n-y--judge-mark-grisanti-won-t-be-reappointed",
      "imgURL": "https://s7d2.scene7.com/is/image/TWCNews/grisanti_jpg"
    },
    {
      "news_number": 22,
      "title": "New Jersey Senate Primary Election 2024 Live Results",
      "summary": "Democratic Sen. Bob Menendez, in the middle of a trial on federal bribery charges, filed to run as an independent instead of competing in the Democratic primary.\nThat leaves the primary wide open for Rep. Andy Kim, who was set to face New Jersey first lady Tammy Murphy until Murphy dropped out of the race.\nRepublicans haven't won a Senate race in New Jersey in decades, but four GOP candidates are competing for the nomination, thinking Menendez's legal troubles may provide an opening.",
      "url": "https://www.nbcnews.com/politics/2024-primary-elections/new-jersey-senate-results",
      "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/f_auto/v1716487716/firecracker/cms-images/2024/og%20images/og-2024-primary-newJersey-senate.jpg"
    },
    {
      "news_number": 23,
      "title": "Judge orders Steve Bannon to report to prison on July 1 for contempt of Congress sentence",
      "summary": "WASHINGTON — A federal judge on Thursday ordered former Trump adviser Steve Bannon to report to prison on July 1 to begin a four-month prison sentence for defying subpoenas from the Jan. 6 Committee after a higher court rejected his appeal.\nBannon's sentence was put on hold pending appeal, and his lawyers made their case to a three-judge federal appeals court panel in November.\nThe appeals court upheld Bannon's conviction in May, and federal prosecutors soon filed a motion asking Nichols to order Bannon to report to prison.\nFederal prosecutors told Nichols there was \"no legal basis\" for the continued stay of the sentence after the federal appeals court rejected the appeal.\nBannon’s lawyers argued that the sentence should be stayed until they appeal it to the full appeals court and the Supreme Court.",
      "url": "https://www.nbcnews.com/politics/justice-department/court-hears-arguments-whether-steve-bannon-begin-prison-sentence-rcna155209",
      "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-06/240603-Steve-Bannon-al-1205-8d776b.jpg"
    },
    {
      "news_number": 24,
      "title": "Biden’s border order: impractical policy, pragmatic politics",
      "summary": "I T IS INDICATIVE of America’s putrid politics that President Joe Biden’s plan to crack down on migration at the southern border is meant not necessarily to succeed, but to convince voters that he is trying to succeed.\nOn June 4th Mr Biden revealed an executive order that will theoretically allow him to deny asylum to migrants who cross illegally when their numbers are high.\nThe administration has been mulling executive action since Senate Republicans, at Donald Trump’s behest, torpedoed a bipartisan bill they had helped to craft.\nIt would bar from receiving asylum all those who cross between ports of entry when migrant encounters at the southern border exceed an average of 2,500 a day.\nThe order reflects a conservative turn for Mr Biden, who suggested openness to migrants when he took office in 2021.",
      "url": "https://www.economist.com/united-states/2024/06/04/bidens-border-order-impractical-policy-pragmatic-politics",
      "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240608_USP504.jpg"
    },
    {
      "news_number": 25,
      "title": "The link between the news Americans consume and the things they believe",
      "summary": "CNN mentioned “Trump” and “trial” in more than 900 15-second chunks in the week before opening arguments began in the trial.\nIn the week before opening arguments, Fox News mentioned the terms half as often.\nOn the day the arguments began, Fox mentioned “Trump” and “trial” in just over 80 chunks, about half as often as did CNN.\nOn the first two days of Trump’s trial, Fox News mentioned “Trump” and “trial” in 155 chunks of airtime.\nThose who believe the false claims that the 2020 election was stolen are also most likely to think that 2024’s election will be suspect.",
      "url": "https://www.washingtonpost.com/politics/2024/06/06/news-source-political-beliefs-polling/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FMHH3OAKLK3ZH6BHR6RHONORC4.jpg&w=1440"
    },
    {
      "news_number": 26,
      "title": "Politics Report: Bill Walton, a Civic Obituary",
      "summary": "I wanted Voice to be part of his collection of beloved San Diego institutions.\nBill Walton at his home with former Voice director of development Iris Magid, board member Bill Osborne and Scott Lewis in August, 2019.\nFormer San Diego City Councilmember Marti Emerald recalled how he brought that enthusiasm to the push for a new Central Library downtown.\nIn a notorious press event at University of San Diego, Walton said Gloria should resign as mayor.\nShea was at Walton’s side when the relentless San Diego booster became Gloria’s toughest foe.",
      "url": "https://voiceofsandiego.org/2024/06/01/politics-report-bill-walton-a-civic-obituary/",
      "imgURL": "https://voiceofsandiego.org/wp-content/uploads/2023/10/untitled-08717.jpg"
    },
    {
      "news_number": 27,
      "title": "Is This the End for Mandatory D.E.I. Statements?",
      "summary": "For years, conservatives condemned the use of diversity statements by universities, which ask job applicants to detail their commitment to improving opportunities for marginalized and underrepresented groups.\nCritics called such statements dogmatic, coercive and, in one lawsuit seeking to end the practice in California, “a modern day loyalty oath” that recalled when professors were required to denounce the Communist Party.\nBut the use of diversity statements continued to grow, and eventually became a requisite when applying for a teaching job at many of the country’s most selective universities.\nThat seems to be changing.\nHarvard University’s Faculty of Arts and Sciences and the Massachusetts Institute of Technology have each recently announced that they will no longer require diversity statements as a part of their hiring process for faculty posts.",
      "url": "https://www.nytimes.com/2024/06/06/us/politics/dei-statements-harvard-massachusetts-institute-of-technology.html",
      "imgURL": "https://static01.nyt.com/images/2024/06/06/multimedia/06nat-diversity-pbhc/06nat-diversity-pbhc-facebookJumbo.jpg"
    },
    {
      "news_number": 28,
      "title": "Steve Bannon ordered to report to prison by July 1 to serve contempt of Congress sentence",
      "summary": "CNN —A federal judge on Thursday ordered Steve Bannon to report to prison by July 1, giving the former Donald Trump adviser a short window to get a higher court’s intervention.\nThe federal judge presiding over the case, Carl Nichols, had initially paused the sentence while Bannon appealed the conviction.\nLast month, however, a DC Circuit Court of Appeals panel unanimously rejected several challenges Bannon made to the case, and prosecutors immediately asked Nichols to send Bannon to prison to begin serving his sentence.\n“We’re going to win at the Supreme Court,” he added.\nNavarro is currently serving a four-month prison sentence for his 2023 conviction.",
      "url": "https://www.cnn.com/2024/06/06/politics/steve-bannon-jail/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2155667726.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 29,
      "title": "Kansas politicians relaunch effort to steal Kansas City Chiefs from neighboring Missouri after a $1 billion taxpayer-funded plan fizzled",
      "summary": "Top Kansas legislators have intensified efforts to woo the Super Bowl champion Kansas City Chiefs by offering to let the professional football franchise shape a plan for using state bonds to finance a new stadium in Kansas.\nTheir actions came as a new Kansas nonprofit group, Scoop and Score, launched a campaign for bringing the Chiefs from Missouri to Kansas.\n“Your insights and expertise are invaluable in shaping the success of this project,” Hawkins and Masterson said in their letter.\nIt would be similar to how the state and officials in Kansas City, Kansas, financed construction of NASCAR’s Kansas Speedway and an adjacent shopping and entertainment district.\n“We are poised to make the Kansas City Chiefs even stronger,” Hawkins and Masterson said in their letter.",
      "url": "https://fortune.com/2024/06/05/kansas-city-chiefs-missouri-politicians/",
      "imgURL": "https://fortune.com/img-assets/wp-content/uploads/2024/06/GettyImages-2154748918-e1717623269871.jpg?resize=1200,600"
    },
    {
      "news_number": 30,
      "title": "Dutch Royals to visit New York state next week",
      "summary": "Four hundred and fifteen years after Dutch explorer Henry Hudson explored the river that now bears his name, their majesties the King and Queen of the Netherlands will pay visit to New York and Georgia next week.\nAfter touring the city of Savannah, the king and queen will make their way to Albany where they will meet with Gov.\nKathy Hochul and meet with CEOs of Dutch companies that are active in Albany on June 12.\nThe couple will then head to the New York Historical Society to take part in an exhibit entitled “New York Before New York: The Castello Plan of New Amsterdam,” which explores the intricacies of Dutch-New York history.\nThe king and queen will end their tour with a reception at the spiral building in Hudson Yards.",
      "url": "https://spectrumlocalnews.com/nys/central-ny/politics/2024/06/03/dutch-royals-to-visit-new-york-state-next-week",
      "imgURL": "https://s7d2.scene7.com/is/image/TWCNews/ap-dutch-royal"
    },
    {
      "news_number": 31,
      "title": "South Africa’s ANC leans toward a ‘unity’ government that evokes Mandela but divisions are there",
      "summary": "A government of national unity, which ANC officials said is the first option on the table, evokes South Africa’s transition from apartheid’s white minority rule to a democracy in 1994.\nThen, new President Nelson Mandela brought political opponents — including the last apartheid leader — into his first government to foster unity in a fractured country.\n“We want to bring everybody on board,” ANC Secretary-General Fikile Mbalula said of the unity government proposal.\nAn agreement of some sort needs to be in place by June 16, the deadline for South Africa’s new Parliament to sit and elect a president.\nAny unity government plan from ANC would still have to be taken to those other parties, some of whom are more opposed to each other than ANC.",
      "url": "https://apnews.com/article/south-africa-coalition-election-ramaphosa-political-deadlock-788b872bba652af3257f202eacea6f5e",
      "imgURL": "https://dims.apnews.com/dims4/default/12fbc87/2147483647/strip/true/crop/5616x3159+0+293/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc1%2F11%2F8a8e5e19e7f61a034a169d160bb3%2Fcf6f5349e52641b99636fc5266329e89"
    },
    {
      "news_number": 32,
      "title": "Will Donald Trump join Marion Barry and Greg Gianforte by winning race after conviction?",
      "summary": "WASHINGTON — Former President Donald Trump could join the growing list of politicians who have been elected after being convicted of crimes.\nMarion BarryBarry was first elected mayor of Washington, D.C., in 1978.\nFormer D.C. Mayor Marion Barry is a prime example.\"\nAfterwards, he won re-election three more times until 1810, where he was defeated in part because of his opposition to the War of 1812, according to the Encyclopedia of Arkansas.\nDespite the charges, he won re-election in 2014 but later resigned in December that same year after pleading guilty to a tax evasion charge.",
      "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/05/trump-politicians-convicted-but-won-office/73954915007/",
      "imgURL": "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/06/03/USAT/73956085007-20240531-t-161455-z-53205316-rc-2-r-18-aoalua-rtrmadp-3-usatrumpnewyorkpresser.JPG?crop=3698,2081,x0,y192&width=3200&height=1801&format=pjpg&auto=webp"
    },
    {
      "news_number": 33,
      "title": "Judge Orders Bannon to Surrender for Prison Term by July 1",
      "summary": "A federal judge on Thursday told Stephen K. Bannon, a longtime adviser to former President Donald J. Trump, to surrender by July 1 to start serving a four-month prison term for disobeying a congressional subpoena.\nMr. Bannon was sentenced in October 2022 on contempt of Congress charges after he refused to give testimony to the House committee that investigated the Jan. 6, 2021, attack on the Capitol.\nJudge Carl J. Nichols, who has overseen the case, allowed him to remain free while he appealed.\nLast month, however, Mr. Bannon lost the first round of that challenge as a three-judge panel of a federal appeals court in Washington decided that his guilty verdict on charges of ignoring the House committee’s demand for his testimony was proper.\nBecause of the panel’s ruling, Judge Nichols said he no longer believed that Mr. Bannon could rightfully continue to postpone serving his sentence.",
      "url": "https://www.nytimes.com/2024/06/06/us/politics/steve-bannon-surrender.html",
      "imgURL": "https://static01.nyt.com/images/2024/06/06/multimedia/06dc-bannon-cpzg/06dc-bannon-cpzg-facebookJumbo.jpg"
    },
    {
      "news_number": 34,
      "title": "Why Trump’s Conviction Does Not Complicate My Abolitionist Politics",
      "summary": "I saw a post on Bluesky on Thursday in which someone lamented that it was a hard day to be a prison abolitionist.\nThey may say things like, “I am a prison abolitionist, but…” before explaining why they are savoring a particular conviction.\nIn my politics, I do not equate justice with satisfaction, nor do I believe my knee-jerk emotions should dictate people’s fates.\nThey are more likely to show up to the polls and more likely to commit acts of violence in Trump’s name.\nBut Truthout remains a haven for transformative journalism in pursuit of justice.",
      "url": "https://truthout.org/articles/why-trumps-conviction-does-not-complicate-my-abolitionist-politics/",
      "imgURL": "https://truthout.org/app/uploads/2024/06/2024_0603-donald-trump.jpg"
    },
    {
      "news_number": 35,
      "title": "The GOP fires up its vengeance 2024 tour",
      "summary": "CNN —In the wake of former President Donald Trump’s felony conviction, the “R” in the Republican brand might just as well stand for revenge.\nTrump nodded to the idea when asked about his conviction, which he has persistently, and with no evidence, blamed on President Joe Biden’s administration.\nMuch of it is aimed at Biden, but there is plenty of anger to go around.\nIs every House committee controlled by Republicans using its subpoena power in every way it needs to, right now?\n“It’s bigger than just President Trump.",
      "url": "https://www.cnn.com/2024/06/06/politics/republicans-revenge-tour-2024-trump/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2154734899.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 36,
      "title": "Even Sean Hannity can’t get Trump to back away from wanting revenge",
      "summary": "As the 2024 election has unfolded, Hannity has more than once tried to steer Trump away from what outsiders view as Trump’s most fraught comments.\nBefore this week, the best example of this dynamic came from a town-hall discussion between Trump and Hannity in December.\nHannity wanted Trump to disavow any intent to subvert democracy and seize power, to kneecap the hand-wringers on the left and in the old guard who were offering warnings about Trump’s second term.\n“Under no circumstances, you are promising America tonight,” Hannity lobbed to Trump, “you would never abuse power as retribution against anybody.”Advertisement“Except for Day One,” Trump chirped, to the amusement of the audience.\n“Look,” Trump continued, “I know you want me to say something so nice.”“No, I don’t want you to say!” Hannity objected, a claim that you may evaluate for yourself.",
      "url": "https://www.washingtonpost.com/politics/2024/06/06/trump-hannity-retribution/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6WMXQZTNVYI6ZMPCAU45VD2EKE.jpg&w=1440"
    },
    {
      "news_number": 37,
      "title": "Young Black voters are key in the 2024 election. Many don’t love their options.",
      "summary": "Young Black voters are key in the 2024 election.\nBut Black Americans’ desire to vote in this year’s election is down sharply compared with four years ago, according to a recent Washington Post-Ipsos poll.\nThat malaise was evident in nearly 30 interviews with young Black attendees at the festival, with most expressing deep frustrations with Biden, Trump and the repeat matchup between the two older White men.\nOthers said they remain undecided, are flirting with a vote for Trump or a third-party option — or plan to not vote at all.\n“I feel like I would be voting because I don’t want Donald Trump, but I don’t want Biden in there either.",
      "url": "https://www.washingtonpost.com/politics/2024/06/06/black-voters-2024-election-biden-trump/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NIM5N75WDJAL33IAJNZ5Y77FHE.JPG&w=1440"
    },
    {
      "news_number": 38,
      "title": "We are the most important voters in British politics. With four weeks to go, this is what we think",
      "summary": "As many as 15% of British voters are still undecided about who to vote for.\nI know in England a lot of people will be voting Labour.\nWithout any proper competition, the local Labour party has become embedded in factional politics at the expense of local people.\nLast time I voted for the Liberal Democrats but this time I don’t know where my vote will go.\nBut if I had to vote today, I don’t know what I’d do.",
      "url": "https://www.theguardian.com/commentisfree/article/2024/jun/06/undecided-voters-british-politics-vote-election",
      "imgURL": "https://i.guim.co.uk/img/media/fb4a5dd4ce640d98f18e3e622aaf69a3136a4e4e/0_0_2560_1536/master/2560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=d26127f585ba606eea40bed4412d82fd"
    },
    {
      "news_number": 39,
      "title": "Hillary Clinton Jokes She Has a “New Fondness for the Number 34” While Talking Politics, Climate Change at EMA Impact Summit",
      "summary": "Following two days of star-studded conversations about climate change, Hillary Clinton closed out the Environmental Media Association Impact Summit on Wednesday with a chat about kids and the planet — and a dig at Donald Trump‘s recent guilty verdicts.\nClinton joined showrunner Gloria Calderón Kellett and Good Energy founder Anna Jane Joyner at the Pendry West Hollywood for a panel on how climate change is affecting children’s development.\n“There’s been a lot of really, really great efforts to convince people about climate change and a lot of really dramatic information and even dramatic movies about the consequences that we are facing,” Clinton told the crowd.\nWith people moving from the south, we’re going to have more disease because insects are going to be able to live at higher and higher latitudes.\n'”David Wild, Phil Rosenthal and Ted Danson Jesse Grant/Getty Images for the Environmental Media AssociationWednesday also featured a live recording of Phil Rosenthal and David Wild’s Naked Lunch podcast, featuring guest Ted Danson.",
      "url": "https://www.hollywoodreporter.com/news/general-news/hillary-clinton-number-34-climate-change-ema-impact-summit-1235916210/",
      "imgURL": "https://www.hollywoodreporter.com/wp-content/uploads/2024/06/GettyImages-2156265468-1.jpg?w=1024"
    },
    {
      "news_number": 40,
      "title": "A triumph for Indian democracy",
      "summary": "LeadersGetting growing Britain’s Labour Party must be bolder about growth Even if the economy peps up, taxes will have to riseThe Modi Raj A triumph for Indian democracy The shock election result will change the country—ultimately for the betterDon’t do it America’s billionaires should resist the urge to support Donald Trump A Trump victory would reward them.\nBut not enough to justify the risksSingle-party politics Morena’s landslide win threatens to take Mexico down a dangerous path The country’s newly elected president will need to show political courageFrom chatbots to robots Three reasons why it’s good news that robots are getting smarter They are becoming more capable, easier to program and better at explaining themselves",
      "url": "https://www.economist.com/weeklyedition/2024-06-08",
      "imgURL": "https://www.economist.com/img/b/1280/1280/90/media-assets/image/20240608_DE_SQ_US.jpg"
    },
    {
      "news_number": 41,
      "title": "Judge Cannon expands hearing on Trump’s request to declare special counsel’s appointment invalid",
      "summary": "Cannon is planning on holding a sprawling hearing on Trump’s request to declare Jack Smith’s appointment as special counsel invalid, signaling she could be more willing than any other trial judge to veto the special prosecutor’s authority.\nWednesday, Cannon went further, adding a hearing on a gag order request from prosecutors to limit Trump’s rhetoric about law enforcement and allotting more time to hear arguments on the special counsel issue.\nCannon’s signal of willingness to entertain challenges to the special counsel comes in the same week Republicans are bearing down on Attorney General Merrick Garland for his use of special counsels.\nA third group says the Department of Justice’s use of a special counsel should be upheld.\nCannon still agreed to the hearing Trump wanted.",
      "url": "https://www.cnn.com/2024/06/04/politics/cannon-trump-special-counsel-hearing/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/c-2023-06-10t171654z-1332306386-rc2ag1as9wk2-rtrmadp-3-usa-trump-documents-judge.jpg?c=16x9&q=w_800,c_fill"
    }
  ]
}