{
  "health": [
    {
      "news_number": 0,
      "title": "World Health Assembly agreement reached on wide-ranging, decisive package of amendments to improve the International Health Regulations",
      "summary": "In an historic development, the World Health Assembly, the annual meeting of its 194 member countries, today agreed a package of critical amendments to the International Health Regulations (2005) (IHR), and made concrete commitments to completing negotiations on a global pandemic agreement within a year, at the latest.\nThe package of amendments to the Regulations will strengthen global preparedness, surveillance and responses to public health emergencies, including pandemics.\nThe pandemic emergency definition represents a higher level of alarm that builds on the existing mechanisms of the IHR, including the determination of public health emergency of international concern.\nThe pandemic emergency definition represents a higher level of alarm that builds on the existing mechanisms of the IHR, including the determination of public health emergency of international concern.\nFellow INB Co-Chair Roland Driece, from the Netherlands, said: “Today’s great result in approving amendments to the International Health Regulations will provide the momentum we need to finalize the Pandemic Agreement.",
      "url": "https://www.who.int/news/item/01-06-2024-world-health-assembly-agreement-reached-on-wide-ranging--decisive-package-of-amendments-to-improve-the-international-health-regulations--and-sets-date-for-finalizing-negotiations-on-a-proposed-pandemic-agreement",
      "imgURL": "https://cdn.who.int/media/images/default-source/who_homepage/co-chairs-inb-and-wgihr.tmb-1200v.jpg?sfvrsn=3b19a12d_1"
    },
    {
      "news_number": 1,
      "title": "Why health trackers can push you off the road to wellness",
      "summary": "I can’t remember the exact words, but they amounted, I think, to slightly more than “eccentric”, far less than bizarre.\nIt’s a successful business model in that it is both for the worried well and a creator of them.\nParents are particularly vulnerable to the marketing, their health anxieties projected on to their children.\nThe global wearable technology market (devices like fitness trackers) was valued at $61.30bn in 2022 and is forecast to expand significantly by 2030.\nAnd yet, there’s the possibility that for some people, trackers and the like are doing more harm than good.",
      "url": "https://www.theguardian.com/lifeandstyle/article/2024/jun/02/why-health-trackers-can-push-you-off-the-road-to-wellness",
      "imgURL": "https://i.guim.co.uk/img/media/2c893b069500e16bdce249b797a4e0dd6b67ab89/0_0_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tb3BpbmlvbnMucG5n&enable=upscale&s=d1fc179ecfb2f767cec532f2a64351bb"
    },
    {
      "news_number": 2,
      "title": "How Could a Girl in Perfect Health Come So Close to Dying?",
      "summary": "How could a girl in perfect health have come so close to dying?\nBut I left out any mention of my vaginal tract; somehow, that felt too personal to share, even with girls I’d known half my life.\nBy the end of the trip, I’d told a dozen girls; it got easier each time I told it.\nBy the time I flew back home, I knew I had a duty: to tell every girl who’d listen about toxic shock.\n“I still see it like it was yesterday, six years later.”Blood work confirmed the cause of death: Maddy died of toxic shock.",
      "url": "https://www.rollingstone.com/culture/culture-features/teen-girl-health-crisis-toxic-shock-syndrom-near-death-1235031045/",
      "imgURL": "https://www.rollingstone.com/wp-content/uploads/2024/05/toxic-shock-story.jpg?crop=0px%2C84px%2C1798px%2C1015px&resize=1600%2C900"
    },
    {
      "news_number": 3,
      "title": "Miami Dolphins hosts 25th Annual \"Fins Weekend\" fundraiser for Baptist Health",
      "summary": "Miami Dolphins hosts 25th Annual \"Fins Weekend\" fundraiser for Baptist Health Over the weekend, the Miami Dolphins held its annual \"Fins Weekend,\" a weekend-long event to give back to the South Florida community.",
      "url": "https://www.cbsnews.com/miami/video/miami-dolphins-hosts-25th-annual-fins-weekend-fundraiser-for-baptist-health/",
      "imgURL": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/06/02/16ae3690-52b9-42f8-8b16-221e17aa10a8/thumbnail/1200x630/a58a21352069c9ae76d430fe61ba0f6c/a0d70982b25065b2ee08875dacb6fd4d.jpg?v=d7bbca61a2ddd34e0cfc8fb46aec1df3"
    },
    {
      "news_number": 4,
      "title": "Heart attack: Younger adults with obesity for decade have higher risk",
      "summary": "Share on Pinterest Researchers say the risk to heart health from obesity is greater in younger adults than older adults.\nResearchers reported that older adults – women over 50 and men over 65 – did not have an increased risk based on overweight and obesity.\nFor their findings, which haven’t been published yet in a peer-reviewed journal, researchers used data from the Nurses’ Health Study and the Health Professionals Follow-Up Study.\nFor women older than 50 and men older than 65, there was not an increased risk.\nThe younger group had less of a disease burden because of the shorter duration of obesity.",
      "url": "https://www.medicalnewstoday.com/articles/risk-for-heart-attack-and-stroke-higher-in-younger-adults-who-have-had-obesity-for-a-decade-or-more",
      "imgURL": "https://media.post.rvohealth.io/wp-content/uploads/sites/3/2024/06/Silhouette-person-wall-1200-628-facebook.jpg"
    },
    {
      "news_number": 5,
      "title": "7 of this week's most noteworthy health stories, in case you missed them",
      "summary": "Fox News Digital publishes a range of health pieces every day of the week to keep you up-to-date on the most important wellness news.\nIn case you missed them, here are a few of the biggest health stories from this week.\nCLICK HERE TO SIGN UP FOR OUR HEALTH NEWSLETTERAs always, you can see a full list of recent health pieces at http://www.foxnews/health .\nPhillips and other experts revealed the unique challenges women face when it comes to dental health.\nThese foods could help you sleep better, experts sayEating more fruits and veggies could help support better sleep, new research suggests.",
      "url": "https://www.foxnews.com/health/7-weeks-most-noteworthy-health-stories-case-you-missed-them",
      "imgURL": "https://static.foxnews.com/foxnews.com/content/uploads/2024/06/weekend-6-1-split.jpg"
    },
    {
      "news_number": 6,
      "title": "Girls are getting their first periods earlier. Here's what parents should know",
      "summary": "Girls are getting their first periods earlier.\nHere's what parents should knowtoggle caption SDI Productions/Getty Images/E+Girls in the U.S. are getting their first menstrual period about 6 months earlier on average than they did in the 1950s and ‘60s.\nAnd more girls are beginning menstruation before the age of 9, which is considered a very early age.\nFor example, obesity is known to raise the risk of early puberty in girls, and childhood obesity rates have been rising.\nGetting enough sleep can also help – some studies have linked later bedtimes and shorter sleep duration to earlier puberty.",
      "url": "https://www.npr.org/sections/shots-health-news/2024/05/31/nx-s1-4985074/girls-are-getting-their-first-periods-earlier-heres-what-parents-should-know",
      "imgURL": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/2121x1193+0+110/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F1d%2F51%2Fb96439f248178d189a9f8646eed2%2Fgettyimages-1152656364.jpg"
    },
    {
      "news_number": 7,
      "title": "What your urine colour says about your health",
      "summary": "From dark yellow to blueThe biggest factor which can impact the colour of your urine is how hydrated you are.\n“There’s also a genetic type of kidney stone called cystine stones, which can affect the urine colour.”But urine can take some even stranger shifts.\n“It’s more of a purply blue red, rather than blood red,” says Garthwaite.\nMedications can also impact the colour of urine, initiating changes which can range from red to even blue.\nWhen to see a doctorProf Sooriakumaran advises seeing a doctor if you have any unusual changes in urine colour, smell or consistency which cannot be attributed to hydration.",
      "url": "https://www.telegraph.co.uk/health-fitness/conditions/diabetes/urine-colour-smell-health/",
      "imgURL": "https://www.telegraph.co.uk/content/dam/health-fitness/2024/05/31/TELEMMGLPICT000380044537_17171731059290_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.jpeg?impolicy=logo-overlay"
    },
    {
      "news_number": 8,
      "title": "Trendy Poppi prebiotic soda not as 'gut healthy' as it claims, lawsuit alleges",
      "summary": "A lawsuit filed against the wildly popular \"Shark Tank\" phenomenon, Poppi prebiotic soda, alleges that the drink was not as \"gut healthy\" as it’s advertised to be.\nPoppi's \"gut healthy\" promises are false since the soda \"only contains two grams of prebiotic fiber, an amount too low to cause meaningful gut health benefits,\" the plaintiffs claimed.\n\"However, even if a consumer were to do this, Poppi’s high sugar content would offset most, if not all, of these purported gut health,\" they added.\nCobbs said that she \"reasonably relied\" on Poppi's promise of gut healthy soda and decided to pay the \"substantial price premium.\"\nThe lawsuit \"demands\" a trial by jury, claiming that Poppi falsely advertised the health benefits of their products.",
      "url": "https://www.foxbusiness.com/lifestyle/trendy-poppi-prebiotic-soda-not-gut-healthy-claims-lawsuit-alleges",
      "imgURL": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2024/06/0/0/PoppiOrangeSoda.jpg?ve=1&tl=1"
    },
    {
      "news_number": 9,
      "title": "Fargo-Moorhead residents with disabilities navigate mental health journeys with added challenges",
      "summary": "“I really think that people with disabilities, people with mental health (challenges), over time they learn to grow from what they’ve been given,” she added.\nShe had a stroke at the end of 2022 that left her juggling rehab, altered mobility and increased mental health needs.\nShove's mental health journey has been a long one, he said.\nThis change has impacted her mental health, Nora said.\nIt's what I need now, and it works.”The solution is to talk about and normalize mental health care, she said.",
      "url": "https://www.inforum.com/health/fargo-moorhead-residents-with-disabilities-navigate-mental-health-journeys-with-added-challenges",
      "imgURL": "https://cdn.forumcomm.com/dims4/default/9850da9/2147483647/strip/true/crop/5096x3185+0+0/resize/1706x1066!/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fa5%2F56%2F60731353437391ac565b92b3d674%2F051524-n-ff-mentalhealthdisabilities.jpg"
    },
    {
      "news_number": 10,
      "title": "Seventy-seventh World Health Assembly",
      "summary": "The Seventy-seventh World Health Assembly is being held in Geneva, Switzerland, on 27 May – 1 June 2024.\nThe theme of this year’s Health Assembly is: All for Health, Health for All.\nProceedings will be webcast live from this web page.\nSimultaneous interpretation will be available in Arabic, Chinese, English, French, Russian and Spanish.",
      "url": "https://www.who.int/about/accountability/governance/world-health-assembly/seventy-seventh",
      "imgURL": "https://cdn.who.int/media/images/default-source/world-health-assembly/wha76/20230530_wha_closing_ceremony_pal20476.tmb-1200v.jpg?sfvrsn=3b65859b_2"
    },
    {
      "news_number": 11,
      "title": "High-Deductible Health Plans, Prior Auth Harm Cancer Care",
      "summary": "High-deductible health plans were defined as a yearly deductible of $1200 to $1350 or more for an individual, and $2400 to $2700 for a family.\nBarnes and colleagues found, that compared with cancer survivors who had standard health plans, peers with high-deductible plans had a significantly greater risk of death from any cause (hazard ratio [HR], 1.46) and risk of death from cancer (HR, 1.34).\nFor individuals in the general population without a history of cancer, however, high-deductible health plans appeared to have \"minimal impact on survival, with hazard ratios approaching 1,\" Barnes reported.\nAlthough the subgroups affected are \"those with historically better access to care,\" Barnes noted that high-deductible health plans may \"financially disincentivize cancer survivors from utilizing necessary medical care that's needed to optimize their survivorship, thereby compromising survival.\"\nHigh Human Toll of Prior Authorization DenialsThe other study presented at the meeting demonstrated how denying prior authorization requests for pain medication can lead to uncontrolled pain and more expensive healthcare utilization.",
      "url": "https://www.medscape.com/viewarticle/high-deductible-health-plans-prior-authorization-can-harm-2024a1000aaz",
      "imgURL": "https://img.medscapestatic.com/vim/live/professional_assets/Conference_News.jpg"
    },
    {
      "news_number": 12,
      "title": "Addressing mental health solutions for Bronx youth",
      "summary": "The case for finding solutions to the mental health challenges young people of the Bronx face was the focus of two panels Thursday at Bronx Borough Hall.\n“The State of Mental Health for Bronx Youth” was presented by Partnership with Children, a 115-year-old nonprofit that centers trauma-informed counseling and healing arts throughout New York City, along with Bronx Borough President Vanessa Gibson.\nAccording to a recent report by Montefiore Medical Center, 20% have a mental health disorder, while 10% are severely emotionally disturbed.\nKathy Hochul budgeted $20 million earlier this year to go to 137 school-based clinics and another $1.5 million from the State Office of Mental Health to support Mental Health First Aid programs for teens and youth.\nDelgado also brought up how young people are struggling with their mental health because of social media and the addictive feeds that keep them glued to their social media feeds.",
      "url": "https://www.nynmedia.com/news/2024/06/addressing-mental-health-solutions-bronx-youth/397050/",
      "imgURL": "https://cdn.nynmedia.com/media/img/cd/2024/06/02/AntonioDelgadoVanessaGibsonWesnerCREDITPierreCorneliusKyle_RosenbaumOwnerFounderHouseofBaum_/open-graph.jpg"
    },
    {
      "news_number": 13,
      "title": "As Republicans probe COVID’s origins, some see an attack on science; others say it’s long overdue",
      "summary": "As Republicans probe COVID’s origins, some see an attack on science; others say it’s long overduetoggle caption Andrew Harnik/Getty Images/Andrew Harnik/Getty ImagesAt the start of a hearing on COVID’s origins last month, Ohio Republican Brad Wenstrup said that the committee was not out to attack science.\nDaszak was taken to task by both Republicans and Democrats for failing to comply with the terms of grants issued to EcoHealth.\nAs a result of the ongoing hearings, EcoHealth Alliance recently had its access to federal grant funding suspended — with an eye toward debarring them from receiving future funding.\nBoth Daszak and EcoHealth say they will appeal the decision.\nIn the hearing, Morens says much of the correspondence was meant to help lift the mood of Daszak, who he counts as a personal friend.",
      "url": "https://www.npr.org/2024/05/30/g-s1-1788/republicans-probe-covid-origins-attack-on-science-or-long-overdue",
      "imgURL": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4476x2518+0+233/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fcf%2Ff3%2Fa1ed86d04f628573dbeb66e89798%2Fgettyimages-2153586947.jpg"
    },
    {
      "news_number": 14,
      "title": "Highly Pathogenic Avian Influenza (HPAI) Detections in Livestock",
      "summary": "USDA APHIS continues to receive questions related to the movement of lactating dairy cattle to sale barns and auction markets under the Federal Order and associated guidance, effective on April 29.\nThis message is to clarify that the Federal Order does not apply to the intrastate movement of a lactating dairy cow to a sale barn.\nSubsequent interstate movement for a lactating dairy cow from a sale barn directly to a slaughter facility requires only a Certificate of Veterinary Inspection (CVI) stating that the animal is clinically healthy; no testing is necessary.\nThis clarifies the requirements for states where direct to slaughter movements are limited but cattle movements flow through sale barns and auctions for consolidation and movement as a \"lot\" to slaughter out of state.\nWe are announcing this clarification over the weekend to ensure small farms have the guidance necessary to continue to move cull cattle and limit animal welfare issues.",
      "url": "https://www.aphis.usda.gov/livestock-poultry-disease/avian/avian-influenza/hpai-detections/livestock",
      "imgURL": "https://www.aphis.usda.gov/sites/default/files/2024-03/spotted-lanternfly.jpg"
    },
    {
      "news_number": 15,
      "title": "Weight loss: Zepbound effective for obesity-related health conditions",
      "summary": "Share on Pinterest New research suggests that Zepbound is effective for weight loss regardless of the number of obesity-associated diseases a person may have.\noleschwander/Shutterstock Anti-obesity medication Zepbound (tirzepatide) delivers significant weight loss even in people with multiple obesity-related medical conditions, a new study found.\nThe findings suggest that medical conditions associated with obesity do not affect the total weight loss achieved with the anti-obesity medication Zepbound (tirzepatide).\nZepbound promotes weight loss across multiple health conditions In this new study, researchers found that tirzepatide treatment led to significant weight loss regardless of the number of obesity-related complications patients had at the beginning of the study.\nIn fact, it is the other way around, in that the weight loss leads to improvement in other comorbid conditions.",
      "url": "https://www.medicalnewstoday.com/articles/zepbound-weight-loss-obesity-related-chronic-conditions",
      "imgURL": "https://media.post.rvohealth.io/wp-content/uploads/sites/3/2024/06/Zepbound_tirzepatide-Injection-1200x628-Facebook.jpg"
    },
    {
      "news_number": 16,
      "title": "14 graduate Webster University with degree in Mental Health Counseling as Mental Health Awareness Month ends",
      "summary": "14 graduate Webster University with degree in Mental Health Counseling as Mental Health Awareness Month endsEmail This Link Share on Pinterest Share on LinkedIn",
      "url": "https://www.wmbfnews.com/video/2024/06/03/14-graduate-webster-university-with-degree-mental-health-counseling-mental-health-awareness-month-ends/",
      "imgURL": "https://gray-wmbf-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F06-02-2024%2Ft_5bd7819b99d848798d125231ca1dae7b_name_Copy_of_VIDEO_THUMBNAIL__4_.png?auth=1f3310b3305b2c353e929b5e735fc950005dd3cee6e3d4c15cbb10a58c7aa579&width=1200&height=600&smart=true"
    },
    {
      "news_number": 17,
      "title": "Massive Bio and Mika Health Combine AI and Next-Generation Sequencing Biomarker Testing to Empower Cancer Patients On Treatment and Those Searching for and Participating in Clinical Trials in the Unit",
      "summary": "Comprehensive NGS biomarker testing can greatly reduce that wait time by identifying targeted therapies for which they are eligible but is grossly under-utilized,” said Dr. Gandolf Finke CEO and Founder of Mika Health.\nPatients receiving treatment on Mika’s personalized oncology Digital Therapeutic will have the ability to opt into Massive Bio’s AI-enabled clinical trial matching and NGS biomarker testing eligibility engine.\nWith over 14,000 actively recruiting interventional clinical trials, Massive Bio ensures that patients have access to the most current and relevant trials for their specific conditions.\nThis partnership will enhance patient matching efficiency, reduce manual effort, and ultimately improve treatment options and outcomes for cancer patients.\nFounded in 2015 by a team of clinical, technology, and M&A executives, Massive Bio boasts a global presence with nearly 100 people across 12 countries.",
      "url": "https://www.morningstar.com/news/business-wire/20240602931767/massive-bio-and-mika-health-combine-ai-and-next-generation-sequencing-biomarker-testing-to-empower-cancer-patients-on-treatment-and-those-searching-for-and-participating-in-clinical-trials-in-the-united-states-and-europe",
      "imgURL": "https://www.morningstar.com/assets/img/business-wire.45f21a7.svg"
    },
    {
      "news_number": 18,
      "title": "What would it take to keep trusted community health workers on the job",
      "summary": "Community health care workers like Flores are often the only link between their own communities and health care and social services.\nSo she spent six months getting accredited to be a community health worker so she could stay in the health care field.\nOther states use “rainy day” health funds in their budgets or hospital related fees for community health workers.\nBut he said understanding the total number doing the jobs of community health workers is difficult because many aren’t certified and they go by many titles, including promotores de salud, health coach, community health advisor or coach and many more.\n“The state recognizes that a key strategy to promote health equity and meet our community’s health needs is engaging with community health workers as key partners,” he said in an email.",
      "url": "https://www.thebaltimorebanner.com/community-health-workers-maryland-ACEH5544RVCQNGCQCLWSDUHX3Y/",
      "imgURL": "https://www.thebaltimorebanner.com/resizer/tzG20xjyLfmRY63sgRm4_w-MnFQ=/657x0/filters:quality(70):format(url)/cloudfront-us-east-1.images.arcpublishing.com/baltimorebanner/TKTRKPHXH5CWRBTDT2ZPUQMI6E.jpeg"
    },
    {
      "news_number": 19,
      "title": "OCR Updates Change Healthcare Cybersecurity Incident FAQs",
      "summary": "Today, the U.S. Department of Health and Human Services’ (HHS) Office for Civil Rights (OCR) published an update to the frequently asked questions (FAQs) webpage concerning the Change Healthcare cybersecurity incident.\n“Affected covered entities that want Change Healthcare to provide breach notifications on their behalf should contact Change Healthcare.\nSpecifically, the FAQs make clear that:Covered entities affected by the Change Healthcare breach may delegate to Change Healthcare the tasks of providing the required HIPAA breach notifications on their behalf.\nThe new and updated FAQs on the Change Healthcare Cybersecurity Incident may be viewed at: https://www.hhs.gov/hipaa/for-professionals/special-topics/change-healthcare-cybersecurity-incident-frequently-asked-questions/index.html.\nThe HHS Breach Portal: Notice to the Secretary of HHS Breach of Unsecured Protected Health Information may be found at: https://ocrportal.hhs.gov/ocr/breach/breach_report.jsf.",
      "url": "https://www.hhs.gov/about/news/2024/05/31/ocr-updates-change-healthcare-cybersecurity-incident-faqs.html",
      "imgURL": "https://www.hhs.gov/sites/default/files/styles/og_image_style/public/news_release.png?itok=7Yn3VSO9"
    },
    {
      "news_number": 20,
      "title": "Video New evidence showing the health benefits of the Mediterranean diet",
      "summary": "New evidence showing the health benefits of the Mediterranean diet ABC News’ medical correspondent Dr. Darien Sutton breaks down the latest significant health stories making headlines.",
      "url": "https://abcnews.go.com/GMA/Wellness/video/new-evidence-showing-health-benefits-mediterranean-diet-110751054",
      "imgURL": "https://i.abcnewsfe.com/a/6822f336-d8c6-46f0-88ef-8e48bd6bbf20/240602_gma_sutton_allen_health1_hpMain_16x9.jpg?w=992"
    },
    {
      "news_number": 21,
      "title": "An obscure drug discount program stifles use of federal lifeline by rural hospitals • Louisiana Illuminator",
      "summary": "At the same time, rural hospitals continue to close — 10 since the fix became available.\nIt would allow rural emergency hospitals to use the 340B federal drug discount program, which Congress created in 1992.\nChuck Grassley, Iowa’s longtime Republican senator, shepherded the Rural Emergency Hospital program into law.\nHis spokesperson, Gillie Maddox, did not respond directly to questions about why the federal law creating rural emergency hospitals omitted the 340B program.\nSanford Health, a largely rural health system headquartered in Sioux Falls, South Dakota, considered converting a handful of smaller critical access hospitals into rural emergency hospitals.",
      "url": "https://lailluminator.com/2024/06/02/rural-hospital/",
      "imgURL": "https://lailluminator.com/wp-content/uploads/2024/06/JonesRegionalMedicalCenter.jpg"
    },
    {
      "news_number": 22,
      "title": "FGH, SEMRHI host community health, resource fair",
      "summary": "(WDAM) - Two healthcare organizations have teamed up to host a free health event for Hub City-area residents.\nA community health and resource fair at Chain Park was hosted by Forrest General Hospital and Southeast Mississippi Rural Health Initiative.\n“It’s a natural partnership, simply because SEMRHI does the outpatient care, they stretch out to about a 17-county area, and Forrest General does most of the inpatient care,” said Steven Farrell, Forrest General Hospital chief medical officer/vice-president.\nThe event featured free health screenings, including rapid HIV testing.\nCopyright 2024 WDAM.",
      "url": "https://www.wdam.com/2024/06/02/fgh-semrhi-host-community-health-resource-fair/",
      "imgURL": "https://gray-wdam-prod.cdn.arcpublishing.com/resizer/v2/S2HQYYBPYNCGPFH4OPETK54TNE.png?auth=433b3db0a5dc16da36539001130d27ea3a3f4e830451562f59af09f8b3b7acf6&width=1200&height=600&smart=true"
    },
    {
      "news_number": 23,
      "title": "Take charge of your brain health to combat dementia in Alzheimer's & Brain Awareness Month",
      "summary": "Lauren Livingston is the communications director for the Alzheimer’s Association Iowa Chapter.\nThis June during Alzheimer’s & Brain Awareness Month, the Alzheimer’s Association is encouraging all Americans to take charge of their brain health.\nToday, there are nearly 7 million people age 65 and older in the U.S. are living with Alzheimer’s dementia, including over 62,000 in Iowa.\nThe Alzheimer’s Association offers tips and resources to help families navigate these conversations at alz.org/timetotalk or through their 24/7 Helpline at 800-272-3900.\nVolunteer with the Alzheimer’s Association: Volunteers are the key to making a difference in the lives of people facing Alzheimer's and dementia.",
      "url": "https://www.desmoinesregister.com/story/opinion/columnists/iowa-view/2024/06/02/alzheimers-brain-awareness-take-charge-combat-dementia/73899968007/",
      "imgURL": "https://www.desmoinesregister.com/gcdn/-mm-/a5be870213c540bb6436faab9d41d5393753695d/c=0-123-1700-1083/local/-/media/2016/05/27/Hattiesburg/B9322356596Z.1_20160527215135_000_GCBEH2TK8.2-0.jpg?width=1700&height=960&fit=crop&format=pjpg&auto=webp"
    },
    {
      "news_number": 24,
      "title": "Public Health launches online heat-related illness dashboard",
      "summary": "PHOENIX — The Maricopa County Department of Public Health (MCDPH) launched an interactive, online heat-related illness and death dashboard Thursday.\nThe webpage aims to provide residents with more accessible and timely data around countywide heat-related hospital visits and deaths, according to officials.\nThe tool is a part of Maricopa County’s heat preparedness and response effort already underway to prevent another summer of record-breaking heat deaths.\nOfficials say the dashboard replaces weekly heat surveillance reports previously published on the public health website.\nThe dashboard was designed through the Power BI platform with support from the county’s enterprise technology team.",
      "url": "https://ktar.com/story/5575552/public-health-launches-online-heat-related-illness-and-death-dashboard/",
      "imgURL": "https://ktar.com/wp-content/uploads/2024/05/heat-related-illness-1024x576.png"
    },
    {
      "news_number": 25,
      "title": "Seventy-seventh World Health Assembly – Daily update: 1 June 2024",
      "summary": "World Health Assembly agreement reached on wide-ranging, decisive package of amendments to improve the International Health Regulations, and sets date for finalizing negotiations on a proposed Pandemic AgreementIn a historic development, the World Health Assembly, the annual meeting of the World Health Organization's 194 member countries, today agreed on a package of critical amendments to the International Health Regulations (2005) (IHR), and made concrete commitments to completing negotiations on a global pandemic agreement within a year, at the latest.\nRelated documentsA77/A/CONF./14 Amendments to International Health Regulations (2005) agreed at Seventy-seventh World Health AssemblyMore information on the Intergovernmental Negotiating Body websiteItems finalized after 5 pm on Friday 31 MayReport on health conditions in the occupied Palestinian territory last yearOn 31 May 2024, the World Health Assembly noted the report on health conditions in the occupied Palestinian territory, including east Jerusalem, and in the occupied Syrian Golan.\nThe Health Assembly also approved a decision on the same topic, with four further amendments.\nThis is the first time the World Health Assembly has described Palestine as a State.\nIn this context, the World Health Assembly noted the Resolution on Strengthening health emergency preparedness and response in cities and urban settings.",
      "url": "https://www.who.int/news/item/01-06-2024-seventy-seventh-world-health-assembly---daily-update--1-june-2024",
      "imgURL": "https://cdn.who.int/media/images/default-source/who_homepage/world-health-assembly-committee-a.tmb-1200v.jpg?sfvrsn=d8f2a319_1"
    },
    {
      "news_number": 26,
      "title": "House Republicans to grill Anthony Fauci over coronavirus, pandemic response : Shots",
      "summary": "(SOUNDBITE OF ARCHIVED RECORDING)BRAD WENSTRUP: We have evidence that Dr. Morens purposefully evaded public transparency required by the Freedom of Information Act.\nThat is the lab that some people believe may have caused the COVID pandemic through a lab accident.\nBut the House Select Committee on the Coronavirus Pandemic has been investigating EcoHealth and its connection to the NIH.\nAnd that applies to professional communications of people like Dr. Morens.\n(SOUNDBITE OF ARCHIVED RECORDING)DEBBIE DINGELL: Dr. Morens, do you have any regret for the way in which you conducted yourself?",
      "url": "https://www.npr.org/transcripts/g-s1-1788",
      "imgURL": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4476x2518+0+233/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fcf%2Ff3%2Fa1ed86d04f628573dbeb66e89798%2Fgettyimages-2153586947.jpg"
    },
    {
      "news_number": 27,
      "title": "WHO Director-General's closing remarks at the Seventy-seventh World Health Assembly – 1 June 2024",
      "summary": "Honourable Minister Dr Edwin Dikoloti, President of the Seventy-seventh World Health Assembly,Excellencies Ministers, Heads of Delegation, dear colleagues and friends,We have come to the end of another long but fruitful World Health Assembly.\nIn addition, you have adopted decisions and resolutions on many key health issues:Antimicrobial resistance; climate change and health; infection prevention and control; maternal, newborn and child health; mental health in emergencies; social participation in primary health care; transplantation, and more.\n===Excellencies,I began the week by reflecting on our theme of All for Health, and Health for All.\nAnd in that sense, you have shown the world the meaning of All for Health, and Health for All.\n===Finally, Honourable Minister Dr Edwin Dikoloti, my deep gratitude to you for your leadership as President of the Seventy-seventh World Health Assembly.",
      "url": "https://www.who.int/director-general/speeches/detail/who-director-general-s-closing-remarks-at-the-seventy-seventh-world-health-assembly---1-june-2024",
      "imgURL": "https://cdn.who.int/media/images/default-source/campaigns---annual-theme/annual-theme/year-of-the-nurse-and-the-midwife/who-dr-tedros-portrait-11aug2017-0102.tmb-1200v.jpg?sfvrsn=2ccc89d4_30"
    },
    {
      "news_number": 28,
      "title": "Strategic Roundtable unites global health leaders to address climate change and health impacts",
      "summary": "Health leaders and experts from around the globe came together for a Strategic Roundtable to address the critical intersection of climate change and health.\nThe roundtable, convened in anticipation of COP29, and with the backdrop on the World Health Assembly, was hosted to bolster momentum and shape the global health architecture for tackling climate change.\nKeynote speakers emphasized the urgency of the issue, underscoring the need for collaborative action to mitigate the health impacts of climate change.\nThis roundtable had particular significance, as the response to climate change is one of the six key strategic objectives of WHO’s Fourteenth General Programme of work for the period 2025–2028.\nThe strategic roundtables spanned the overarching theme of the Seventy-seventh World Health Assembly: All for health, health for all, and WHO Investment Round, allowing participants to reflect on the Organization’s achievements, current and future challenges facing global health.",
      "url": "https://www.who.int/news/item/01-06-2024-strategic-roundtable-unites-global-health-leaders-to-address-climate-change-and-health-impacts",
      "imgURL": "https://cdn.who.int/media/images/default-source/air-pollution/air-quality-and-health/aqeh_conference_banner_1.tmb-1200v.jpg?sfvrsn=fd2443d0_1"
    },
    {
      "news_number": 29,
      "title": "UPMC's merger with Washington Health System becomes official",
      "summary": "WASHINGTON, Pa. (KDKA) - UPMC's acquisition of Washington Health System has become official.\nWashington Health System announced on Saturday that it has officially joined UPMC and will now be known as UPMC Washington and UPMC Greene.\nMy office did a comprehensive review and reached this agreement with UPMC and Washington Health Care Services to ensure those protections are in place.\"\nOne year ago, the Washington Health System Boards of Directors announced an affiliation agreement with UPMC and now it becomes official.\nWashington Health System has said that the affiliation does not affect access for community members to WHS hospitals or doctors and that UPMC will continue to honor the contracts in place.",
      "url": "https://www.cbsnews.com/pittsburgh/news/upmcs-merger-with-washington-health-system-becomes-official/",
      "imgURL": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/04/10/bfeef3f0-49c8-4fe2-9b73-4941260d79b4/thumbnail/1200x630/37f7365972022d9937a1b1a9fbd44e1a/snapshot-2024-04-09t232206-066.jpg?v=d7bbca61a2ddd34e0cfc8fb46aec1df3"
    },
    {
      "news_number": 30,
      "title": "CMS Framework for Health Equity",
      "summary": "Priority 2: Assess Causes of Disparities Within CMS Programs and Address Inequities in Policies and Operations to Close GapsCMS is committed to move beyond observation and into action, assessing our programs and policies for unintended consequences and making concrete, actionable decisions about our policies, investments, and resource allocations.\nOur goals are to explicitly measure the impact of our policies on health equity, to develop sustainable solutions that close gaps in health and health care access, quality, and outcomes and to invest in solutions that address health disparities.",
      "url": "https://www.cms.gov/priorities/health-equity/minority-health/equity-programs/framework",
      "imgURL": "https://www.cms.gov/sites/default/files/favicon.ico"
    },
    {
      "news_number": 31,
      "title": "Durham County Department of Public Health to host free gun lock giveaway",
      "summary": "Durham County Department of Public Health to host free gun lock giveawayDURHAM, N.C. (WTVD) -- The Durham County Department of Public Health is partnering with the county District Attorney's Office to host a free gun lock giveaway.\nOrganizers said the event is part of the NC S.A.F.E week of action and comes as a statewide initiative to raise awareness of the importance of securely storing firearms.\nNC SAFE week starts Sunday, June 2 and runs through Saturday, June 8.\nYou can pick up a gun lock on Tuesday, June 4 from 9 a.m. to 12 p.m. at the Durham County Courthouse on Dillard Street.\nWATCH | City leaders discuss impact, solutions to stop gun violence in Durham",
      "url": "https://abc11.com/post/durham-county-department-public-health-host-free-gun/14901488/",
      "imgURL": "https://cdn.abcotvs.com/dip/images/13350541_060623-wtvd-gun-lock-giveaway-vid.jpg?w=1600"
    },
    {
      "news_number": 32,
      "title": "Seventy-seventh World Health Assembly – Daily update: 31 May 2024",
      "summary": "The Health Assembly asserts that radical action is imperative to safeguard the health of the planet, underscoring the interdependence of environmental sustainability and public health.\nAddressing the challenge, the Seventy-seventh World Health Assembly passed a new resolution supporting countries to restructure their economies to serve the health of people and the planet.\nThis decision by the Health Assembly marks a significant shift towards a holistic approach to public health.\nIn this context, on Thursday, 30 May, the World Health Assembly endorsed a resolution strengthening health emergency preparedness for these hazards.\nRelated documentsEB154/17 Global Health and Peace InitiativeEB154(11) adopted at EB154Related linksStrengthening laboratory biological risk managementAlso on 31 May 2024, the World Health Assembly endorsed a resolution on strengthening laboratory biological risk management as a necessary health security capacity.",
      "url": "https://www.who.int/news/item/31-05-2024-seventy-seventh-world-health-assembly---daily-update--31-may-2024",
      "imgURL": "https://cdn.who.int/media/images/default-source/world-health-assembly/wha77/wha77-committee-a-delegates.tmb-1200v.jpg?sfvrsn=6d3597d7_2"
    },
    {
      "news_number": 33,
      "title": "Ariel Roblin: The importance of mental health awareness and knowing the signs",
      "summary": "Advertisement Opinion Ariel Roblin: The importance of mental health awareness and knowing the signs Share Copy Link CopyLife transitions can be exciting, but they can also bring uncertainty and stress.When you layer in anxiety or depression, those transitions can become overwhelming.\nMay was Mental Health Awareness Month, and this past week, the golf world was rocked by the sudden death of 30-year-old Grayson Murray.A successful player and recent winner on the PGA tour, he seemed to have the perfect life.\nHis parents issued a statement thanking the tour and saying he was loved.They also highlighted the complicated emotions many families can likely relate to.\nLearn the signs, ask questions, and listen.And just because someone seems alright, it could be the next life transition that is just too much to handle.If you or someone you know needs help, you can talk with the Suicide & Crisis Lifeline by calling or sending a text message to 988, or you can chat online here.Ariel Roblin is the president and general manager of KCRA 3 and My58.\nSee more of her editorials here.",
      "url": "https://www.kcra.com/article/ariel-roblin-mental-health-awareness-editorial/60966300",
      "imgURL": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/kcra-editorial-graphic-1630597488.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*"
    },
    {
      "news_number": 34,
      "title": "At World Health Assembly, countries agree on efforts to boost pandemic preparedness",
      "summary": "Member countries of the UN World Health Organization (WHO), on the final day of the seventy-seventh World Health Assembly, adopted important amendments to the International Health Regulations (IHR), including defining a “pandemic emergency” as well as pledging improved access to medical products and financing.\nSpeaking at the closing of the World Health Assembly, Tedros applauded the delegates for their hard work.\nThe Assembly was held in Geneva from 27 May to 1 June under the overarching theme All for Health, Health for All.\nWhat is IHRThe International Health Regulations (IHR) are a legally binding international instrument that define countries’ responsibilities in managing public health events and emergencies with potential cross-border implications.\nAmong other points, they establish crucial reporting obligations for countries and criteria for identifying “public health emergencies of international concern,” and address international travel and transport requirements, ensuring health documentation compliance.",
      "url": "https://news.un.org/en/story/2024/06/1150546",
      "imgURL": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Libraries/Production%20Library/17-09-2020-UNWomen_health_workers_Philippines.jpg/image770x420cropped.jpg"
    },
    {
      "news_number": 35,
      "title": "$4.1M tucked into newly approved OK state budget earmarked to resolve mental health lawsuit",
      "summary": "It could also involve creating a plan similar to the multi-year Pinnacle Plan, Wallace said.\nOklahoma Voice Editor Janelle Stecklein contributed to this report.\nOklahoma Voice is part of States Newsroom, a nonprofit news network supported by grants and a coalition of donors as a 501c(3) public charity.\nOklahoma Voice maintains editorial independence.\nFollow Oklahoma Voice onFacebook andTwitter.",
      "url": "https://www.oklahoman.com/story/news/2024/06/02/ok-lawmakers-earmark-4-1m-in-hopes-of-setting-mental-health-lawsuit/73947810007/",
      "imgURL": "https://www.oklahoman.com/gcdn/authoring/authoring-images/2024/05/13/NOKL/73672800007-budget-4.jpg?crop=5471,3079,x0,y284&width=3200&height=1801&format=pjpg&auto=webp"
    },
    {
      "news_number": 36,
      "title": "WHO member countries approve steps to bolster health regulations to better brace for pandemics",
      "summary": "The World Health Organization says member countries on Saturday, June 1, 2024, approved a series of new steps to improve global preparedness for and response to pandemics like COVID-19 and mpox.\nCredit: AP Photo/Jae C. Hong, FileThe World Health Organization says member countries on Saturday approved a series of new steps to improve global preparedness for and response to pandemics like COVID-19 and mpox.\nCountries agreed to amend the International Health Regulations, which were adopted in 2005, such as by defining a \"pandemic emergency\" and helping developing countries gain better access to financing and medical products, WHO said.\nBut countries agreed to complete negotiations on the pandemic accord within the year, \"at the latest,\" WHO said.\nYuanqiong Hu, a senior legal and policy adviser at Doctors without Borders, said that the changes adopted Saturday include \"important provisions addressing equity in access to health products during global health emergencies.\"",
      "url": "https://medicalxpress.com/news/2024-06-member-countries-bolster-health-brace.html",
      "imgURL": "https://scx2.b-cdn.net/gfx/news/hires/2024/who-member-countries-a-2.jpg"
    },
    {
      "news_number": 37,
      "title": "Seventy-seventh World Health Assembly – Daily update: 30 May 2024",
      "summary": "The plan provides clear actions, indicators, and targets to support Member States in improving national- and facility-level IPC actions.\nThe resolution also stresses the need for comprehensive sexual and reproductive health care services, including family planning, that underpin women’s health.\nAMR is an urgent global health and socioeconomic challenge.\nThe resolution urges Member States to apply these priorities and implement the core package of country-level interventions through their AMR national action plans.\nShe urged Member States to work with WHO and the rest of the UN system to improve services in countries for victims and survivors.",
      "url": "https://www.who.int/news/item/30-05-2024-seventy-seventh-world-health-assembly---daily-update--30-may-2024",
      "imgURL": "https://cdn.who.int/media/images/default-source/who_homepage/delegates-at-the-world-health-assembly.tmb-1200v.jpg?sfvrsn=dc38ab_6"
    },
    {
      "news_number": 38,
      "title": "UVa Health named one of America's top health systems for diversity",
      "summary": "The University of Virginia Health System has been named among the commonwealth's, and the country's, best employers for diversity.\n8 among health systems for diversity, according to business magazine Forbes' \"America's Best Employers for Diversity\" rankings.\nThose communities are only going to become more diverse as UVa Health continues to expand in its pursuit of establishing a statewide health network, with ambitions to eventually take UVa Health across Virginia's borders.\nEarlier this year, UVa Health acquired Piedmont Family Practice, the largest primary care provider in the Warrenton area.\nLate last year, medical news and information site WebMD named UVa Health the “best in class” health system in the commonwealth for its cancer, heart, orthopedics, neurology and digestive care.",
      "url": "https://dailyprogress.com/news/local/uva-health-named-one-of-americas-top-health-systems-for-diversity/article_5db9ce68-205f-11ef-bf28-c73698fd3fa6.html",
      "imgURL": "https://bloximages.newyork1.vip.townnews.com/dailyprogress.com/content/tncms/assets/v3/editorial/5/db/5db9ce68-205f-11ef-bf28-c73698fd3fa6/665b99e732b35.preview.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize"
    },
    {
      "news_number": 39,
      "title": "Indigenous foods over colonial foods can restore health, filmmaker says",
      "summary": "The story of the prevalence of diabetes in Native American communities is a personal one for Rincon Band of Luiseño Indians tribal member and documentary filmmaker, Ruth-Ann Thorn.\nHow did you first learn about the prevalence of this illness in Native American communities?\nQ: Can you talk about some of the historical and cultural factors that contribute to this higher prevalence among Native American communities?\nQ: What are some steps that people can take to address this issue, particularly in ways that support Native American communities?\nIt really comes down to science and education, of knowing what food really does to the body.",
      "url": "https://www.sandiegouniontribune.com/columnists/story/2024-06-02/indigenous-foods-over-colonial-foods-can-restore-health-filmmaker-says",
      "imgURL": "https://ca-times.brightspotcdn.com/dims4/default/064c333/2147483647/strip/true/crop/758x398+0+0/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fcb%2F11%2Fab592a444882bbfcd5374f286a69%2Fruth-ann-thorn-roots-of-resilience-doc.jpg"
    },
    {
      "news_number": 40,
      "title": "OHSU + Legacy Health: Expanding care, accelerating impact",
      "summary": "By OHSU Communications Portland, OregonBuilding on longstanding collaborations in pediatrics, cancer and behavioral health, Oregon Health & Science University and Legacy Health have signed a binding, definitive agreement to unite as one health system under OHSU Health.\nOHSU and Legacy Health share a mission of public service and dedication to the region’s most vulnerable populations.\nOHSU Health will focus on improving health outcomes, addressing health care inequities, and providing access to care for more people, including the medically underserved, through a coordinated network of health care access points in Oregon and Southwest Washington.\nAbout OHSUOregon Health & Science University is Oregon's public academic health center and a nationally distinguished research university dedicated solely to advancing health sciences.\nAbout Legacy HealthLegacy Health is a local nonprofit health system driven by our mission to improve the health of those around us.",
      "url": "https://news.ohsu.edu/2024/05/30/ohsu-+-legacy-health-expanding-care-accelerating-impact",
      "imgURL": "https://s3.amazonaws.com/cms.ipressroom.com/296/files/20244/OHSULegacy_social.jpg"
    },
    {
      "news_number": 41,
      "title": "Biden-Harris Administration Launches Nationwide Heat and Health Tool to Protect Communities Most Impacted by Extreme Heat",
      "summary": "The Heat and Health Index (HHI) is the first nationwide tool to provide heat-health outcome information at the ZIP code level.\nThe HHI will be available on the CDC National Environmental Public Health Tracking Program’s Heat and Health Tracker.\nThe HHI complements these tools by allowing people to plan for the impacts of heat and safeguard communities before extreme heat events occur.\nTo learn more about the Heat and Health Index (HHI), explore its features, and discover how it can help communities better prepare for and respond to heat events, please visit here.\nTo find out about the federal government's initiatives and efforts related to heat and health, please visit heat.gov.",
      "url": "https://www.hhs.gov/about/news/2024/05/31/biden-harris-administration-launches-nationwide-heat-health-tool-protect-communities-most-impacted-extreme-heat.html",
      "imgURL": "https://www.hhs.gov/sites/default/files/styles/og_image_style/public/news_release.png?itok=7Yn3VSO9"
    },
    {
      "news_number": 42,
      "title": "Nelson Ledesma holds three-shot lead entering final round of UNC Health Championship presented by STITCH",
      "summary": "Nelson Ledesma on being solo leader and bidding for his first win since 2019… “Every day I was hitting really well.\nI think that from now on the battle is more mental than technical for the next round.\nI'm going to be focused more on my mental game than in my technical game because my technical game is totally fine right now.\n… Four weeks ago I started watching the videos when I won and it showed me that I can do it again, and since that, I started to play much better every week.\nI start to be more precise with my irons every week.",
      "url": "https://www.pgatour.com/korn-ferry-tour/article/news/daily-wrapup/2024/06/01/nelson-ledesma-holds-three-shot-lead-entering-final-round-of-unc-health-championship-presented-by-stitch",
      "imgURL": "https://res.cloudinary.com/pgatour-prod/w_1200,h_628,c_fill,f_auto,q_auto/pgatour/news/editorial/2024/06/01/nelson-ledesma-r3-unc-health-kft.jpg"
    },
    {
      "news_number": 43,
      "title": "WHO member countries approve steps to bolster health regulations to better brace for pandemics",
      "summary": "The World Health Organization says member countries approved new steps to boost global preparedness for pandemics like COVID-19 and mpox and better respond to dangerous outbreaksWHO member countries approve steps to bolster health regulations to better brace for pandemicsGENEVA -- The World Health Organization said member countries on Saturday approved new steps to improve global preparedness for and response to pandemics like COVID-19 and mpox, and set a new deadline for agreeing on a broader treaty.\nCountries agreed by consensus to amend the International Health Regulations, which were last changed in 2005, such as by defining the term “pandemic emergency” and helping developing countries to gain better access to financing and medical products, WHO said.\n“The success of the IHR amendments demonstrates that in our divided and divisive world, countries can still come together to find common cause and common ground,” Director-General Tedros Adhanom Ghebreyesus said.\nWHO legal officer Steven Solomon said the move to revise the health regulations does not take effect immediately, but will come into force a year after Tedros formally notifies countries of the decision.\nYuanqiong Hu, a senior legal and policy adviser at Doctors without Borders, said that the changes adopted Saturday include “important provisions addressing equity in access to health products during global health emergencies.”",
      "url": "https://abcnews.go.com/Health/wireStory/member-countries-approve-steps-bolster-health-regulations-brace-110744706",
      "imgURL": "https://i.abcnewsfe.com/a/636ab937-5f34-474f-b5f8-e3a60be473b2/wirestory_9c6419844b9c333a1a31d224124532f1_16x9.jpg?w=1600"
    },
    {
      "news_number": 44,
      "title": "Health Policy 101",
      "summary": "IntroductionDr. Drew Altman, president and chief executive officer of KFFI have long planned to create an online resource or mini “textbook” for faculty and students interested in health policy.\nBut, of course, you can’t all visit our offices to see our health policy history wall—and many of you may have quibbles if you did.\nFor us at KFF, our definition reflects our views and what we do: Health policy centers around, well policy–what the government does, and public programs like Medicare, Medicaid, and the ACA, and heavily emphasizes financing and coverage.\nWe also focus relentlessly on people, not health professionals and health care institutions (I have never been fond of the word “provider”).\nWe will also add chapters as we get feedback from you.",
      "url": "https://www.kff.org/health-policy-101/",
      "imgURL": "https://www.kff.org/wp-content/uploads/2024/05/HP101_FI_Overall.png"
    },
    {
      "news_number": 45,
      "title": "What's Happening in Health: June 2, 2024",
      "summary": "Cincinnati (WKRC) - Liz Bonis hosts stories on local health breakthroughs and other solutions; interviews with doctors and patients; ways to stay or get healthy.",
      "url": "https://local12.com/health/whats-happening-in-health/whats-happening-in-health-june-2-2024-whatshappeninginhealth-wkrc-liz-bonis-fish-oil-foot-injuries-skin-cancer-mental-health-disparities-bionic-arm-cankles-recess-stadium-kidney-burnout-summer-events-tattoo-living-kidney-donor-pickles",
      "imgURL": "https://local12.com/resources/media/0c5f3980-207e-45ff-b0ce-1dce01d0f4d1-large16x9_WKRCWhatsHappeninginHealthHERO.png?1644596866321"
    },
    {
      "news_number": 46,
      "title": "Being a patient is getting harder in a strained and complex US health care system",
      "summary": "Patients are not getting enough help dealing with a healthcare system that is growing increasingly complex, according to researchers and other experts in care delivery.\nMore care providers and employers are offering help guiding people, a practice the federal Medicare program has started to cover.\nDavis, the San Antonio cancer patient, said she was in the hospital when she asked for help finding community resources.\nMaking the system better for patients requires big change, said Dr. Victor Montori, a Mayo Clinic researcher who studies care delivery.\nHe said the system must focus more on minimally disruptive medicine, which makes care fit into patient lives.",
      "url": "https://apnews.com/article/patient-care-insurance-denials-712af9c8ed1a644cc8ee13b9814b4fbb",
      "imgURL": "https://dims.apnews.com/dims4/default/e59d875/2147483647/strip/true/crop/5518x3104+0+340/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F88%2F77%2Fe14addc932f5bc4e6879c757f82d%2Fd6eabc3e46004a70be95e9e4c3d29a23"
    },
    {
      "news_number": 47,
      "title": "SENTARA HEALTH PLANS/MBUY",
      "summary": "A dedicated team for your small business is here We answer your health plan questions, so you can focus on your other business needs.\nVisit sentarahealthplans.com/group, call 1-888-706-2865, or scan code to learn more Sentara Health Plans is a trade name of Sentara Health Plans, Sentara Health Insurance Company, Sentara Behavioral Health Services, Inc., and Sentara Health Administration, Inc. Small group Vantage (HMO) and Point of Service (POS) plans are issued and underwritten by Sentara Health Plans.\nPlus (PPO) plans are issued and underwritten by Sentara Health Insurance Company.\nExclusions, terms and conditions apply.\nFor costs and coverage details contact Sentara Health Plans.",
      "url": "https://roanoke.com/ads/print_ads/healthcare/sentara-health-plans-mbuy/pdfdisplayad_5f57fb2e-ae64-54b2-9de9-687dfa60d66d.html",
      "imgURL": "https://bloximages.newyork1.vip.townnews.com/roanoke.com/content/tncms/assets/v3/classifieds/5/f5/5f57fb2e-ae64-54b2-9de9-687dfa60d66d/665bd96406fdf.preview.jpg?crop=978%2C513%2C0%2C743&resize=978%2C513&order=crop%2Cresize"
    }
  ],
  "sports": [
    {
      "news_number": 0,
      "title": "Riley Gaines: Trans athletes make women’s sports a civil rights issue",
      "summary": "It’s the preeminent civil rights issue of our day: the protection of girls in women’s sports.\n4 Riley Gaines has become an advocate for barring transgender women from women’s sports.\nI have dedicated myself to this cause, which is why I founded the Riley Gaines Center at the Leadership Institute.\nEvery girl who wants to end this nonsense once and for all has a place at the Riley Gaines Center.\nRiley Gaines, a 12-time All-American swimmer and five-time SEC champion, is founder and director of the Riley Gaines Center at the Leadership Institute.",
      "url": "https://nypost.com/2024/06/02/opinion/trans-athletes-make-womens-sports-a-civil-rights-issue/",
      "imgURL": "https://nypost.com/wp-content/uploads/sites/2/2024/06/newspress-collage-uy5osgrim-1717332931472.jpg?quality=75&strip=all&1717318559&w=1024"
    },
    {
      "news_number": 1,
      "title": "Jude Bellingham on Champions League win: The best night of my life",
      "summary": "An emotional Jude Bellingham paid tribute to his family as he hailed Real Madrid's Champions League final win as the \"best night of my life\".\nNo other coach has managed four, let alone five and he's now won nine of his last 10 Champions League or domestic finals.\nWe don't know what the future will bring him but for sure it will bring him another Champions League final.\"\nHummels: We didn't manage to put the ball in the netBorussia Dortmund defender Mats Hummels: \"We put together some incredible attacks but didn't manage to put the ball in the net.\nThey had the kind of luck that we've had in other games this Champions League season, but we didn't have it today.",
      "url": "https://www.skysports.com/football/news/11945/13146677/jude-bellingham-on-champions-league-win-the-best-night-of-my-life",
      "imgURL": "https://e0.365dm.com/24/06/1600x900/skysports-jude-jobe-bellingham_6571442.jpg?20240602093541"
    },
    {
      "news_number": 2,
      "title": "Katie Ledecky on sports doping and the Paris Olympics",
      "summary": "Katie Ledecky on sports doping and the Paris Olympics Katie Ledecky won her first Olympic gold at age 15, and today has more individual Olympic gold medals than any woman swimmer in history.\nAs she gears up for the Paris Olympics this summer, Ledecky talks with correspondent Elaine Quijano about reexamining the results of the 2021 Tokyo Games after news that Chinese swimmers had tested positive for a banned substance just months before the competition.\nShe also talks about her preparations for the Paris Games, the 2028 Olympics in Los Angeles, and beyond.",
      "url": "https://www.cbsnews.com/video/katie-ledecky-on-sports-doping-and-the-paris-olympics/",
      "imgURL": "https://assets2.cbsnewsstatic.com/hub/i/r/2024/06/02/587b2f01-5bd1-4724-9129-39a0ba97b7cf/thumbnail/1200x630/6b5c8a0264a73b9a0171c0496dc0f103/ledecky-4-1920.jpg?v=d7bbca61a2ddd34e0cfc8fb46aec1df3"
    },
    {
      "news_number": 3,
      "title": "Where do things stand with Vikings, Justin Jefferson?",
      "summary": "The Vikings and receiver Justin Jefferson currently do not have a long-term deal in place.\nObviously, the sooner a deal is finalized, the better prepared Jefferson will be for the 2024 season.\nEven if it happens as soon as today or tomorrow, that doesn’t mean the Vikings didn’t explore their options.\nRegardless of whether the Vikings tried to get Nabers, they’ve got Jefferson.\nTime will tell whether it happens this week, next month, or just before Week 1, when the Vikings becomes the first NFL team to face Nabers.",
      "url": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/where-do-things-stand-with-vikings-justin-jefferson",
      "imgURL": "https://nbcsports.brightspotcdn.com/dims4/default/98a2b91/2147483647/strip/true/crop/5201x2926+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2F5f%2F9f%2Fbcdec57f4561aeeba47b2d934271%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2149401363"
    },
    {
      "news_number": 4,
      "title": "N.H.L.’s Move to Salt Lake City Is Latest Sports Downsizing",
      "summary": "The team, which will be renamed, will begin play next season in the Delta Center in Salt Lake City, home of one of the Smiths’ other teams, the Utah Jazz of the National Basketball Association.\nSalt Lake City’s metropolitan area is less than half the size of Phoenix’s; Salt Lake City is the 29th-largest media market while Phoenix is the 11th largest.\nBut the league’s decision was less about the size of Salt Lake City and more about its demographics.\nLike Phoenix, Salt Lake City is one of the country’s fastest-growing cities.\nBut in Utah, a thriving tech industry has attracted an influx of young workers with disposable incomes.",
      "url": "https://www.nytimes.com/2024/06/02/business/nhl-salt-lake-city-phoenix.html",
      "imgURL": "https://static01.nyt.com/images/2024/05/24/multimedia/00Biz-Utah-Hockey-hzvt/00Biz-Utah-Hockey-hzvt-facebookJumbo.jpg"
    },
    {
      "news_number": 5,
      "title": "Where to watch Real Madrid vs. Borussia Dortmund: Live stream Champions League final online, time, TV channel",
      "summary": "Then again this is the Champions League and there are honors to be handed out.\nAll credit to Alex Remiro, David Raya, Manuel Neuer and Yann Sommer, but it's the Borussia Dortmund man who takes this prize.\nEnter Mats Hummels, who leads the Champions League in tackles, interceptions and clearances with the second-most ball recoveries.\nEnter Mats Hummels, who leads the Champions League in tackles, interceptions and clearances with the second-most ball recoveries.\nFor now, at least that means that of the 15 players with the most Champions League games ever, 10 are currently still active.",
      "url": "https://www.cbssports.com/soccer/news/where-to-watch-real-madrid-vs-borussia-dortmund-live-stream-champions-league-final-online-time-tv-channel/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/01/13766227-21b6-4538-980b-fe24bb4e3725/thumbnail/1200x675/81064c787194ac3223bdbf5c7627cf2a/untitled-design-2024-06-01t192607-559.png"
    },
    {
      "news_number": 6,
      "title": "Top Sports Talk Host Tears Into Trump For 'Trying To Sell Me An America That Doesn't Exist'",
      "summary": "Advertisement“He’s trying to sell me an America that doesn’t exist,” Cowherd said Thursday on his podcast.\n“I live in a nice neighborhood in L.A. and it’s not … one of those swanky neighborhoods, but I don’t see crime.\nAdvertisement“Donald Trump is now a felon,” Cowherd said.\n“His campaign chairman was a felon.\nJulia Nikhinson/Associated Press“If everybody in your social circle is a felon, I don’t think it’s ‘rigged,’” Cowherd added.",
      "url": "https://www.huffpost.com/entry/former-espn-host-tears-into-trump-for-trying-to-sell-me-an-america-that-doesnt-exist_n_665b6628e4b0ba2cffe6e78f",
      "imgURL": "https://img.huffingtonpost.com/asset/665b7e102200002f0cec42fd.jpeg?cache=HCIrENFTaS&ops=1200_630"
    },
    {
      "news_number": 7,
      "title": "Yankees vs. Giants Highlights | MLB on FOX",
      "summary": "my favsDISMISSAccess and manage your favorites here",
      "url": "https://www.foxsports.com/watch/fmc-72nbn8u6u1vtv9ao",
      "imgURL": "https://a57.foxsports.com/static-media.fox.com/fmc/prod/sports/VX-9276737/1280/720/v68ewl9w7tyhr1xa.jpg?ve=1&tl=1"
    },
    {
      "news_number": 8,
      "title": "What sports are American athletes chasing their nation's first Olympic gold medal?",
      "summary": "American athletes have won over a thousand gold medals since the revival of the Olympic Games in 1896, yet, there are still a handful of sports where athletes from the US have yet to stand on the top step of the podium.\nThe list isn’t long, but it is full of sports where American athletes could challenge for a medal at the Olympic Games Paris 2024.\nFrom the single track to the climbing wall, Olympics.com explores several sports where American athletes look to pursue their nation’s first gold medal.\nAs National Olympic Committees have the exclusive authority for the representation of their respective countries at the Olympic Games, athletes' participation at the Paris Games depends on their NOC selecting them to represent their delegation at Paris 2024.",
      "url": "https://olympics.com/en/news/what-sports-are-team-usa-athletes-chasing-first-olympic-gold-medal",
      "imgURL": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/ikc98czxinloz7a6m0tk"
    },
    {
      "news_number": 9,
      "title": "UFC 302 -- Islam Makhachev vs. Dustin Poirier: Results, highlights, fight card, winners, complete guide",
      "summary": "The native of Louisiana fell short in his third attempt to become champion, but put on arguably his best performance in a title fight to date.\nAlex Morono via unanimous decision (29-28, 29-28, 29-28)Randy Brown def.\nElizeu Zaleski via unanimous decision (29-28, 29-28, 29-28)Roman Kopylov def.\nPhil Rowe via unanimous decision (29-28, 29-28, 30-27)Bassil Hafez def.\nMickey Gall via unanimous decision (30-27, 30-27, 29-28)Ailin Perez def.",
      "url": "https://www.cbssports.com/mma/news/ufc-302-islam-makhachev-vs-dustin-poirier-results-highlights-fight-card-winners-complete-guide/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/02/6d552a15-c042-4c1c-a396-8ef32327959b/thumbnail/1200x675/cd19537879bd73016de15861f2aa9164/islam-makhachev-walkout-302.jpg"
    },
    {
      "news_number": 10,
      "title": "Here are Saturday's high school sports results for the Appleton and Green Bay area",
      "summary": "Kimberly 2, De Pere 0KIMBERLY - The Papermakers advanced to Thursday’s sectional semifinals with the win over the Redbirds.\nKimberly, now 18-2-1, will host Appleton West in the sectional semifinals.\nPulaski 5, Watertown 0PULASKI - The Red Raiders shut out the Goslings to move on to the sectional semifinals.\nDivision 3Notre Dame 4, Marinette 0GREEN BAY - The Tritons put themselves in a familiar spot, advancing to the sectional semifinals with the win over the Marines.\nPlymouth 12, Fox Valley Lutheran 0PLYMOUTH - The top-seeded Panthers overwhelmed the Foxes to advance to Thursday’s sectional semifinals.",
      "url": "https://www.postcrescent.com/story/sports/high-school/2024/06/02/here-are-saturdays-high-school-sports-results-for-the-appleton-and-green-bay-area/73935706007/",
      "imgURL": "https://www.postcrescent.com/gcdn/authoring/authoring-images/2024/06/02/PAPN/73942921007-usat-wiaa-state-track-and-field-day-2-07535-052824-wag.jpg?crop=2999,1688,x0,y378&width=2999&height=1688&format=pjpg&auto=webp"
    },
    {
      "news_number": 11,
      "title": "Pritzker bets FanDuel, DraftKings won't leave Illinois over hefty sports wagering tax hike",
      "summary": "That’s up from the 15% flat rate levied against sportsbooks since the now $1 billion Illinois industry launched in 2020.\nFanDuel paid almost $62 million in state taxes on nearly $411 million in revenue last year, the biggest windfall in the state.\nDraftKings paid about $48 million in tax on $319 million in revenue, Illinois Gaming Board records show.\nUnder the graduated system, FanDuel would’ve paid the state about $145 million, while DraftKings would’ve been on the hook for $109 million.\nMatheson’s research on sports betting markets has found no correlation between higher state tax rates and the amount of money people gamble.",
      "url": "https://chicago.suntimes.com/casinos-gambling/2024/06/02/illinois-sports-betting-tax-hike-jb-pritzker",
      "imgURL": "https://cst.brightspotcdn.com/dims4/default/f082612/2147483647/strip/true/crop/6122x3495+0+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F3b%2Fcd%2Ffd0b33a5445c8f210b1897fe63d0%2Fpritzker-011124-13.jpg"
    },
    {
      "news_number": 12,
      "title": "Caitlin Clark's next WNBA game: How to watch the Indiana Fever vs. New York Liberty tonight",
      "summary": "How to watch Caitlin Clark's next game: Indiana Fever vs. New York Liberty:Fubo TV Watch (almost) every WNBA game: Get ESPN, ESPN2, ABC, CBS, CBS Sports Network, Ion and NBA TV Try free at FuboDate: Sunday, June 2Time: 7 p.m.\nETLocation: Barclay Center, Brooklyn, NYTV channel: NBA TVStreaming: WNBA League Pass, Fubo, DirecTVWhen is Caitlin Clark's next WNBA game?\nCaitlin Clark continues her rookie WNBA season tonight with an away game against the New York Liberty.\nNew York vs. Indiana game channel:The Liberty at Fever game will air on NBA TV and stream on WNBA League Pass.\n$35 for the season at WNBABest way to watch WNBA games:Looking to keep up with Caitlin Clark's rookie season?",
      "url": "https://sports.yahoo.com/caitlin-clarks-next-wnba-game-how-to-watch-the-indiana-fever-vs-new-york-liberty-tonight-113006133.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/qpLGYsZ1huyglHY9nXXdsQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/095cd050-1f5a-11ef-9b7a-39a2bc94098d"
    },
    {
      "news_number": 13,
      "title": "How grievance splintered American sports",
      "summary": "Grievance Games is an in-depth look at how the promise of sports as a national unifier has buckled under the pressures of grievance and division.\n(Jahi Chikwendiu/The Washington Post)That description, melting pot, is a mossy old American concept now.\n(Jahi Chikwendiu/The Washington Post) Colt Dixon readies for prom with his mother, Stevi.\n(Jahi Chikwendiu/The Washington Post)White has tried to build the most responsible space for his team.\n(Jahi Chikwendiu/The Washington Post)",
      "url": "https://www.washingtonpost.com/sports/interactive/2024/american-sports-grievance-culture/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GYGM3SKL7NAMFJ7ERT6BFVJHYM.jpg&w=1200"
    },
    {
      "news_number": 14,
      "title": "56-year-old man shoots himself in buttocks at Brighton sports complex",
      "summary": "LIVINGSTON COUNTY, MI -- A man shot himself in the buttocks at a Brighton sports complex, according to police.\nGreen Oak Township police were called shortly after 7 p.m. Friday, May 31, to the Legacy Center Sports Complex, 9299 Goble Drive in Brighton, for a report of a “loud boom,” police said in a news release.\nA 56-year-old man from Brighton had shot himself in the buttocks while adjusting his pants, police said.\nNo one else was injured during the incident, according to a statement from complex officials.\nThe Green Oak Township police were assisted by crews from the Green Oak Township Fire Department, Livingston County Ambulance and Livingston County Central Dispatch.",
      "url": "https://www.mlive.com/news/ann-arbor/2024/06/56-year-old-man-shoots-himself-in-buttocks-at-brighton-sports-complex.html",
      "imgURL": "https://www.mlive.com/resizer/v2/7DEQV7NJM5CEVE6NFWCPVNPERI.jpg?auth=fe1c4500c707bb2b96b161119c7392e3c67c1d9dfddd0d423e25ac941dd023ec&width=1280&quality=90"
    },
    {
      "news_number": 15,
      "title": "Three-Peat! Tennessee Athletics Captures Third Consecutive SEC All-Sports Trophy",
      "summary": "Tennessee Athletics etched its name into the record book, becoming just the second school to capture three consecutive SEC All-Sports titles, presented by USA Today Network.\n\"Securing the SEC All-Sports Trophy for the third consecutive year is a testament to the dedication and hard work of everyone involved.\nTennessee Athletics becoming the top athletics department in the SEC coincides with White taking over the department's lead in 2021.\nTennessee also finished first in the SEC Men's All-Sports standings and second in the SEC Women's All-Sports standings.\nTennessee joined Florida as the only school to win multiple SEC All-Sports titles.",
      "url": "https://utsports.com/news/2024/5/28/general-three-peat-tennessee-athletics-captures-third-consecutive-sec-all-sports-trophy.aspx",
      "imgURL": "https://dudh74xyv196a.cloudfront.net/images/2024/5/27/UTAD_USA_Today_All_Sports_Champions_Web_2024_7_.jpg?preset=large.socialmediaimage"
    },
    {
      "news_number": 16,
      "title": "Sports Medicine Report: Five players remain out as Sporting heads to Minnesota",
      "summary": "Sports Medicine Report is SportingKC.com’s look at the latest health update around the team ahead of upcoming matches and is presented by Children’s Mercy Kansas City.\nAll details listed are from the league’s official Player Status Report that is submitted the day prior to the match.\nSporting Kansas City hits the road this weekend to conclude a busy stretch of five matches in 15 days with a visit to Allianz Field to take on Minnesota United FC on Saturday night.\nSporting still has five players out due to injury, but will welcome midfielder Memo Rodriguez back into the fold after he served a one-game suspension due to yellow card accumulation on Wednesday.\n#MINvSKC Sports Medicine ReportSporting Kansas CityQuestionableNoneOutMidfielder Danny Flores (Concussion Protocol)(Concussion Protocol) Defender Logan Ndenbe (ACL)(ACL) Defender Kayden Pierre (Ankle)(Ankle) Midfielder Erik Thommy (Hamstring)(Hamstring) Midfielder Remi Walter (Knee)Minnesota UnitedQuestionableNoneOutDefender Hugo Bacharach (Knee)(Knee) Midfielder Franco Fragapane (Leg)",
      "url": "https://www.sportingkc.com/news/sports-medicine-report-five-players-remain-out-as-sporting-heads-to-minnesota-june-1-2024",
      "imgURL": "https://images.mlssoccer.com/image/private/t_q-best/mls-skc/auu6wx0d8erlzuakiwkw.jpg"
    },
    {
      "news_number": 17,
      "title": "Not Allowed",
      "summary": "",
      "url": "https://www.paramountpressexpress.com/cbs-sports/shows/college-football/releases/?view=109878-cbs-sports-announces-2024-college-football-broadcast-schedule",
      "imgURL": ""
    },
    {
      "news_number": 18,
      "title": "SBJ Weekly — May 27, 2024: Sports Business Awards",
      "summary": "May 29, 2024On this week’s pod, CBS Sports’ Kate Abdo gets...Read MoreOn this week’s pod, CBS Sports’ Kate Abdo gets us set for the UEFA Champions League final.\nESPN’s Ramona Shelburne shares what went into executive producing her upcoming FX mini-series, \"Clipped,\" about the Donald Sterling saga, and SBJ's Mollie Cahillane joins to tell us who's up and who's down in sports media.",
      "url": "https://www.sportsbusinessjournal.com/Journal/Issues/2024/05/27.aspx",
      "imgURL": "https://www.sportsbusinessjournal.com/favicon.png"
    },
    {
      "news_number": 19,
      "title": "2024 Xfinity U.S. Gymnastics Championships Results",
      "summary": "At the U.S. Championships, Brody Malone is expected to compete in the all-around for the first time since major leg surgeries.",
      "url": "https://www.nbcsports.com/olympics/news/usa-gymnastics-championships-2024-results",
      "imgURL": "https://nbcsports.brightspotcdn.com/dims4/default/dea4b6f/2147483647/strip/true/crop/3000x1688+0+156/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fb0%2F43%2F5c1a8b73453594216482d4def455%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2155527114"
    },
    {
      "news_number": 20,
      "title": "Everything I learned about EA Sports’ College Football 25 after two hours of gameplay",
      "summary": "After 11 years away, the college football game is coming back this July, and the people who make the game emphasized that this game is for all of FBS college football.\nTo cut to the chase and get to what they and everyone else really want to know: Playing College Football 25 was very fun.\nThe College Football 25 event included a three-hour period for gameplay and interviews, so I played about two hours of game action on the PS5.\nThe event offered so much information about College Football 25 that we’ve split this up into multiple stories and will have more to come after today.\nAdvertisementWhile most sports video games are just updates from the year before, College Football 25 is a completely new game.",
      "url": "https://www.nytimes.com/athletic/5523815/2024/05/29/ea-sports-college-football-25-video-game-features/",
      "imgURL": "https://cdn.theathletic.com/app/uploads/2024/05/28103818/CFB25_Pre-Snap-Recognition-1_WebScreen_004_16x9_Watermark-e1716907223841.png"
    },
    {
      "news_number": 21,
      "title": "2024 RBC Canadian Open TV schedule, live stream, where to watch, tee times, channel, radio, golf coverage",
      "summary": "The 2024 RBC Canadian Open looks a little different this year as the tournament returns to Hamilton Golf & Country Club for the first time since 2019 and seventh time in event history.\nFive years ago, it was Rory McIlroy who blitzed the field by seven for the first of his two Canadian Open titles, but last year, it was Nick Taylor who became a local hero.\nBeating Tommy Fleetwood with a 72-foot eagle putt on the third playoff hole, Taylor became the first Canadian in 69 years to claim his home country's open.\nCanadians will hope to break another drought this week as countrymen have not won the Canadian Open in back-to-back years since 1913-14.\nAll times Eastern; streaming start times approximatedRound 4 - SundayRound starts: 8 a.m.PGA Tour Live: 8 a.m. - 1:30 p.m. -- PGA Tour LiveLive TV coverage: 1:30 - 2:30 p.m. on Golf Channel, fubo (Try for free)Live streaming: 1:30 - 2:30 p.m. on PeacockLive TV coverage: 2:30 - 6:30 p.m. on CBSLive simulcast: 2:30 - 6:30 p.m. on CBSSports.com and the CBS Sports AppRadio: 1 - 6:30 p.m. -- PGA Tour Radio",
      "url": "https://www.cbssports.com/golf/news/2024-rbc-canadian-open-tv-schedule-live-stream-where-to-watch-tee-times-channel-radio-golf-coverage/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/05/29/b9ec9edd-a940-46e0-85ee-19b4ec8b7e7b/thumbnail/1200x675/d0b030a5dedc88bfd436f2745af634e6/rbc-canadian-open-new-flag-g.png"
    },
    {
      "news_number": 22,
      "title": "Broncos salary cap update going into the summer",
      "summary": "Even with quarterback Russell Wilson accounting for $32 million in “dead money” next year, the Denver Broncos are projected to have about $37 million in salary cap space in 2025.\nThat’s a conservative estimate based on a projection of the NFL’s cap only increasing by $4.6 million.\nWilson’s dead money cap hit is much larger this year ($53 million).\nDenver is estimated to have about $7,726,196 in remaining cap space, according to OverTheCap.com.\nThe Broncos will likely want to take most (or all) of that remaining cap into the 2024 season to allow for injured reserve payments and the possibility of in-season additions to the roster.",
      "url": "https://sports.yahoo.com/broncos-salary-cap-going-summer-130033800.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/tV.FJ4BwZram.s_pTFDW2g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/denver_broncos_wire_usa_today_sports_articles_584/f2528a6fdb1b431dcab9d4bd18a989a6"
    },
    {
      "news_number": 23,
      "title": "Vince Carter: Kobe Bryant should be in the GOAT conservation",
      "summary": "But of course, the best player of that decade was late Los Angeles Lakers legend Kobe Bryant.\nCarter, who played against all three legends, said that Bryant should be at the center of those debates along with Jordan and James.\n“They deserved to be talked about as a trio – not a duo” Vince Carter says Kobe should be included in GOAT discussion 👀🐐 (via @TaylorRooks) pic.twitter.com/UlcwScBJde — Bleacher Report (@BleacherReport) May 30, 2024“I’m truly thankful I got a chance to play against Michael Jordan, Kobe Bryant and of course LeBron,” said Carter.\n“I’m gonna name those three because we’re always talking about the greatest to play the game, Kobe Bryant should and will always, out of my mouth, be named as one of the greatest to ever play the game.\n“I don’t understand why,” Carter said when asked Bryant should be in the discussion and why he isn’t.",
      "url": "https://sports.yahoo.com/vince-carter-kobe-bryant-goat-004438903.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/NjF0iY53iX40VT1fZyqXag--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03MjA-/https://media.zenfs.com/en/lebron_wire_usa_today_sports_articles_234/3ec7748652bdfd2ad53973ff87a00924"
    },
    {
      "news_number": 24,
      "title": "Pachuca beat MLS' Columbus Crew to claim sixth Concacaf Champions Cup title",
      "summary": "Pachuca have lifted their sixth ever Concacaf Champions Cup title defeating the Columbus Crew 3-0 and maintaining their undefeated record in finals.\nBehind goals from Salomon Rondon, Miguel Rodriguez and Pachuca were able to get past the Crew after going ahead in the first half of play.\nCucho Hernandez's return to the XI wasn't enough to spark an attacking run but Pachuca winning the midfield battle is what lost the match for Columbus.\nAt the half, Pachuca's lead proved to be too much to deal with despite Wilfried Nancy's attempts to switch things up, which didn't change the tide enough in the second half.\nThis books a place in the Club World Cup for Pachuca while the Crew will still have multiple chances for silverware between the Leagues Cup and MLS Cup this season.",
      "url": "https://www.cbssports.com/soccer/news/pachuca-beat-mls-columbus-crew-to-claim-sixth-concacaf-champions-cup-title/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/02/7bbdf83c-d5e5-43f4-8366-0f7117a5c378/thumbnail/1200x675/238eb8cb2f71f671b0cb93637c10f7df/pachuca.jpg"
    },
    {
      "news_number": 25,
      "title": "UFC 302 full results: Islam Makhachev retains belt with 5th-round submission of Dustin Poirier",
      "summary": "In perhaps the most dangerous bout of his reign as UFC lightweight champion, Islam Makhachev lived up to his title as the promotion's top pound-for-pound fighter.\nThe best in the world 😮‍💨@MAKHACHEVMMA remains the lightweight champion with a submission victory!\n#UFC302 pic.twitter.com/LpSwj8PH0T — UFC (@ufc) June 2, 2024It was yet another stellar display of creativity and talent by Makhachev, who said he would next like to compete for the UFC welterweight crown, currently held by Leon Edwards.\nHere's how the entire UFC 302 card went down.\nUFC 302 main card resultsUFC 302 prelims resultsUFC 302 early prelims full results",
      "url": "https://sports.yahoo.com/live/ufc-302-full-results-islam-makhachev-retains-belt-with-5th-round-submission-of-dustin-poirier-215325511.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/jeMnDEq2hvH1H8kbXHiWug--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MzM-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/633e0d20-209d-11ef-b8f5-11cc37bc92b8"
    },
    {
      "news_number": 26,
      "title": "Real Madrid win the Champions League with their normal blueprint and we all knew it was coming",
      "summary": "LONDON -- Perhaps Real Madrid simply do not know of another way to win.\nWhen the Champions League anthem blares they dust out a familiar blueprint: be second best, win anyway.\nForget about it Jake, it's Real Madrid.\nWith the ball Madrid seemed to have no sense of how to get it to their most effective players.\nReal Madrid didn't need to Real Madrid their way to glory.",
      "url": "https://www.cbssports.com/soccer/news/real-madrid-win-the-champions-league-with-their-normal-blueprint-and-we-all-knew-it-was-coming/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/06/01/c7d9cf3b-91a8-40d3-86f2-4a6eebb414da/thumbnail/1200x675/3081e3df747c5cccf203788c0d549ae0/real.jpg"
    },
    {
      "news_number": 27,
      "title": "Sky's Chennedy Carter declines to talk about foul on Caitlin Clark as discussion of physicality, officiating continues",
      "summary": "Carter hit a jumper over Kelsey Mitchell, and as Aliyah Boston waited to inbound the ball to Clark, Carter put her shoulder into Clark near the baseline.\nNow another Sky player with a cheap shot on Caitlin Clark.\n“I ain’t answering no Caitlin Clark questions,” Carter said.\n“It’s a physical game,” Clark said.\n“I’ll probably send it in to the league,” Sides said.",
      "url": "https://sports.yahoo.com/skys-chennedy-carter-declines-to-talk-about-foul-on-caitlin-clark-as-discussion-of-physicality-officiating-continues-200716541.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/wyihECCPWFHqvXfedVVWbA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/7fbdce00-2051-11ef-affb-4c87b63a6414"
    },
    {
      "news_number": 28,
      "title": "As Mets retire his No. 18, Darryl Strawberry tells fans 'I'm so sorry for ever leaving'",
      "summary": "18, Darryl Strawberry tells fans 'I'm so sorry for ever leaving' Published Jun.\n18 was being retired and addressed the New York Mets fans he had jilted 34 years earlier.\n\"I mean this from the bottom of my heart, I’m so sorry for ever leaving you guys,\" Strawberry told the crowd of 30,600, his voice slowing.\nI never played baseball in front of fans greater than you guys.\"\nFOLLOW Follow your favorites to personalize your FOX Sports experience Major League Baseball New York Mets Los Angeles Dodgersshare",
      "url": "https://www.foxsports.com/stories/mlb/mets-retire-his-no-18-darryl-strawberry-tells-fans-im-so-sorry-ever-leaving",
      "imgURL": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2024/06/1408/814/strawberry1.jpg?ve=1&tl=1"
    },
    {
      "news_number": 29,
      "title": "ACC realignment 2024: Insider news, reports, conference rumors, updates by top North Carolina experts",
      "summary": "The latest round of college conference realignment resulted in the collapse of the Pac-12 and the expansion of the four remaining Power 5 Conferences.\nOne school that has become the topic of conference realignment discussions is North Carolina.\nThe Inside Carolina staff is composed of experienced, professional reporters and analysts whose job is to provide readers with objective coverage.\nNorth Carolina conference realignment news, updatesNorth Carolina is one of the founding members of the ACC, but as UNC insiders note, conference loyalties may not matter when it comes to the next round of conference realignment.\n*Terms: This offer is only available for new members who sign up for an Inside Carolina annual subscription.",
      "url": "https://www.cbssports.com/college-basketball/news/acc-realignment-2024-insider-news-reports-conference-rumors-updates-by-top-north-carolina-experts/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2018/09/10/4474aaa0-f641-4b60-bf93-deaac43ebc1a/thumbnail/1200x675/9c6d4ccc55370b50d62a1dfa6c003f9b/usatsi-10316660-220956-lowres.jpg"
    },
    {
      "news_number": 30,
      "title": "Deontay Wilder vs. Zhilei Zhang fight predictions, start time, odds, preview, undercard, expert picks",
      "summary": "That power wasn't able to put Fury away in their three fights, where Wilder managed a split draw before being stopped twice.\nThe Parker fight raised new concerns for Wilder as he did not fight aggressively, threw very few punches and looked generally uninterested in being in the fight en route to losing by scores of 118-111, 118-110 and 120-108.\nIf they do proceed with stripping Usyk, the winner of Hrgovic vs. Dubois would presumably be elevated to world champion.\nETHow to watch: DAZN PPV, PPV.com | Price: $69.99PredictionFights are rarely more difficult to predict than Wilver vs. Zhang.\nWilder has better speed and better power than Zhang, but that means nothing if Wilder approaches this fight the same way he did against Parker.",
      "url": "https://www.cbssports.com/boxing/news/deontay-wilder-vs-zhilei-zhang-fight-predictions-start-time-odds-preview-undercard-expert-picks/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/05/31/78c25c72-7dc9-4c30-b482-67fcd6d754bf/thumbnail/1200x675/24f6a9b8551df95c136f0d24acf3bb8d/zhang-wilder.jpg"
    },
    {
      "news_number": 31,
      "title": "Union Sports & Entertainment Announce Strategic Investment in Lyngby Boldklub of the Danish Superliga",
      "summary": "As part of its ongoing commitment to being a leader in player development, Union Sports & Entertainment today announced a strategic partnership and investment with Lyngby Boldklub of the Danish Superliga.\n“We admire Lyngby’s achievements and are confident that we can assist each other through thought-sharing and strategic collaboration,” said Jay Sugarman, Union Sports & Entertainment Chairman.\nWe think this is the right model for Lyngby Boldklub,\" says Tommy Petersen, chairman of the board of Lyngby Boldklub A/S.\nLyngby Boldklub is a prestigious Danish club, founded in 1921, that has won both Danish championships and cup titles.\nOver the years, Lyngby Boldklub has produced numerous players and coaches who are widely recognized in the football world.",
      "url": "https://www.philadelphiaunion.com/news/union-sports-entertainment-announce-strategic-investment-in-lyngby-boldklub-of-the-danish-superliga",
      "imgURL": "https://images.mlssoccer.com/image/private/t_q-best/mls-phi/bjnxbdilctfmygu6tf0t.jpg"
    },
    {
      "news_number": 32,
      "title": "EA Sports College Football 25: A look at gameplay, NIL, Road to Glory, Dynasty with someone who's played it",
      "summary": "The hype and anticipation around the release of EA Sports' \"College Football 25\" is building ahead of the July 19 release date.\nFans have been lighting up message boards and social media asking about gameplay, Dynasty mode, Road to Glory, stadium models, how NIL will factor in and more.\nLike how Tennessee does the checkerboard or how a different team will do the stripes.\nCS: Did you have a chance to play the Dynasty or Road to Glory game modes?\nBE: There are a lot of different things you can do.",
      "url": "https://www.cbssports.com/college-football/news/ea-sports-college-football-25-a-look-at-gameplay-nil-road-to-glory-dynasty-with-someone-whos-played-it/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/05/28/97096311-2c14-488f-99c3-a61fea882dee/thumbnail/1200x675/4e4c0046e6a5425250bdf6f831513e15/ea-cover.jpg"
    },
    {
      "news_number": 33,
      "title": "2024 NFL season: 100 things to know with Week 1 kickoff approaching; key games, stories, odds, predictions",
      "summary": "Ready or not, the 2024 NFL season is fast approaching, with just under 100 days until the official start of the regular season.\nPresenting 100 things to know for the 2024 NFL season:Key facts and figuresGetty Images1.\nChiefs quarterback Patrick Mahomes (+500) previously won MVP in 2018 and 2022.\nTexans quarterback C.J.\nCowboys quarterback Dak Prescott (+1600) threw a career-high 36 scores in 2023.",
      "url": "https://www.cbssports.com/nfl/news/2024-nfl-season-100-things-to-know-with-week-1-kickoff-approaching-key-games-stories-odds-predictions/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/05/27/a7909efb-b4c1-46e3-b3bd-9aa0437527d3/thumbnail/1200x675/e23aa606d1a4d3e45b946428c926dcf6/nfl100days-v2.jpg"
    },
    {
      "news_number": 34,
      "title": "FOX Sports Unveils Broadcast Teams for UEFA EURO 2024™ and CONMEBOL Copa América 2024™",
      "summary": "FOX Sports Unveils Broadcast Teams for UEFA EURO 2024™ and CONMEBOL Copa América 2024™Soccer SHARELOS ANGELES – FOX Sports, America’s English-language home for this year’s sunrise-to-sunset presentation of UEFA EURO 2024™ and CONMEBOL Copa América 2024™, today unveils its complete lineup of distinguished broadcast teams ahead of the network’s massive Summer of Soccer featuring the world’s biggest national teams and brightest stars.\nUEFA EURO 2024™ Match Analysts:Landon Donovan returns to the broadcast booth as lead match analyst for UEFA EURO 2024™.\nCONMEBOL Copa América 2024™ Match Analysts:Stu Holden is FOX Sports’ lead soccer match analyst for the network’s premier soccer coverage.\nHe most recently called matches at the FIFA World Cup Qatar 2022™ and FIFA World Cup 2018™.\nEdu also starred as a studio analyst on FIFA WORLD CUP TONIGHT at FIFA World Cup Qatar 2022™.",
      "url": "https://www.foxsports.com/presspass/blog/2024/05/30/fox-sports-unveils-broadcast-teams-for-uefa-euro-2024-and-conmebol-copa-america-2024/",
      "imgURL": "https://foxsports-wordpress-www-prsupports-prod.s3.amazonaws.com/uploads/sites/2/2024/05/EURO-Copa-Broadcast-Teams.jpg"
    },
    {
      "news_number": 35,
      "title": "'It's just up from here,' future of women's sports bright in Austin",
      "summary": "Support for women’s sports is expanding across the United States, and today the City of Austin dipped its foot into that pond.\nMembers in attendance represented various women’s sporting clubs around town including (women’s soccer), (women’s full tackle football), (volleyball), (women’s ultimate frisbee), , Rugby, and .\nReed says the women’s teams came together a few weeks back to form a coalition.\nFaucette was a three-time All-American and the 2010 Big 12 Player of the Year for the Texas Women’s Volleyball team.\n“I think honestly, the limits are just endless for women’s sports here.”As for the future of women’s sports in Austin to Messina, it looks like equal coverage with men’s sports.",
      "url": "https://cbsaustin.com/news/local/its-just-up-from-here-future-of-womens-sports-bright-in-austin",
      "imgURL": "https://cbsaustin.com/resources/media/64ee5a7f-60b3-4b3c-9824-71bd03c32005-large16x9_thumb_61939.png"
    },
    {
      "news_number": 36,
      "title": "United Way, Lions Pride Sports gearing up for Fight to Unite 3",
      "summary": "It’s Fight to Unite 3, which is a collaboration between the United Way of the Brazos Valley and Lions Pride Sports.\nOndrasek is the United Way’s president and CEO and said the funds will help support the organization’s 28 partner agencies.\nKBTX Brazos Valley This Morning(Recurring)One is the Boys & Girls Club of the Brazos Valley, the host location.\nAlong with hosting, the Boys & Girls Club will have concessions.\nKBTX Brazos Valley This Morning(Recurring)Wrestlers like Ax Mason are excited to support the Boys & Girls Club along with United Way’s other partner agencies.",
      "url": "https://www.kbtx.com/2024/05/31/united-way-lions-pride-sports-gearing-up-fight-unite-3/",
      "imgURL": "https://gray-kbtx-prod.cdn.arcpublishing.com/resizer/v2/CVUAF3DXQJHMXLKVGZSLCV76BA.png?auth=903ab581732a89c2c3e84aa3f0e67e8352ac80b93b5654bc75e058b901021b7d&width=1200&height=600&smart=true"
    },
    {
      "news_number": 37,
      "title": "Why Isaiah Hartenstein could be the best big man available on the market",
      "summary": "Hartenstein never relinquished the role through New York’s run to Game 7 of the Eastern Conference second round.\nThe things they were able to do night in and night out … they kept fighting.”Isaiah Hartenstein is likely headed for a major payday.\nSo, which team could attempt to pry Hartenstein free?\nHartenstein has also shown an ability to coexist with another big man amid various lineup structures with New York.\n“A lot of players who don’t play, they’re OK on offense but don’t get why they’re not really on the court,” Hartenstein said.",
      "url": "https://sports.yahoo.com/why-isaiah-hartenstein-could-be-the-best-big-man-available-on-the-market-134657059.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/SrM.m0xqA9bLZFaYYJtv_Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/a7d00170-1f01-11ef-bcff-cbbd613522ab"
    },
    {
      "news_number": 38,
      "title": "QB purgatory: Path for Giants, Browns and five other teams to change their fate at NFL's most crucial position",
      "summary": "So the Giants did what a lot of teams do in QB purgatory.\nThat's one example teams currently in QB purgatory can point to for some hope, but the stars have to align.\nWith that being said, here's the path out of QB purgatory for seven teams right now.\nThe Saints' path out of QB purgatory is to draft a QB in 2025.\nComing soon (Dolphins and Tua Tagovailoa)If there's one team heading toward QB purgatory it's the Dolphins with Tua Tagovailoa.",
      "url": "https://www.cbssports.com/nfl/news/qb-purgatory-path-for-giants-browns-and-five-other-teams-to-change-their-fate-at-nfls-most-crucial-position/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/05/31/f4466e0c-0d49-46c2-b8ab-b2ba33941003/thumbnail/1200x675/04196ff722034dcb1f594b5a87302201/gettyimages-1437571040.jpg"
    },
    {
      "news_number": 39,
      "title": "SEC again considering nine-game league schedule weighing revenue, College Football Playoff access",
      "summary": "DESTIN, Fla. -- The SEC is again contemplating an expanded conference football schedule with an aim of increasing revenue as the entire college athletics enterprise faces new financial challenges.\nAmong the factors the SEC is weighing is how the expanded College Football Playoff will treat leagues with nine conference games (Big Ten, Big 12) compared to those with eight (SEC, ACC).\nAt least nine games spread among six SEC teams would need to be canceled to accommodate a nine-game conference schedule beginning in 2026.\nFlorida has scheduled four nonconference games in 2026 and built arguably the toughest schedule among its peers with three nonconference games against Power Four opponents across four of the next six seasons.\nGeorgia, Missouri and Ole Miss have completely booked their schedules with four nonconference games in multiple years beyond 2026.",
      "url": "https://www.cbssports.com/college-football/news/sec-again-considering-nine-game-league-schedule-weighing-revenue-college-football-playoff-access/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2019/07/11/e2e481b8-5684-4855-bfac-31906ba23f5d/thumbnail/1200x675/3b7318a707e605bfa8fb24a3dcd55c99/usatsi-10160639-220956-lowres.jpg"
    },
    {
      "news_number": 40,
      "title": "Sports execs, athletes share their experiences at AAPI symposium",
      "summary": "“As much as we’d like to think that those of us that have trailblazed have made so much change and we’ve altered some of the unfortunate treatment the AAPI and women of color receive in the workplace, that’s not the case,” she said.\n“It happens on the athlete's side, it happens on our side.\nAdvocating for ourselves is still our best asset and something that we all need to work on.\nMaybe we can work on it together as a community.”",
      "url": "https://www.mlb.com/news/aapi-holds-change-the-game-2024-sports-and-culture-symposium",
      "imgURL": "https://img.mlbstatic.com/mlb-images/image/upload/t_2x1/t_w1536/mlb/udqwpn4vm0knwqtoac3y.jpg"
    },
    {
      "news_number": 41,
      "title": "Miller Sports + Entertainment unveils renderings for Salt Lake City ballpark",
      "summary": "Daybreak Field 1 / 3 2 / 3 3 / 3 PREVIOUS NEXTMiller Sports + Entertainment has released renderings of Daybreak Field at America First Square, the new ballpark the company is building south of Salt Lake City for the Class AAA Salt Lake Bees.\nIn that arrangement, the Bees (the Angels’ Triple-A affiliate) would've stayed at the existing Smith’s Ballpark.\nTwo inclusive club spaces located behind home plate are available at Daybreak Field.\n\"Daybreak Field is an important domino in what MSE hopes becomes a process that results in an MLB team playing on the west side of Salt Lake City.\nMiller Real Estate is developing the Power District, a 100-acre site that would house a potential MLB stadium, though the project is moving forward with or without the stadium.",
      "url": "https://www.sportsbusinessjournal.com/Articles/2024/05/30/daybreak-field-america-first-square-renderings-salt-lake-city",
      "imgURL": "https://www.sportsbusinessjournal.com/-/media/Images/Daily/2024/05/30/SLC1.ashx"
    },
    {
      "news_number": 42,
      "title": "NBC SPORTS’ 2024 NOTRE DAME FOOTBALL SCHEDULE HEADLINED BY TWO NOVEMBER PRIMETIME GAMES AND MATCHUPS WITH TRADITIONAL RIVALS ON NBC AND PEACOCK",
      "summary": "ET, Presenting an Exclusive Notre Dame Football Game for Fourth Consecutive YearCoverage of 2024 Notre Dame Football Season Kicks Off vs. Northern Illinois on Sept. 7 at 3:30 p.m.\nThe Seminoles lead the all-time series 6-5 and will play at Notre Dame Stadium for the first time since 2020.\nNotre Dame leads the all-time series, 22-14, and has won four of the last five.\nThroughout the 2024 season, Peacock will simulcast all Notre Dame games airing live on NBC, including pre- and postgame coverage.\nPeacock has previously provided exclusive live coverage of the Notre Dame Football Blue-Gold game, Notre Dame Pro Day and Notre Dame hockey.",
      "url": "https://www.nbcsports.com/pressbox/press-releases/nbc-sports-2024-notre-dame-football-schedule-headlined-by-two-november-primetime-games-and-matchups-with-traditional-rivals-on-nbc-and-peacock",
      "imgURL": "https://nbcsports.brightspotcdn.com/dims4/default/67943dd/2147483647/strip/true/crop/1920x1080+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2F00%2Fb8%2F3a47f14f4997bd8c45ccc33cfb91%2Fnotre-dame-press-box1.png"
    },
    {
      "news_number": 43,
      "title": "Most sports fans in D.C., NoVa 'dislike or hate' Commanders' name and more state headlines • Virginia Mercury",
      "summary": "Our stories may be republished online or in print under Creative Commons license CC BY-NC-ND 4.0.\nWe ask that you edit only for style or to shorten, provide proper attribution and link to our website.\nAP and Getty images may not be republished.\nPlease see our republishing guidelines for use of any other photos and graphics.",
      "url": "https://virginiamercury.com/briefs/most-sports-fans-in-d-c-nova-dislike-or-hate-commanders-name-and-more-state-headlines/",
      "imgURL": "https://virginiamercury.com/wp-content/uploads/2024/01/NewsToKnowgraphic.png"
    },
    {
      "news_number": 44,
      "title": "New Aurora coach preps for home opener as women’s sports command spotlight",
      "summary": "Colette Montgomery is the Minnesota Aurora FC's new head coach and sporting director.\nCourtesy of Minnesota Aurora FCThe Minnesota Aurora FC home opener is Thursday night and the pre-professional team is helmed by new head coach and sporting director Colette Montgomery.\nAnd we’ll probably see this year in the Olympics, just putting women’s soccer particularly on the map,” Montgomery said.\nThursday’s home opener is the third game of this season; the Aurora were victorious over the Chicago Dutch Lions and had a draw against River Light FC.\nLast year, they added a second team — Aurora 2 — in the United Premier Soccer League to foster young talent.",
      "url": "https://www.mprnews.org/story/2024/05/30/new-minnesota-aurora-fc-coach-colette-montgomery-home-opener-women-sports-spotlight",
      "imgURL": "https://img.apmcdn.org/d356b5a8464aadaeeb7cb829ccd155e287be5e9e/widescreen/773bce-20230707-aurora01-webp2000.webp"
    },
    {
      "news_number": 45,
      "title": "Caitlin Clark says opponents 'get away with things' against her: 'I feel like I'm getting hammered'",
      "summary": "Perhaps the biggest challenge for Clark has been adjusting to the increased physicality at the professional level.\n\"I think everybody is physical with me, they get away with things that probably other people don't get away with,\" Clark said after the team's loss to the Los Angeles Sparks on Tuesday.\nThis is a very physical game, and you're going to get pressure, this is professional basketball.\n\"I feel like I'm getting hammered,\" she added following the team's defeat to the Seattle Storm on Thursday.\nThrough nine games, Clark is averaging 17.6 points, 5.1 rebounds and 6.6 assists per game and leads all rookies in scoring and assists.",
      "url": "https://www.cbssports.com/wnba/news/caitlin-clark-says-opponents-get-away-with-things-against-her-i-feel-like-im-getting-hammered/",
      "imgURL": "https://sportshub.cbsistatic.com/i/r/2024/05/23/41907612-2987-4e3d-a71c-d5d57bec30de/thumbnail/1200x675/eebc991e0e308a1ca06dfadf1d939df4/gettyimages-2154227156.jpg"
    },
    {
      "news_number": 46,
      "title": "With latest NCAA settlement, there's no going back to what college sports once was",
      "summary": "Whether they like it or not, Florida State, Ohio State and Penn State need Brown, Bryant, and URI.\nThe college sports world will complete its metamorphosis perhaps as soon as 2025.\nThe C’s will likely need a return of Porzingis’ presence to stake their claim to Banner 18.\n∎Updating the way-too-early Big East derby: 1, UConn; 2, Creighton; 3, Marquette; 4, Providence, 5, Xavier; 6, St. John’s; 7, Butler; 8, Villanova; 9, Seton Hall; 10, Georgetown; 11, DePaul.\n∎Reminiscent of 1999 when PC was one win away from Omaha and the Division I College World Series after the baseball program had been dropped, amiright?",
      "url": "https://www.providencejournal.com/story/sports/2024/05/31/ncaas-2-8-billion-settlement-forever-changes-college-sports/73919637007/",
      "imgURL": "https://www.providencejournal.com/gcdn/authoring/authoring-images/2024/05/31/NPRJ/73919837007-usatsi-22427969.jpg?crop=4031,2268,x0,y0&width=3200&height=1801&format=pjpg&auto=webp"
    }
  ],
  "finance": [
    {
      "news_number": 0,
      "title": "Here's what's really bothering me about the exploding Nasdaq",
      "summary": "And all of it helps to understand the enthusiasm around a lot of big-cap tech stocks.\nBut the shocking Salesforce quarter sent me off to dig into the tech-heavy Nasdaq, specifically the Nasdaq 100 — the 100 largest nonfinancial companies traded on the Nasdaq — to see if there are warning signs creeping into the picture.\nAs of last week, fewer than 60% of stocks in the Nasdaq 100 were holding above their 50-day moving averages.\nSome of the laggards in the Nasdaq 100 include consumer names Dollar Tree (DLTR) and Lululemon (LULU).\nAre there values to be had among Nasdaq stocks not participating in the current rally?",
      "url": "https://finance.yahoo.com/news/heres-whats-really-bothering-me-about-the-exploding-nasdaq-123004440.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/QSLb6MbgmqWTulf1avv7yQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/1850b990-1ea7-11ef-afd5-32ce0018a5d6"
    },
    {
      "news_number": 1,
      "title": "Ones to Watch in Finance, Investing, Private Equity, Hedge Funds",
      "summary": "Chief financial officer and chief operating officer, Block Inc., San Francisco Bay AreaGrowing up in Cleveland, Ahuja saw firsthand the logistical challenges small businesses face by watching her immigrant parents run a day-care center.\nThat’s one of the things that drew her to Block, owner of the Square payments processing platform.\n“I knew the impact that Square could have on small-business owners,” she says.\nBlock, led by Twitter founder Jack Dorsey, has also branched out from the Square brand, building out Cash App (consumer-facing payments), TBD (focused on decentralized technologies) and Spiral (a Bitcoin business).\nProving the point, Block recently raised its annual profit forecast.",
      "url": "https://www.bloomberg.com/features/2024-investing-ones-to-watch/",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iIF6SxQFpPtE/v0/-1x-1.jpg"
    },
    {
      "news_number": 2,
      "title": "I’m a Finance Expert: How To Talk to Your Kids About Your Financial Class",
      "summary": "But understanding money and financial class are very personal topics.\nGOBankingRates spoke to Hsu and other professionals about how to talk to your kids about your financial class and its impact on your family.\nOur expert guide will help you avoid the awkwardness about talking to your kids about financial class while planting the seeds of financial literacy.\nExamine Your BeliefsStart shifting your personal beliefs and feelings around money and financial class.\n“We instill an understanding of putting money to work through investments so there is less worry and a bigger financial safety net.”More From GOBankingRatesThis article originally appeared on GOBankingRates.com: I’m a Finance Expert: How To Talk to Your Kids About Your Financial Class",
      "url": "https://finance.yahoo.com/news/m-finance-expert-talk-kids-120049337.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/gYHnA71MdLBTJaAM.KSmpA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/gobankingrates_644/53bfc470f56849d49d05888d1f6a2889"
    },
    {
      "news_number": 3,
      "title": "Beware the retirement savings 'time bomb,' tax expert warns",
      "summary": "“It’s what you keep that counts.”This planning has always been the core of Slott’s retirement tax planning strategies.\nProvisions in the 2017 Tax Cuts and Jobs Act (TCJA) that lowered individual tax rates are scheduled to expire on Dec. 31, 2025, unless Congress acts to extend them.\nPeople don't do it because they don't want to pay tax before they have to.\nI am worried about tax rates rising for people in their retirement.\nYou're building, you're saving, you're investing, you're sacrificing to have more.",
      "url": "https://finance.yahoo.com/news/beware-the-retirement-savings-time-bomb-tax-expert-warns-150007851.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/.JhgZbW_FU8LLS67RiWr8g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/8bacaf10-1f66-11ef-b3ef-9efae62c9f8e"
    },
    {
      "news_number": 4,
      "title": "10,000 Boomers Are Retiring Daily — How This Changes Banking and Your Finances",
      "summary": "svetikd / Getty ImagesThe “silver tsunami,” or the mass retirement of Boomers, may cause serious changes to our workplaces and incomes.\nLonger Lifespans and Lower Birth RatesThe baby Boomers made up a large portion of the workforce until very recently.\nWithout proper Congressional changes to social security, mass retirement could have potentially negative effects on the economy.\n“The need for additional income is a significant factor in the decision to work past the traditional retirement age when people have inadequate retirement savings,” said Forbes Magazine in an article.\nMore From GOBankingRatesThis article originally appeared on GOBankingRates.com: 10,000 Boomers Are Retiring Daily — How This Changes Banking and Your Finances",
      "url": "https://finance.yahoo.com/news/10-000-boomers-retiring-daily-160054105.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/vcC9jjaUmmtKT0DorzNuPw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/gobankingrates_644/0ae96a49c5134f9e39b30d1c0d588331"
    },
    {
      "news_number": 5,
      "title": "As the climate heats up, meteorology emerges as the new hot degree on Wall Street",
      "summary": "After five years at the state weather service and two stints working in sales at other companies, he applied for a job at Danske Commodities, an energy trading firm.\nThe world of finance is always changing, and Wall Street traders’ educational backgrounds are changing with it.\nBut one unexpected discipline is in high demand as firms adopt increasingly sophisticated trading strategies in the commodities and energy world: Meteorology.\nLong pigeonholed into weather jobs at TV stations or government forecasting agencies, trained meteorologists are increasingly finding opportunities in finance.\nToday, Bentzen is part of a team of meteorology experts that works alongside Danske’s trading floor, providing insight on how weather trends will affect energy markets.",
      "url": "https://fortune.com/2024/06/02/meterology-finance-climate-science-forecasting-citadel-commodities-energy/",
      "imgURL": "https://fortune.com/img-assets/wp-content/uploads/2024/05/GettyImages-1354866003-e1717184064689.jpg?resize=1200,600"
    },
    {
      "news_number": 6,
      "title": "Financial and legal resources for grandparents raising grandchildren",
      "summary": "Dear Savvy Senior,Are there any programs that you can refer me to that financially help grandparents who are raising their grandkids?\n— Tapped Out Tonya,Dear Tonya,Money is a common problem for the nearly 2.4 million U.S. grandparents who are raising their grandchildren today.\nTo help with the day-to-day expenses, there are a wide variety of programs and tax benefits that can make a big difference in stretching your budget.\nIf you’ve legally adopted your grandkids, there’s an Adoption Tax Credit that provides a federal tax credit of up to $16,810 in 2024.\nAnd there’s even education-related tax credits that can help your grandkids go to college, like the American Opportunity Tax Credit and the Lifetime Learning Tax Credit.",
      "url": "https://www.eastidahonews.com/2024/06/financial-and-legal-resources-for-grandparents-raising-grandchildren/",
      "imgURL": "https://s3.us-west-2.amazonaws.com/assets.eastidahonews.com/wp-content/uploads/2024/06/Grandparents-and-grandkids.jpg"
    },
    {
      "news_number": 7,
      "title": "Financial planner warns why it is a mistake to put all your retirement savings in your 401(K)",
      "summary": "But Americans should not put all their savings in their workplace plan, financial planner Georgia Lord has warned.\nThe bulk of retirement accounts contain either tax-advantaged, tax-free or taxable funds.\nAmericans should not put all their savings in their workplace plan, financial planner Georgia Lord has warnedIn the same way that experts recommend diversifying any investment portfolio you might have, Lord, a financial planner at Corbett Road Wealth Management, recommends diversifying the retirement accounts you hold.\nRoth IRA and Roth 401(K) accounts are classified as 'tax-free' as they are made up of after-tax contributions to help reduce your tax liability in retirement.\n'Taxable' funds include brokerage accounts which allow you to buy or sell a variety of investments, and are often after-tax contributions.",
      "url": "https://www.dailymail.co.uk/yourmoney/401k/article-13468477/retirement-savings-401K-warning.html",
      "imgURL": "https://i.dailymail.co.uk/1s/2024/05/28/19/85436301-0-image-m-31_1716921243903.jpg"
    },
    {
      "news_number": 8,
      "title": "Invest Atlanta to finance creation of 444 affordable housing units",
      "summary": "Mayor Andre Dickens announced the Invest Atlanta Board of Directors approved resolutions at its May meetings to finance the creation or preservation of 444 affordable housing units in the city of Atlanta.\n“The Invest Atlanta Board continues to prioritize affordable housing investments so more Atlanta residents have access to safe, quality housing in the communities they choose to call home,” Dickens said in a press release.\nAll of the Metropolitan Place housing units will be available at 70 percent AMI or less with 36 units offered at or below 30 percent AMI.\nThe Center will include 25 affordable housing units, including 13 units at or below 30 percent AMI.\n“Last year, Invest Atlanta provided $175 million for housing initiatives to ensure that residents have access to affordable housing to increase long-term stability and build wealth.",
      "url": "https://roughdraftatlanta.com/2024/06/02/invest-atlanta-to-finance-creation-of-444-affordable-housing-units/",
      "imgURL": "https://roughdraftatlanta.com/wp-content/uploads/2024/06/Screen-Shot-2024-06-01-at-7.42.57-PM.png"
    },
    {
      "news_number": 9,
      "title": "Ogle County Finance Task Force examining jail costs",
      "summary": "The Ogle County Correctional Center is located at 601 W. Washington St. (state Route 64) in downtown Oregon.\nIt is connected to the Ogle County Judicial Center, which sits on the east side of the facility.\n(Earleen Hinton)OREGON — Early discussions by an Ogle County Board task force dedicated to ensuring the future financial stability of the county have centered around increasing landfill revenue and decreasing Ogle County Jail expenses, possibly by closing the jail.\nIt has 157 beds, and an average daily census of about 40 inmates, Ogle County Sheriff Brian VanVickle said.\nHistorically, Ogle County pays for its bonds using revenue from tipping fees generated from Orchard Hills Landfill, Billeter said.",
      "url": "https://www.shawlocal.com/sauk-valley/2024/06/02/ogle-county-finance-task-force-examining-jail-costs/",
      "imgURL": "https://www.shawlocal.com/resizer/jmvuY6YTqME1HPG7NX8H56ZKcHE=/1200x630/filters:format(jpg):quality(70):focal(2330x1195:2340x1205)/cloudfront-us-east-1.images.arcpublishing.com/shawmedia/TA67P4DEF5D2HDYI636TIZH7H4.jpg"
    },
    {
      "news_number": 10,
      "title": "Weston Nellius, former secretary of finance",
      "summary": "Deacon “Pete” Weston Nellius, 88, passed away Sunday, May 26, 2024.\nHe was born in Philadelphia and a product of Ridley High School, he enlisted in the U.S. Air Force, where he met and married Ann Nellius (nee Williams).\nHe later was recruited by the newly elected Governor du Pont to become secretary of finance for the State of Delaware.\nPete is survived by his three children, Peter Nellius (Lisa), Dan Nellius (Jenny) and Becky Gravatt (Kevin); and his niece, Kelly Nellius.\nHe is also survived by eight grandchildren, Julie Dolbey (Chris), Jeffrey and Joseph Gravatt, Michael, Matthew and Caroline Nellius, and Peter (Alyson) and Natalie Nellius.",
      "url": "https://www.capegazette.com/article/weston-nellius-former-secretary-finance/276218",
      "imgURL": "https://www.capegazette.com/sites/capegazette/files/2024/06/field/image/Nellius.jpg"
    },
    {
      "news_number": 11,
      "title": "Wall Street Journal Ranks UVA Among Leaders in Finance, Consulting, Tech Jobs",
      "summary": "The Wall Street Journal found the University of Virginia is exceptional when it comes to positioning undergraduates for high-paying jobs in finance, consulting and technology.\nIn its springtime ranking, the business publication ranked UVA No.\n3 for finance, No.\n5 for consulting and No.\n“The effect can be huge.”",
      "url": "https://news.virginia.edu/content/wall-street-journal-ranks-uva-among-leaders-finance-consulting-tech-jobs",
      "imgURL": "https://news.virginia.edu/sites/default/files/Header_NA_UVATopJobsv2_JD.jpg"
    },
    {
      "news_number": 12,
      "title": "A Blue-Collar Life Bled My Dad Dry. Now It Fuels My Financial Activism",
      "summary": "My dad worked hard and gave me a life he could never have imagined, but it came at a grave cost.\nBut both adults and young people deserve access to free financial education, and this knowledge has never been more democratized thanks to the power of the internet.\nThe means for communicating this information have changed, but the \"meat and potatoes\" of the financial information itself have changed as well.\nA few of my favorite finance creators include Lexa VanDamme, Kara Perez, Women's Personal Finance, Berna Anat, Ellyce Fulmore, Melissa Jean-Baptiste, Nika Booth and Dasha Kennedy.\nFor any form of media you can think of, there is personal finance education right at your fingertips, and it's all free or cheap.",
      "url": "https://www.cnet.com/personal-finance/a-blue-collar-life-bled-my-dad-dry-now-it-fuels-my-financial-activism/",
      "imgURL": "https://www.cnet.com/a/img/resize/85f7198eab3248423c371d38565c6b5f04565725/hub/2024/05/30/8409ecf6-dc77-4af4-a75f-3d015013dce2/cnet-voices-veefrugalfox.jpg?auto=webp&fit=crop&height=675&width=1200"
    },
    {
      "news_number": 13,
      "title": "I’m a Financial Advisor: 5 Best Ways Retirees Can Pay Off Debt During Summer",
      "summary": "Asked how they plan to build wealth this summer, a majority of seniors in a recent GOBankingRates survey cited paying off debt.\nCassandra Rupp, a CFP and a senior wealth advisor with Vanguard, agreed that retirees’ focus on paying off debt makes sense.\n“If you have debt, the priority is paying off that debt and feeling in control of your financial situation,” she Rupp.\nWith so many 29% credit card interest rates out there, transferring balances to a card offering 0% APR for up to 18 months can save you thousands of dollars in interest payments.\n“The avalanche method, which begins with the highest interest rate; or the snowball method, which starts with the lowest balance.",
      "url": "https://www.nasdaq.com/articles/im-financial-advisor-5-best-ways-retirees-can-pay-debt-during-summer",
      "imgURL": "https://www.nasdaq.com/sites/acquia.prod/files/gobankingrates/woman-and-man-kayaking-in-river-in-retirement-iStock-542013932.jpg"
    },
    {
      "news_number": 14,
      "title": "Oregon lawmakers spend $5.4 million to prep for oncoming campaign finance rules",
      "summary": "Oregon lawmakers are spending more than $5.4 million to help elections officials revamp their system for reporting campaign finances and clear a massive backlog of languishing election complaints, in preparation for new rules set to shake up state politics.\nTHANKS TO OUR SPONSOR: Become a SponsorOregon lawmakers approved new campaign finance rules earlier this year to curb the impact of money in swaying voters.\nNow, lawmakers plan to spend $5.4 million to upgrade the system used to track political spending and hire more staff to help investigate complaints.\nBut it came together too late for elections officials to get a clear picture of what it would cost to put into place.\nThere are more than 750 outstanding complaints before elections officials, some of them years old, and more coming in all the time.",
      "url": "https://www.opb.org/article/2024/05/31/oregon-lawmakers-spending-prepare-oncoming-finance-rules/",
      "imgURL": "https://opb-opb-prod.cdn.arcpublishing.com/resizer/v2/MIJ2F66IFVC4DHUUMLX3BVKZMY.jpg?auth=f751e8bd451b5de23b2f0360d2de2f6b71e55b85fe3efa1225a94a3fa3f1271b&width=1200&height=675&smart=true"
    },
    {
      "news_number": 15,
      "title": "WHO’s investment case launch draws expressions of support, pledges to sustainably finance four-year strategy",
      "summary": "The investment case underpins WHO’s Investment Round, which kicked off on Sunday and has gained many robust expressions of support, commitments from countries to co-host, and a number of initial pledges that build momentum toward the Investment Round’s culmination later this year.\nStatements of support and funding commitments came from Member States, and the European Union during Tuesday’s launch event at a strategic roundtable of the Seventy-seventh World Health Assembly.\n“I also thank the G7 finance ministers, who recently called for increased funding for WHO through the Investment Round.\nMember States’ membership dues cover only a portion of the costs of WHO’s approved activities; the Investment Round is fundraising toward a gap of US$ 7.1 billion.\nDuring the event, Singapore’s Minister for Health Ong Ye Kung announced the country’s contribution of SGD 24 million (US$ 18 million) to the Investment Round.",
      "url": "https://www.who.int/news/item/28-05-2024-who-s-investment-case-launch-draws-expressions-of-support--pledges-to-sustainably-finance-four-year-strategy",
      "imgURL": "https://cdn.who.int/media/images/default-source/world-health-assembly/wha77/wha77-investment-case-2025-2028-launch.tmb-1200v.jpg?sfvrsn=367afdda_6"
    },
    {
      "news_number": 16,
      "title": "KKR Real Estate Finance Trust Inc. (NYSE:KREF) is favoured by institutional owners who hold 58% of the company",
      "summary": "Let's take a closer look to see what the different types of shareholders can tell us about KKR Real Estate Finance Trust.\nSee our latest analysis for KKR Real Estate Finance TrustWhat Does The Institutional Ownership Tell Us About KKR Real Estate Finance Trust?\nWe can see that KKR Real Estate Finance Trust does have institutional investors; and they hold a good portion of the company's stock.\nPrivate Equity OwnershipPrivate equity firms hold a 14% stake in KKR Real Estate Finance Trust.\nFor instance, we've identified 2 warning signs for KKR Real Estate Finance Trust (1 is significant) that you should be aware of.",
      "url": "https://finance.yahoo.com/news/kkr-real-estate-finance-trust-124649364.html",
      "imgURL": "https://media.zenfs.com/en/simply_wall_st__316/a4c94a8040d73184f17dcbe251894407"
    },
    {
      "news_number": 17,
      "title": "New jobs report report kicks off new month of trading: What to know this week",
      "summary": "In the week ahead, updates on the labor market will be front and center to start a fresh month of trading.\nThe April reading of the Personal Consumption Expenditures (PCE) index showed prices increased 0.2% from the month prior, the lowest monthly increase of 2024.\nInvestors were pricing in less than two rate cuts this year, per Bloomberg data, little changed from the week prior.\nLabor market lookaheadA slew of data on the labor market will test investor sentiment on the Fed's path in the week ahead.\nStory continuesBut Wells Fargo expects the labor market to continue cooling from here on out\"Job growth came back down to Earth to start Q2.",
      "url": "https://finance.yahoo.com/news/new-jobs-report-report-kicks-off-new-month-of-trading-what-to-know-this-week-120009885.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/OYUZFl7ULqQRqZGBC4mchQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/7b679780-1f86-11ef-97ff-7360aa96cc36"
    },
    {
      "news_number": 18,
      "title": "Why Intel Corporation (NASDAQ:INTC) Could Be Worth Watching",
      "summary": "Today we're going to take a look at the well-established Intel Corporation (NASDAQ:INTC).\nSome share price movements can give investors a better opportunity to enter into the stock, and potentially buy at a lower price.\nA question to answer is whether Intel's current trading price of US$30.85 reflective of the actual value of the large-cap?\nThis is based on its high beta, which is a good indicator for share price volatility.\nINTC’s optimistic future growth appears to have been factored into the current share price, with shares trading around industry price multiples.",
      "url": "https://finance.yahoo.com/news/why-intel-corporation-nasdaq-intc-110143421.html",
      "imgURL": "https://media.zenfs.com/en/simply_wall_st__316/fc61d4f3814d424f33183aeae1127c38"
    },
    {
      "news_number": 19,
      "title": "2 Top Artificial Intelligence Stocks to Buy Right Now",
      "summary": "Before you buy stock in Nvidia, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them.\nSee the 10 stocks »*Stock Advisor returns as of May 28, 2024John Ballard has positions in Nvidia.\nThe Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft.\nThe Motley Fool has a disclosure policy.\n2 Top Artificial Intelligence Stocks to Buy Right Now was originally published by The Motley Fool",
      "url": "https://finance.yahoo.com/news/2-top-artificial-intelligence-stocks-103000053.html",
      "imgURL": "https://media.zenfs.com/en/motleyfool.com/fd9298cb1c4db95224c99a50c8990f46"
    },
    {
      "news_number": 20,
      "title": "2 Leading Tech Stocks to Buy in 2024 and Beyond",
      "summary": "Tech stocks have been on the move this year, fueling the Nasdaq Composite's growth of 13% since January.\nSo, here are two leading tech stocks to buy in 2024 and beyond.\nAdvanced Micro DevicesAs a leading chipmaker, Advanced Micro Devices (NASDAQ: AMD) has a powerful position in tech.\nBefore you buy stock in Advanced Micro Devices, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Advanced Micro Devices wasn’t one of them.\n2 Leading Tech Stocks to Buy in 2024 and Beyond was originally published by The Motley Fool",
      "url": "https://finance.yahoo.com/news/2-leading-tech-stocks-buy-111000013.html",
      "imgURL": "https://media.zenfs.com/en/motleyfool.com/8f1e3010de7c11a6f6cde9d750dca6e0"
    },
    {
      "news_number": 21,
      "title": "3 Dividend-Paying Tech Stocks to Buy in June",
      "summary": "Dividend-paying tech stocks aren't always easy to find.\nIf you're an income investor and you like tech stocks, there are some good options out there.\nKeep reading to see three dividend-paying tech stocks to buy today.\nOracleThe last dividend-paying tech stock worth buying today is Oracle (NYSE: ORCL).\n3 Dividend-Paying Tech Stocks to Buy in June was originally published by The Motley Fool",
      "url": "https://finance.yahoo.com/news/3-dividend-paying-tech-stocks-120000928.html",
      "imgURL": "https://media.zenfs.com/en/motleyfool.com/851004e1f4f76d251a4cdeb31df912e2"
    },
    {
      "news_number": 22,
      "title": "Criminals are stealing food money from poor Americans by exploiting obsolete debit cards",
      "summary": "Her vulnerability, as it turns out, was a plastic, government-provided debit card that relies on outdated technology.\nIt's part of a growing trend of identity theft targeting the 42 million lower-income Americans who rely on EBT cards to receive their government food and cash assistance.\nInstead, EBT cards depend on the old-school magnetic stripe for security.\n(Yahoo Finance)'Beyond overwhelmed'The lack of protections makes EBT cards a particularly easy target.\nLast summer, Taisha Simon was a victim of EBT theft, where fraudsters drain government food aid from obsolete debit cards.",
      "url": "https://finance.yahoo.com/news/criminals-are-stealing-food-money-from-poor-americans-by-exploiting-obsolete-debit-cards-143100546.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/th8amFei5N51wUfXpr3iGw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/eca99440-1f61-11ef-bb56-a7e10c3d3a7f"
    },
    {
      "news_number": 23,
      "title": "With 86% ownership, Ameriprise Financial, Inc. (NYSE:AMP) boasts of strong institutional backing",
      "summary": "In the chart below, we zoom in on the different ownership groups of Ameriprise Financial.\nView our latest analysis for Ameriprise FinancialWhat Does The Institutional Ownership Tell Us About Ameriprise Financial?\nHowever, it is best to be wary of relying on the supposed validation that comes with institutional investors.\nHedge funds don't have many shares in Ameriprise Financial.\nGeneral Public OwnershipWith a 14% ownership, the general public, mostly comprising of individual investors, have some degree of sway over Ameriprise Financial.",
      "url": "https://finance.yahoo.com/news/86-ownership-ameriprise-financial-inc-120134388.html",
      "imgURL": "https://media.zenfs.com/en/simply_wall_st__316/f88d3d8c5618aa88ce2627c2a1cda340"
    },
    {
      "news_number": 24,
      "title": "Wealth Column: What's it like to work with a financial adviser?",
      "summary": "Today’s article will offer some clarity around what it's like to work with a Wealth Enhancement Group adviser — an insider’s tour of a typical advisory practice.\nToday, the financial advisors at Wealth Enhancement Group develop a unified, holistic, comprehensive plan for each client’s individual situation.\nHow we work with clientsForming a relationship with a Wealth Enhancement Group adviser begins before clients become clients.\nThe initial meeting is usually structured around uncovering what it will take to get a client’s financial house in order.\nGUIDE: Your Wealth Enhancement Group adviser provides hands-on help, every step of the way, and when you’re ready, we’ll put your plan into action.",
      "url": "https://www.brainerddispatch.com/opinion/columns/wealth-column-whats-it-like-to-work-with-a-financial-adviser",
      "imgURL": "https://cdn.forumcomm.com/dims4/default/fe5d857/2147483647/strip/true/crop/5616x3744+0+0/resize/1599x1066!/quality/90/?url=https%3A%2F%2Ffcc-cue-exports-brightspot.s3.us-west-2.amazonaws.com%2Fbrainerddispatch%2Fbinary%2Fcopy%2F44%2F81%2F0cd4e8d297fa9932a5b757376da1%2F3350694-0b3axyh3ek8hfvhnbdffryuptnuu-binary-2914950.jpg"
    },
    {
      "news_number": 25,
      "title": "Rich nations meet $100bn climate finance goal – two years late",
      "summary": "According to the new data from the Organisation for Economic Co-operation and Development (OECD), developed countries provided and mobilised $115.9 billion in climate finance for developing countries in 2022, up from $89.6 billion in 2021.\nClimate finance analysts criticised the quality of climate finance and the way the OECD calculates the figures.\nThe OECD report showed that in 2022, as in previous years, public climate finance mainly took the form of loans, which accounted for 69% or $63.6 billion.\nClimate finance experts have also raised concerns over donor countries repurposing existing aid flows to meet the $100-billion target.\nThe way in which climate finance contributions by donor countries are counted and tracked will be part of negotiations this year on a new finance goal set to be agreed at the COP29 climate summit in Azerbaijan in November.",
      "url": "https://www.climatechangenews.com/2024/05/29/rich-nations-meet-100bn-climate-finance-goal-two-years-late/",
      "imgURL": "https://cdn.climatechangenews.com/files/2024/05/29145618/2023-12-12T000000Z_2035761397_MT1NURPHO000APUWN9_RTRMADP_3_DUBAI-CLIMATECONFERENCE-COP28-FINAL.jpg"
    },
    {
      "news_number": 26,
      "title": "Hong Kong finance chief Paul Chan calls for more ‘open interactions’ and tech collaboration between China, US bay areas",
      "summary": "Hong Kong’s finance chief has called for more “open interactions and collaborative innovation” between the bay areas of China and the United States, pointing to interest from local and American companies in exploring each other’s markets for potential clients.\n“[Entrepreneurs] all recognised the abundant opportunities in each other’s bay areas.\nHe added that the potential for such collaboration was not coincidental but “stemmed from the respective characteristics and advantages” of both bay areas, which “attract each other”.\nFinance chief Paul Chan and California Governor Gavin Newsom meet at the recent Bay to Bay Dialogue in Berkeley, California.\n“In fact, the concern and interests of the business sector here are about the stability of Hong Kong, the overall business environment, the impact of high interest rates on Hong Kong, also the performance of the stock market and the property market,” he had said.",
      "url": "https://www.scmp.com/news/hong-kong/hong-kong-economy/article/3265064/hong-kongs-paul-chan-calls-more-open-interactions-and-tech-collaboration-between-chinese-us-bay",
      "imgURL": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2024/06/02/df8cbbc9-247f-4be9-8dad-a9120299cd40_5c0a126c.jpg?itok=KiaK-LRR&v=1717311517"
    },
    {
      "news_number": 27,
      "title": "Nature: The New Risk Shaping Sustainable Finance Policies",
      "summary": "Published 05-31-24 Submitted by BloombergOriginally published on about.bnef.comFinancial institutions are inadequately prepared to assess and manage nature-related risk, with just 1% discussing the potential threats and opportunities in company filings.\nAs policymakers incorporate broader environmental considerations into legislation, banks and investors will be compelled to better understand how to manage nature-related risks in their portfolios and processes.\nWith global biodiversity declining faster than at any point in human history, both physical and transition nature-related risks have become more material to financial institutions’ investing strategies.\nAn April 2024 survey by the Global Association of Risk Professionals (GARP) found that the majority of financial institutions lack sophistication in their approach to managing nature-related risk, far behind the equivalent strategic engagement with climate.\nThe same report notes that only 17% of banks and asset managers are using metrics, targets or limits to assess drivers of nature-related risks, while 75% of the same entities are yet to identify nature-related risks or opportunities.",
      "url": "https://www.csrwire.com/press_releases/803206-nature-new-risk-shaping-sustainable-finance-policies",
      "imgURL": "https://back.3blmedia.com/sites/default/files/inline-images/1-nature-new-risk-shaping-sustainable-finance-policies_BLOOMBERG_052124.jpeg"
    },
    {
      "news_number": 28,
      "title": "Turkey Close to Exiting Global Watchdog’s Illicit Finance List",
      "summary": "Turkey is poised to be removed from a financial watchdog’s “gray list” as early as next month, a potential boost to one of the Middle East’s biggest economies following its efforts to curb illicit money flows.\nAn on-site visit by the Paris-based Financial Action Task Force earlier this month noted significant progress, according to people familiar with the matter, who requested anonymity as the deliberations are private.\nThat means Turkey could come off the list of jurisdictions under increased monitoring on the final day of the FATF plenary in Singapore on June 28, the people said.\nNo final decisions have been made.",
      "url": "https://www.bloomberg.com/news/articles/2024-05-30/turkey-close-to-exiting-fatf-s-illicit-finance-gray-list",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i7PYryBztlwI/v2/1200x800.jpg"
    },
    {
      "news_number": 29,
      "title": "What Do Students at Elite Colleges Really Want?",
      "summary": "The meme was an image of a head with “I need to get rich” slapped across it.\n“Freshmen after spending 0.02 seconds on campus,” read the caption, posted in 2023 to the anonymous messaging app Sidechat.\nThe campus in question was Harvard, where, at a wood-paneled dining hall last year, two juniors explained how to assess a fellow undergraduate’s earning potential.\nIt’s easy, they said, as we ate mussels, beets and sautéed chard: You can tell by who’s getting a bulge bracket internship.",
      "url": "https://www.nytimes.com/2024/05/22/business/gen-z-college-students-jobs.html",
      "imgURL": "https://static01.nyt.com/images/2024/05/26/business/19GenZ-sellouts-illo/19GenZ-sellouts-illo-facebookJumbo.jpg"
    },
    {
      "news_number": 30,
      "title": "10,000 Boomers Are Retiring Daily — How This Changes Banking and Your Finances",
      "summary": "The “silver tsunami,” or the mass retirement of Boomers, may cause serious changes to our workplaces and incomes.\nLonger Lifespans and Lower Birth RatesThe baby Boomers made up a large portion of the workforce until very recently.\nWithout proper Congressional changes to social security, mass retirement could have potentially negative effects on the economy.\n“The need for additional income is a significant factor in the decision to work past the traditional retirement age when people have inadequate retirement savings,” said Forbes Magazine in an article.\nMore From GOBankingRatesThis article originally appeared on GOBankingRates.com: 10,000 Boomers Are Retiring Daily — How This Changes Banking and Your FinancesThe views and opinions expressed herein are the views and opinions of the author and do not necessarily reflect those of Nasdaq, Inc.",
      "url": "https://www.nasdaq.com/articles/10000-boomers-are-retiring-daily-how-changes-banking-and-your-finances",
      "imgURL": "https://www.nasdaq.com/sites/acquia.prod/files/gobankingrates/16-retired-svetikd-iStock-511983430.jpg"
    },
    {
      "news_number": 31,
      "title": "From oars to orders: A coxswain's journey to Wall Street",
      "summary": "Uh I was a cox and on a crew team back in high school national champion 1988.\nUh Yeah, yeah, I mean, but I the two other coxes on the team, one won gold in Athens in 2004 and another one went into advertising and you'll see his commercials for Budweiser during the Super Bowl.\nYou're, you have a national championship from high school under my belt.\nI may be the loudest guy in the room and that's where the cox and the crew helped.\nBut there isn't a day I go into that building where I know I'm not lucky to still be going into that building.",
      "url": "https://finance.yahoo.com/video/oars-orders-coxswains-journey-wall-133055466.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/Onhf_upvFIhBYavwXGF8jA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/308353a0-1f5c-11ef-bc9f-224cc620d15e"
    },
    {
      "news_number": 32,
      "title": "I Basically Threw Away $150,000. How Am I Supposed to Forgive Myself?",
      "summary": "—Can’t Forgive or ForgetDear Can’t Forgive or Forget,Recently, I ran a financial wellness training program for 120 faculty and students at a college in the Southwest.\n), you’re providing a valuable service that saves your sister money and, more importantly, stress.\nMy husband and I have amassed an embarrassing amount of credit card debt due to a collision of home repairs and out-of-control childcare costs in our coastal city.\nPotential for more debt: Consolidating your credit card debt frees up your credit lines, which in turn should raise your credit score.\n4. Credit score impact: Taking out a new loan and closing credit card accounts can temporarily ding your credit score.",
      "url": "https://slate.com/advice/2024/05/bad-investment-business-failure-friend-personal-finance-advice.html",
      "imgURL": "https://compote.slate.com/images/f5db5750-d3eb-4cd9-8571-c564640e32d7.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1560"
    },
    {
      "news_number": 33,
      "title": "Wall Street rallies to close out a bloom-filled May",
      "summary": "NEW YORK (AP) — An already verdant May for Wall Street finished with another push higher as stocks rallied Friday after a report showed inflation is at least not worsening.\nThe S&P 500 rose 0.8% to close its sixth winning month in the last seven.\nThat left open the question of when Wall Street will get the lower interest rates that it craves.\nOn the losing end of Wall Street were several tech stocks.\nThe chip company was one of the heaviest weights on the S&P 500 Friday.",
      "url": "https://spectrumlocalnews.com/nys/central-ny/business/2024/05/31/wall-street-drifts-after-inflation-report-offers-no-big-surprises",
      "imgURL": "https://s7d2.scene7.com/is/image/TWCNews/recycled_wall_street"
    },
    {
      "news_number": 34,
      "title": "Milwaukee public schools face serious fallout from financial mess-up • Wisconsin Examiner",
      "summary": "Officials at the Wisconsin Department of Public Instruction did not mince words in its letter warning Milwaukee Public Schools Superintendent Keith Posley that millions of dollars in school funds are in jeopardy because of his district’s failure to provide statutorily required financial data.\nMore unusual still, it comes from an agency that works closely with a pro-public-education Democratic governor and makes a point of championing public schools.\nVoters in the district narrowly passed a $252 million public school funding referendum in April which district administrators said was needed to avoid drastic cuts.\nStill, “the referendum was the right thing,” says the Wisconsin Public Education Network’s Milwaukee organizer Jenni Hofschulte.\n“The public school system has a lot of resilience and strength and where something is an outlier, we transparently do something about it,” he said.",
      "url": "https://wisconsinexaminer.com/2024/05/31/milwaukee-public-schools-face-serious-fallout-from-financial-mess-up/",
      "imgURL": "https://wisconsinexaminer.com/wp-content/uploads/2020/06/GettyImages-468314862-scaled.jpg"
    },
    {
      "news_number": 35,
      "title": "Alzheimer’s Takes a Financial Toll Long Before Diagnosis, Study Finds",
      "summary": "Long before people develop dementia, they often begin falling behind on mortgage payments, credit card bills and other financial obligations, new research shows.\nWhat they found was striking: Credit scores among people who later develop dementia begin falling sharply long before their disease is formally identified.\nThe issues start even earlier: The study finds evidence of people falling behind on their debts five years before diagnosis.\n“The results are striking in both their clarity and their consistency,” said Carole Roan Gresenz, a Georgetown University economist who was one of the study’s authors.\nCredit scores and delinquencies, she said, “consistently worsen over time as diagnosis approaches, and so it literally mirrors the changes in cognitive decline that we’re observing.”",
      "url": "https://www.nytimes.com/2024/05/31/business/economy/alzheimers-disease-personal-finance.html",
      "imgURL": "https://static01.nyt.com/images/2024/05/31/business/31alzheimers-finance-promo/31alzheimers-finance-promo-facebookJumbo.jpg"
    },
    {
      "news_number": 36,
      "title": "Top-down Climate Finance Needs",
      "summary": "CPI collects and standardizes data on climate finance needs from a wide variety of scenarios developed by various institutions to provide a comprehensive and unique understanding of the scale of the climate finance gaps in different sectors.\nGlobal tracked climate finance and estimated annual needs through 2050Top-down needs are estimations of the climate finance required by different sectors to keep global temperature rises within 1.5°C.\nClimate finance flows and needs in contextHow much climate finance will keep us under 1.5°C?\nGlobal climate finance flows in key mitigation sectors, finance needs, and mitigation potentialHow much do we need to adapt to climate change and build resilient economies?\nCumulative climate finance needs vs. losses under 1.5°C and BAU scenariosFor more details on cost of inaction estimates, visit https://www.climatepolicyinitiative.org/the-cost-of-inaction/",
      "url": "https://www.climatepolicyinitiative.org/publication/top-down-climate-finance-needs/",
      "imgURL": "https://www.climatepolicyinitiative.org/wp-content/uploads/2024/05/Depositphotos_497382404_XL-scaled.jpg"
    },
    {
      "news_number": 37,
      "title": "Lawmakers OK bill to require ‘faithful’ electors in 2024, loosen campaign finance rules",
      "summary": "Legally, these electors are the ones who actually cast a deciding vote in the presidential election, usually in mid-December.\nThe bill would require the state’s electors to take a new pledge prior to appearing on the ballot.\nVoter rollsThe legislation also codifies that the public has access to the state’s voter registration list.\nThe database, which is required by federal law and routinely shared with local governments and political committees, is tightly protected by the Illinois State Board of Elections.\n(Capitol News Illinois photo by Andrew Adams) Maurice West Rep. Maurice West, D-Rockford, debates a broad election bill.",
      "url": "https://capitolnewsillinois.com/news/lawmakers-ok-bill-to-require-faithful-electors-in-2024-loosen-campaign-finance-rules",
      "imgURL": "https://capitolnewsillinois.com/Portals/1/EasyDNNnews/3063/240525-WEST-SIT-AA-OPT.jpg"
    },
    {
      "news_number": 38,
      "title": "Like Trump, NC politicians have history of campaign finance violations",
      "summary": "But history shows Trump is not entirely unique; prosecutors have long gone after politicians over campaign finance violations, and on both sides of the aisle.\nIn addition to multiple members of Congress from around the country who have been convicted for campaign finance violations, North Carolina specifically has a bipartisan history of politicians being accused of — and sometimes convicted for — violating campaign finance laws.\nMike Easley was, like Trump, convicted of hiding politically motivated spending that should’ve been reported.\nIn 2017 Hartsell was convicted of state and federal campaign finance violations, for misusing more than $200,000 his supporters had donated to his campaign over the years.\nAs the campaign finance trial progressed in recent days, Trump’s campaign has regularly blasted emails to supporters making accusations of political targeting, in an attempt to raise more money for his ongoing 2024 presidential campaign against Biden.",
      "url": "https://www.wral.com/story/like-trump-nc-politicians-have-history-of-campaign-finance-violations/21457946/",
      "imgURL": "https://images.wral.com/asset/news/local/politics/2008/10/02/3662165/3662166-1255921976-555x416.jpg"
    },
    {
      "news_number": 39,
      "title": "Climate Finance Needs",
      "summary": "CPI is compiling and standardizing data on climate finance needs from a wide variety of sources to provide the most comprehensive overview of the size of the climate finance gap to date.​ While climate finance increased to reach an all-time high of almost USD 1.3 trillion per year in 2021/2022, this amount still falls dramatically short of the total required.\nAccurately assessing the size of this global climate finance gap can enable decision-makers to mobilize finance effectively, quickly, and to where it is most needed.\nNavigating the dataCPI is supporting a collective understanding of the climate finance needed to align to a 1.5°C pathway.\nTo clarify the global climate finance needs landscape, CPI has developed a novel approach to capturing all of these needs estimates in a clear and digestible manner.\nCoupled with our wider tracking and analysis of climate finance flows, this can help identify the largest climate finance gaps, track progress against climate targets, and better inform decision-makers and financial institutions on how to increase the speed, scale, and quality of climate finance.",
      "url": "https://www.climatepolicyinitiative.org/climate-finance-needs/",
      "imgURL": "https://www.climatepolicyinitiative.org/wp-content/uploads/2024/05/Depositphotos_111165300_XL-scaled.jpg"
    },
    {
      "news_number": 40,
      "title": "I Used to Think Social Security Wouldn't Be There for Me in Retirement. Now I Know the Truth",
      "summary": "These days, my Social Security knowledge is far more vast, and I'll bet I could surprise you with some of its lesser-known rules.\nSocial Security isn't going awayWhen I first started covering Social Security (and I'm talking about the very first week I wrote on the topic), I kept seeing warnings about the program going away completely.\nAnd based on what I know today, I can say with certainty that Social Security is not at risk of disappearing completely.\nIn the coming years, Social Security is expected to get less revenue as older workers retire in droves.\nI Used to Think Social Security Wouldn't Be There for Me in Retirement.",
      "url": "https://finance.yahoo.com/news/used-think-social-security-wouldnt-084800119.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/gOtIVrq45yTmB8e8CQFe0A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/motleyfool.com/746c8a12c6c09776075e8fd895a55301"
    },
    {
      "news_number": 41,
      "title": "Finance and HR Software Stocks Q1 In Review: Intuit (NASDAQ:INTU) Vs Peers",
      "summary": "Finance and HR Software Stocks Q1 In Review: Intuit (NASDAQ:INTU) Vs PeersQuarterly earnings results are a good time to check in on a company’s progress, especially compared to its peers in the same sector.\nToday we are looking at Intuit (NASDAQ:INTU) and the best and worst performers in the finance and hr software industry.\nFinance and HR software benefit from the SaaS-ification of businesses, large and small, who much prefer the flexibility of cloud-based, web-browser delivered software paid for on a subscription basis than the hassle and expense of purchasing and managing on-premise enterprise software.\nThe 15 finance and HR software stocks we track reported a slower Q1; on average, revenues beat analyst consensus estimates by 1.3%.\nIntuit reported revenues of $6.74 billion, up 11.9% year on year, topping analysts' expectations by 1.4%.",
      "url": "https://finance.yahoo.com/news/finance-hr-software-stocks-q1-090525134.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/WG8blaK17.T21QpRDVimdQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02MDA-/https://media.zenfs.com/en/stockstory_922/73ec092216390b3a1fc8a25fa0d6beb3"
    },
    {
      "news_number": 42,
      "title": "Campaign finance reports show where federal candidates stand ahead of Montana primary • Daily Montanan",
      "summary": "Tester brought in another $4.1 million over the six-week period, bringing his total fundraising for the cycle to $34 million.\nHe spent about $4.9 million from April 1 to May 15 and ended the period with about $11.8 million in cash on hand.\nHe’s now raised about $10 million during the cycle, including more than $2 million he has loaned his campaign.\nSheehy reported spending $1.8 million over the six-week period, which he ended with about $2.2 million in cash.\nBillings’ Ming Cabrera reported raising about $4,000 during the period, spent about $6,700 and ended the period with around $18,000 in cash.",
      "url": "https://dailymontanan.com/2024/05/28/campaign-finance-reports-show-where-federal-candidates-stand-ahead-of-montana-primary/",
      "imgURL": "https://dailymontanan.com/wp-content/uploads/2024/04/CloudyCapitol-2048x1536-1.jpg"
    },
    {
      "news_number": 43,
      "title": "Local representatives picket finance ministry over grant reduction",
      "summary": "",
      "url": "https://kathmandupost.com/national/2024/06/02/local-representatives-picket-finance-ministry-over-grant-reduction",
      "imgURL": "https://assets-cdn.kathmandupost.com/uploads/source/news/2024/news/localunits-1717326849.jpg"
    },
    {
      "news_number": 44,
      "title": "Google’s generative AI fails 'will slowly erode our trust in Google'",
      "summary": "AI Overview is supposed to provide generative AI-based responses to search queries.\nGoogle responded by taking down the responses and saying it’s using the errors to improve its systems.\n“And if that product is watered down, it will slowly erode our trust in Google.”Google’s AI flubsGoogle’s AI Overview problems aren’t the first time the company has run into trouble since it began its generative AI drive.\nThe AI Overview issues, meanwhile, cropped up because Google said users were asking uncommon questions.\nThe point is, Google has built a reputation of trustworthiness, and its AI flubs are slowly eating into that.",
      "url": "https://finance.yahoo.com/news/googles-generative-ai-fails-will-slowly-erode-our-trust-in-google-202314852.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/p7OdGvdUhspjQNsLXqOnXg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDI-/https://s.yimg.com/os/creatr-uploaded-images/2024-05/4558bfb0-1df2-11ef-a7dd-4b24c174058d"
    }
  ],
  "politics": [
    {
      "news_number": 0,
      "title": "Iran’s ex-president Ahmadinejad, disqualified Larijani sign up for election",
      "summary": "Mahmoud Ahmadinejad and others see an opportunity, but it remains unclear who will be qualified to run by the Guardian Council.\nTehran, Iran – Iran’s ex-President Mahmoud Ahmadinejad and other divisive figures – such as moderate Ali Larijani and ultraconservative Saeed Jalili – have signed up to contest new elections after the death of President Ebrahim Raisi in a helicopter crash last month.\nAhmadinejad, who was president from 2005 to 2013, registered along with dozens of others at the interior ministry on Sunday, a day before the sign-up period ends.\n“Don’t ask political questions,” he said with a grin when asked by reporters about his reaction if he were to be disqualified from running by the Guardian Council – the constitutional body that vets all candidates.\nThe Guardian Council is scheduled to begin vetting the candidates from Tuesday for six days, after which the list of approved candidates will be announced on June 11.",
      "url": "https://www.aljazeera.com/news/2024/6/2/irans-ex-president-ahmadinejad-disqualified-larijani-sign-up-for-election",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/AP24154297850030-1717330752.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 1,
      "title": "Jun 1st 2024 Edition",
      "summary": "At least 45 people were killed in Rafah after an Israeli air strike hit a tent camp.\nIsrael said it was targeting two Hamas commanders and that the other deaths were caused by secondary explosions.\nAmerica said Israel’s actions did not cross the administration’s red lines and would not trigger a change in policy.\nMeanwhile, Hamas launched a rocket attack on central Israel, including Tel Aviv, for the first time in months.\nThe International Court of Justice ordered Israel to limit its military offensive in Rafah and cease any operations that may cause widespread civilian deaths and suffering.",
      "url": "https://www.economist.com/the-world-this-week/2024/05/30/politics",
      "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240601_WWP001.jpg"
    },
    {
      "news_number": 2,
      "title": "Pols & Politics: Chasing Rachael Rollins' credit card bills is a never-ending saga",
      "summary": "So, does she have a credit card today?\nRollins does not have a state-funded credit card,” Jordan Smock, Executive Director & Records Access Officer at Roxbury CC, wrote.\nIf you have a legitimate question, they make you wait 10 days for a Public Records request to proceed through channels.\nBut there’s more to this story …DOJ credit card statusThe Department of Justice, also via a records request, said they have no records of Rollins using a federally funded credit card.\nAs we pointed out in a two-part report on her credit card bills, Rollins dropped $33,132 while Suffolk DA on food, hotel, travel bills — all paid for by taxpayers.",
      "url": "https://www.bostonherald.com/2024/06/02/pols-politics-chasing-rachael-rollins-credit-card-bills-is-a-never-ending-saga/",
      "imgURL": "https://www.bostonherald.com/wp-content/uploads/2023/04/0413-NWS-BHR-L-rollinsnl008.jpg?w=1024&h=687"
    },
    {
      "news_number": 3,
      "title": "Is Britain All That Special?",
      "summary": "The book cover for What Everyone Knows About Britain* (*Except the British) by Michael Peel.\nThis is, in essence, the thinking behind journalist Michael Peel’s new book, What Everyone Knows About Britain* (*Except the British).\nWhat Everyone Knows About Britain is, more than anything, a book written about Britain by a British citizen.\nAs Peel writes, in post-Brexit Britain, trade with the EU is down, and trade deals with other countries haven’t filled that gap.\nThat is probably what everyone knows about Britain (*except the British, Peel included).",
      "url": "https://foreignpolicy.com/2024/06/01/brexit-uk-modern-british-politics-history-eu-trade-economy-immigration/",
      "imgURL": "https://foreignpolicy.com/wp-content/uploads/2024/05/Britain-boris-johnson-GettyImages-1242321373-1.jpg?w=1000"
    },
    {
      "news_number": 4,
      "title": "David Shapiro: Machine politics at work on Waianae Senate seat?",
      "summary": "She endorsed state Rep. Cedric Gates, who is battling former state Rep. Stacelynn Eli in the Aug. 10 Democratic primary, to succeed her.\nCritics see it as a power play by Shimabukuro and party leaders to get Gates appointed to finish her term by Gov.\nDistrict Democrats meet 7 p.m. Wednesday at the Nanakuli Public Library to select three candidates to finish Shimabukuro’s term.\nIn November, Green chose state Rep.\nHashimoto is running unopposed for reelection after receiving the fundraising embrace of Senate leaders such as Ways and Means Chair Donovan Dela Cruz.",
      "url": "https://www.staradvertiser.com/2024/06/02/hawaii-news/volcanic-ash/david-shapiro-machine-politics-at-work-on-waianae-senate-seat/",
      "imgURL": "https://www.staradvertiser.com/wp-content/uploads/2024/06/web1_CTY-IKAIKA-ANDERSON0216-1.jpg"
    },
    {
      "news_number": 5,
      "title": "The Detroit News",
      "summary": "Your subscription supports:Accurate, fact-based journalism without an agenda, so you get the information you need to make informed decisions.\nAccurate, fact-based journalism without an agenda, so you get the information you need to make informed decisions.\nColumns that cover the things that matter to our community, from reporters Daniel Howes, Nolan Finley, Maureen Feighan and Bankole Thompson.\nColumns that cover the things that matter to our community, from reporters Daniel Howes, Nolan Finley, Maureen Feighan and Bankole Thompson.",
      "url": "https://www.detroitnews.com/story/news/politics/2024/06/01/qa-mayor-mike-duggan-on-his-political-future-and-detroits-big-issues/73911518007/",
      "imgURL": "https://www.gannett-cdn.com/sites/detroitnews/images/favicon.png"
    },
    {
      "news_number": 6,
      "title": "Trump says he’s ‘okay’ with serving potential jail time or house arrest after historic conviction",
      "summary": "CNN —Former President Donald Trump said he is “OK” with serving potential jail time or being under house arrest following his historic conviction on 34 felony counts of falsifying business records.\n“I’m OK with it,” Trump told Fox News in an interview that aired Sunday when asked about the potential punishments.\nMerchan could sentence Trump to probation or up to 4 years in state prison on each count, with a maximum of 20 years.\n“I’m fighting for the Constitution,” Trump said, adding that the trial had been “tougher” on his family than himself.\nSpeaking specifically of his wife, former first lady Melania Trump, the former president said, “She’s fine, but I think it’s very hard for her.",
      "url": "https://www.cnn.com/2024/06/02/politics/donald-trump-possible-jail-time-house-arrest/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2155089583.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 7,
      "title": "Conviction politics: Joe Biden sees opportunity in Trump’s guilty verdict",
      "summary": "was now ₹1,950 per 3 monthsToday's FT newspaper for easy reading on any device.\nThis does not include ft.com or FT App access.",
      "url": "https://www.ft.com/content/38a0bf6a-e2a7-4471-9608-2a4293891950",
      "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/ftlogo-v1%3Abrand-ft-logo-square-coloured?source=update-logos&format=svg"
    },
    {
      "news_number": 8,
      "title": "My Political Depression Problem—and Ours",
      "summary": "I’ve spent half my life now, starting in 1997 when I was 27, trying to make sense of the right.\nWith each passing year, the right became more and more the star of the American political show.\nIn the book I’m working on now, I’ve developed a theory to explain why that is, and how it works.\nIt was a 19th-century version of imploring people once to hold their noses and support another oft-pathetic political party, our own benighted Democrats.\nOne thing I’ve been thinking about a lot instead: calling the guys (the debaters seem to be all male, for what it’s worth) who’ve been slamming me.",
      "url": "https://prospect.org/politics/2024-05-29-my-political-depression-problem/",
      "imgURL": "https://prospect.org/downloads/21256/download/Infernal%20Triangle%20052924.jpg?cb=e2d2ee985c2bfd687691f86409a156ae&w=1200"
    },
    {
      "news_number": 9,
      "title": "Politics Report: Bill Walton, a Civic Obituary",
      "summary": "I wanted Voice to be part of his collection of beloved San Diego institutions.\nBill Walton at his home with former Voice director of development Iris Magid, board member Bill Osborne and Scott Lewis in August, 2019.\nFormer San Diego City Councilmember Marti Emerald recalled how he brought that enthusiasm to the push for a new Central Library downtown.\nIn a notorious press event at University of San Diego, Walton said Gloria should resign as mayor.\nShea was at Walton’s side when the relentless San Diego booster became Gloria’s toughest foe.",
      "url": "https://voiceofsandiego.org/2024/06/01/politics-report-bill-walton-a-civic-obituary/",
      "imgURL": "https://voiceofsandiego.org/wp-content/uploads/2023/10/untitled-08717.jpg"
    },
    {
      "news_number": 10,
      "title": "Biden’s cease-fire plan tightens political squeeze for Netanyahu in Israel",
      "summary": "The key sticking point — the same one that has doomed past negotiations — is how and when the war will officially end.\nBiden’s public airing of the cease-fire proposal has forced those tensions to the surface, meaning Netanyahu may no longer be able to stall for time.\nAdvertisementOpposition leader Yair Lapid said the government would not necessarily collapse without Ben Gvir and Smotrich, and that he would be willing to provide a “safety net” to see it through the implementation of a cease-fire deal.\nAddressing Netanyahu, he added: “Biden is saying that this train has already left the station.\nThe Israel Defense Forces said Sunday it was continuing operations in the area, killing militants and locating weapons.",
      "url": "https://www.washingtonpost.com/world/2024/06/02/israel-hamas-war-news-gaza-palestine-ceasefire-biden/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/T7XBUEX3JU7F6YYCRWZHHYQS5Q_size-normalized.jpg&w=1440"
    },
    {
      "news_number": 11,
      "title": "Republican Greg Lopez withdraws from GOP group's special election debate in Colorado's 4th CD",
      "summary": "The Republicans running in the June primary in Colorado's 4th Congressional District threw more elbows than punches in a televised debate on Thursday night in Denver, with most of the jabs aimed at U.S. Rep. Lauren Boebert, though her rivals also took hits.",
      "url": "https://www.coloradopolitics.com/elections/2024/republican-greg-lopez-withdraws-from-gop-groups-special-election-debate-in-colorados-4th-cd/article_b61a9b48-1f7c-11ef-b7a0-1fe3edf5e25f.html",
      "imgURL": "https://bloximages.newyork1.vip.townnews.com/coloradopolitics.com/content/tncms/assets/v3/editorial/e/37/e3709b08-08e1-11ef-a6e7-671ffc6d643e/66342cb6cdf80.image.jpg?crop=1755%2C921%2C0%2C129&resize=1200%2C630&order=crop%2Cresize"
    },
    {
      "news_number": 12,
      "title": "False right-wing reports about Trump trial jury instructions fuel threats against judge",
      "summary": "WASHINGTON — False reports about the jury instructions in former President Donald Trump's hush money trial have been spreading across right-wing media, leading to threats against the judge overseeing the case.\nThose \"unlawful means\" aren't charges themselves, and they wouldn't result in separate convictions, so jurors don't have to unanimously agree on them.\nOn X, a right-wing influencer asked followers who among them wanted to see Merchan locked up for treason.\nTime and time again, legal proceedings in the four cases against Trump have resulted in violent threats and, in at least one case, actual violence.\nIn August, Trump supporters posted the names and addresses of the grand jurors in Fulton County, Georgia, who indicted Trump and 18 co-defendants.",
      "url": "https://www.nbcnews.com/politics/donald-trump/false-right-wing-reports-trump-trial-jury-instructions-fuel-threats-ju-rcna154678",
      "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-05/240529-donald-trump-vl-332p-ebbc03.jpg"
    },
    {
      "news_number": 13,
      "title": "'Karma' or 'political prosecution?' Voters weigh in on Hunter Biden criminal trials",
      "summary": "Following a derailed plea deal, Hunter Biden, 54, also faces nine tax charges that carry a combined maximum penalty of 17 years in prison in Los Angeles.\nPolitical motivations \"not a coincidence\"Half of Americans say they believe Hunter Biden received favorable treatment from prosecutors because he is the president's son, according to a Reuters/Ipsos poll last summer.\nBrown said he believes the trials surrounding both Trump and Hunter Biden are politically motivated and a \"mockery\" of the justice system.\n\"Same thing applies to Hunter Biden.\nHunter Biden is a scumbag.",
      "url": "https://www.usatoday.com/story/news/politics/elections/2024/06/01/hunter-biden-trial-divides-voters/73775206007/",
      "imgURL": "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/04/01/USAT/73167800007-3-jm-0572.JPG?crop=5611,3156,x3,y310&width=3200&height=1800&format=pjpg&auto=webp"
    },
    {
      "news_number": 14,
      "title": "Video: CNN anchor and Kevin McCarthy spar over Trump’s character",
      "summary": "How relevant is this ad to you?\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues",
      "url": "https://www.cnn.com/2024/06/02/politics/video/kevin-mccarthy-donald-trump-character-relationship-raju-ip-digvid",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/still-20675318-3957986-121-still.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 15,
      "title": "Is Biden’s Gaza peace plan significant? Will Hamas and Israel agree?",
      "summary": "Peace proposals, framed by the US president as Israeli, have divided as much as they have unified.\nUS President Joe Biden has announced what he claimed was an Israeli peace plan to bring around a ceasefire in Gaza.\nGantz had previously threatened to leave the cabinet by June 8 if no plan for Gaza beyond the war had been agreed.\nMuch of the opposition to the peace plan has come from within the Israeli cabinet.\nAs for Lapid, his 17 seats are offered as support only in what pertains to the peace proposals.",
      "url": "https://www.aljazeera.com/news/2024/6/2/how-significant-is-bidens-gaza-peace-plan-will-hamas-and-israel-agree",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/AFP__20240528__34U33GQ__v4__HighRes__TopshotPalestinianIsraelConflict-1716903866.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 16,
      "title": "Here’s what to expect as the Supreme Court enters the final stretch",
      "summary": "CNN —The Supreme Court is turning toward the final, frenzied weeks of its term, readying potential blockbuster decisions on abortion, guns and former President Donald Trump’s claims of absolute immunity.\nTrump claims ‘absolute’ immunityTrump’s appeal for immunity from special counsel Jack Smith’s election subversion charges landed at the Supreme Court late in the term and instantly overshadowed most of the docket.\nThe Supreme Court then put that ruling on hold last year, maintaining the status quo while it decided the case.\nGovernment regulation of FacebookThe Supreme Court is confronting a series of cases at the intersection of the First Amendment and social media.\nThe Republican governors who signed the laws said they were needed to keep the social media platforms from discriminating against conservatives.",
      "url": "https://www.cnn.com/2024/06/02/politics/supreme-court-what-to-watch-trump-immunity-abortion-guns/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/2024-04-25t220226z-1882377806-rc2rd7ak8ja4-rtrmadp-3-usa-trump-immunity.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 17,
      "title": "Trump fans turn US flags upside down to protest former president’s conviction",
      "summary": "CNN —Hanging the United States flag upside down, a move that is supposed to signal distress and that has ensnared Supreme Court Justice Samuel Alito in controversy, is now being practiced by supporters of Donald Trump to protest the former president’s conviction in his hush money trial.\nProminent Trump supporters such as Rep. Marjorie Taylor Greene of Georgia and former national security adviser Michael Flynn posted pictures of upside-down flags on social media soon after a New York jury found Trump guilty Thursday.\nBy Friday, pro-Trump social media accounts were awash with images of inverted flags hanging on porches and lawns across the country.\nThe Heritage Foundation, a conservative think tank, posted an image appearing to show the flag hanging upside down above its Washington, DC, headquarters.\n“The city was very surprised to learn someone inverted the flags, which were set up in honor of our community’s veterans.",
      "url": "https://www.cnn.com/2024/06/01/politics/upside-down-flags-trump-conviction/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/2024-06-01t193534z-1721943918-rc2j28azc86k-rtrmadp-3-usa-trump-california-copy.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 18,
      "title": "Video: ‘Disappointed to see a person of faith lie’: Kinzinger reacts to Speaker’s comment on Trump verdict",
      "summary": "How relevant is this ad to you?\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues",
      "url": "https://www.cnn.com/2024/06/01/politics/video/trump-verdict-kinzinger-mike-johnson-sot-digvid",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/20240601-splits-exlarge16x9.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 19,
      "title": "Donald Trump joins TikTok after seeking to ban video app as president",
      "summary": "CNN —Former President Donald Trump has joined TikTok, the fast-growing social media platform with ties to China that Trump has publicly embraced even though he railed against it as president.\n“The president is now on TikTok,” White said at the start of the video.\nBut Trump now says he opposes a nationwide TikTok ban, adding that such a policy would only alienate young Americans and benefit Meta.\nThe Biden campaign, for its part, also has a presence on TikTok and has continued to post on the platform even as the Biden administration has supported a nationwide TikTok ban.\nTikTok has filed a legal challenge to the law Biden signed in April that would ban the app unless it finds a new owner.",
      "url": "https://www.cnn.com/2024/06/02/politics/donald-trump-joins-tiktok/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2155662640.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 20,
      "title": "Irish Sea border returns to Northern Ireland politics",
      "summary": "The Irish Sea border returns to NI politics1 day ago John Campbell , BBC News NI economics and business Editor SharePA Gavin Robinson has said his party will \"continue to fight to fully restore Northern Ireland’s place within the United Kingdom\"The Democratic Unionist Party (DUP) leader has brought the Irish Sea border into the centre of Northern Ireland’s election campaign.\nThe DUP cannot by itself change the operation of the sea border or the application of EU law in Northern Ireland.\n\"I can’t see there being any push to change the Windsor Framework,\" he says, referring to the current Northern Ireland deal.\nSuch a deal could at a stroke sweep away the most obvious physical impacts of the Irish Sea border and end some of the most onerous paperwork.\nNorthern Ireland will elect 18 MPs.",
      "url": "https://www.bbc.com/news/articles/c511541plxlo",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/0ac0/live/279d61d0-20c0-11ef-80aa-699d54c46324.jpg"
    },
    {
      "news_number": 21,
      "title": "Sir John Curtice on undecided voters and UK election poll swings",
      "summary": "In 32 days time we'll all have the chance to cast a ballot to choose who runs the country - but has all the frantic campaigning done much to change your minds so far?\nHere's our favourite number cruncher, Sir John Curtice, with his take on the latest polls - in 60 seconds.",
      "url": "https://www.bbc.com/news/videos/cqllzg4wz5lo",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/4e20/live/c2862780-20c6-11ef-a13a-0b8c563da930.png"
    },
    {
      "news_number": 22,
      "title": "Video: Bill Maher makes prediction about 2024 election",
      "summary": "How relevant is this ad to you?\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues",
      "url": "https://www.cnn.com/2024/05/30/politics/video/bill-maher-trump-2024-election-chris-wallace-wtcw-cprog-digvid",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/20240530-maher-trump.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 23,
      "title": "Republicans join Trump’s attacks on justice system after guilty verdict in New York",
      "summary": "WASHINGTON (AP) — Embracing Donald Trump’s strategy of blaming the U.S. justice system after his historic guilty verdict, Republicans in Congress are fervently enlisting themselves in his campaign of vengeance and political retribution as the GOP runs to reclaim the White House.\nFew others dared to defend the legitimacy of the New York state court that heard the hush money case or the 12 jurors who unanimously rendered their verdict.\nHe faces three other felony indictments, including the federal case over his effort to overturn the 2020 election.\nAlmost to a person, the Republicans in Congress who spoke out provided a singular voice for Trump.\n“Those who turned our judicial system into a political cudgel must be held accountable,” Lee said.",
      "url": "https://www.pbs.org/newshour/politics/republicans-join-trumps-attacks-on-justice-system-after-guilty-verdict-in-new-york",
      "imgURL": "https://d3i6fh83elv35t.cloudfront.net/static/2024/06/2024-05-14T144939Z_890224795_RC2EQ7A08DAT_RTRMADP_3_USA-TRUMP-NEW-YORK-1024x683.jpg"
    },
    {
      "news_number": 24,
      "title": "Lauren Boebert lags challenger Ike McCorkle by double digits, Democrat's internal poll shows",
      "summary": "With less than two weeks to go until Colorado voters can start casting primary ballots, Republican U.S. Rep. Lauren Boebert this week launched a five-figure TV ad campaign touting her support for former President Donald Trump's border policies and efforts to increase domestic energy production.",
      "url": "https://www.coloradopolitics.com/elections/2024/internal-poll-shows-mccorkle-leads-boebert/article_4fd34bbc-1d03-11ef-aa9d-bb703058a29b.html",
      "imgURL": "https://bloximages.newyork1.vip.townnews.com/coloradopolitics.com/content/tncms/assets/v3/editorial/2/53/25390e72-1d04-11ef-8270-53bc966fe4a9/6655f3a0c42f2.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize"
    },
    {
      "news_number": 25,
      "title": "‘It’s all we have’: young climate activists on the state of politics around the world",
      "summary": "The Guardian asked young climate activists around the world what they want from the elections and whether politics is working in the fight to halt global heating.\n“Climate change has to be solved through systemic change – we have to change everything.\nEnvironmentalists expect more of the same from Sheinbaum – ironically a former Intergovernmental Panel on Climate Change (IPCC) scientist.\nWho else is going to do it?”But, she says, “whatever happens at the election, climate is not an issue that’s going to be solved overnight.\n“L-I-F-E, which expands to lifestyle for environment,” is a plan to centre individual Indians’ personal responsibility for climate, says Ravi.",
      "url": "https://www.theguardian.com/environment/article/2024/jun/02/its-all-we-have-young-climate-activists-on-the-state-of-politics-around-the-world",
      "imgURL": "https://i.guim.co.uk/img/media/50135ca259c58fa2df5c959c84e1b22f34925c25/0_185_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d156b56579bb824027d253b8d09e4a90"
    },
    {
      "news_number": 26,
      "title": "Half of Americans think Trump's guilty verdict was correct, should end campaign: POLL",
      "summary": "At the same time, the slight majority at 51%, think Trump intentionally did something illegal in this case.\nTwelve percent think Trump did something wrong but not intentionally, and 19% believe he did not do anything wrong.\nBiden's favorability rating also remains low and unchanged, according to the new ABC News/Ipsos poll.\nHis favorability rating currently stands at 32% compared to 33% in an ABC News/Ipsos poll conducted in March 2024.\nPresident Joe Biden and former President Donald Trump Getty ImagesA majority of Independents think Trump's verdict was correct, 52%, and the same amount believe that he should end his candidacy.",
      "url": "https://abcnews.go.com/Politics/plurality-americans-trumps-guilty-verdict-correct-hush-money/story?id=110744698",
      "imgURL": "https://i.abcnewsfe.com/a/e949dd90-4707-4f93-8f1a-8292aed5bdde/donald-trump-gty-jef-240531_1717163758188_hpMain_16x9.jpg?w=1600"
    },
    {
      "news_number": 27,
      "title": "As Hunter Biden’s Trial Nears, President Biden Pulls Him Close",
      "summary": "President Biden wakes up every day to a list of concerns he must address as commander in chief.\nBut at the top of that list, people who know him say, is a concern that nags at him as a father: the legal problems of his son, Hunter Biden.\nHunter Biden, 54, is scheduled to stand trial this week in a federal court in Delaware on charges that he failed to disclose his drug addiction on a form when buying a gun in 2018.\nHis legal team has called the charges politically motivated, and his attorneys intend to challenge the notion that Hunter Biden improperly filled out the form.\nBut Mr. Biden has refused to shut out his son or treat him as a political liability — in fact, the president has a tendency to pull his son closer the worse things seem to get.",
      "url": "https://www.nytimes.com/2024/06/02/us/politics/hunter-biden-trial.html",
      "imgURL": "https://static01.nyt.com/images/2024/06/02/multimedia/02dc-biden-hunter-lctw/02dc-biden-hunter-lctw-facebookJumbo-v2.jpg"
    },
    {
      "news_number": 28,
      "title": "What political cartoonists thought of Trump’s guilty verdict",
      "summary": "Yet knowing that a historic verdict was imminent, Mouly and New Yorker editor David Remnick began sifting through sketched ideas, most of them premised on a guilty verdict.\n“I should have had ‘guilty,’ ‘not guilty‘ [and] ‘hung jury’ roughs all ready to go because the story is so huge and consequential, but I didn't,” Breen said.\nSo he drew the Trump verdict as a reason to fly the American flag inverted as a symbol of protest or distress.\nIt’s tough for us cartoonists to out-parody our current reality.”Time magazine, like the New Yorker, prepared cover art while awaiting the verdict.\n“After the verdict of guilty on 34 counts came through, this image made perfect sense,” Rodriguez said.",
      "url": "https://www.washingtonpost.com/entertainment/2024/06/01/political-cartoons-trump-guilty-verdict/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DX6GH4WFFRBWBGL74CUARMEK3Q.jpg&w=1440"
    },
    {
      "news_number": 29,
      "title": "Letter to the Editor: Politics has no place in law enforcement agencies",
      "summary": "We don’t need a partisan puppet for our county sheriff.\nWe need a sheriff who puts political beliefs aside and who will work for all the citizens of Jasper County.\nOnly one candidate seems to have the full support of many current and former law enforcement officials, not just in Jasper County, but across the entire state.\nPolitics has no place whatsoever in our law enforcement agencies, nor should it be a consideration in choosing a candidate.\nAnd if everyone who knows him and/or who has worked with him in law enforcement believes Brad is the best man for the job, then that’s good enough for me.",
      "url": "https://www.newtondailynews.com/opinion/letters-to-the-editor/2024/05/30/letter-to-the-editor-politics-has-no-place-in-law-enforcement-agencies/",
      "imgURL": "https://www.newtondailynews.com/resizer/a-bIBeGY3MKRYpH78mFpm7Bgh3g=/1200x630/filters:format(jpg):quality(70)/cloudfront-us-east-1.images.arcpublishing.com/shawmedia/D7MIZDJZ6VGKRJMAWXJQDMZHF4.jpg"
    },
    {
      "news_number": 30,
      "title": "Adrian Ramsay: GDP focus not way to fairer society, says Greens co-leader",
      "summary": "Focus on GDP not way to fairer society, say Greens2 hours ago Paul Seddon , Political reporter ShareBBCThe co-leader of the Green Party has told the BBC that finding different ways to measure economic success would help build a fairer society.\nThe party has long argued that economic growth drives over-exploitation of resources and should not be the default aim for governments.\nAdrian Ramsay said relying on gross domestic product (GDP) to judge the state of the economy was a \"blunt instrument\".\nIt marks a contrast with other political parties, which usually put their plans to boost economic growth front and centre in election campaigns.\n'Consumerism'The UK's main GDP measure is produced by the Office of National Statistics (ONS) and tries to measure the overall size of the economy.",
      "url": "https://www.bbc.com/news/articles/c511lz64rrpo",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/ee5b/live/c79af880-20e0-11ef-a3ab-e73c00cc3104.jpg"
    },
    {
      "news_number": 31,
      "title": "Podcast: Politics Of President Joe Biden's Support For Israel : The NPR Politics Podcast : NPR",
      "summary": "SHIVARAM: Today on the podcast, the state of the Biden administration's support for Israel as Israel escalates their military campaign on Rafah in the Gaza Strip.\nNow, after the Hamas attack back on October 7, Israel invades Gaza.\nBut Israel argued that this was the last Hamas stronghold, and they needed to defeat Hamas there.\nBut what we're seeing in Gaza - Israel has what it needs to continue this operation.\nWe're getting reports from our NPR colleagues on the ground that Israel is carrying out more strikes in Rafah today.",
      "url": "https://www.npr.org/transcripts/1197963575",
      "imgURL": "https://media.npr.org/assets/img/2024/05/28/landscape-1600x900px-34-_wide-648a0afcc547cabdcd0b9928e1f50a54dce4f3d2.png?s=1400&c=100&f=png"
    },
    {
      "news_number": 32,
      "title": "What's next after Trump's verdict: From the Politics Desk",
      "summary": "Welcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the campaign trail, the White House and Capitol Hill.\nAnd Donald Trump’s conviction could potentially change the contours of what’s been a stable presidential contest, though it’s equally possible the overall environment doesn’t change much.\nTrump’s sentencing on July 11, four days before the start of the GOP convention.\nMore Trump verdict coverage from NBC News🙋 In the states: NBC News talked to more than 30 battleground-state voters about their reactions to Trump’s verdict, ranging from wondering if it’ll hurt him to believing there will be backlash in his favor.\nRead more →That’s all from The Politics Desk for now.",
      "url": "https://www.nbcnews.com/politics/trumps-verdict-politics-desk-rcna154978",
      "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-05/240531-donald-trump-presser-trump-tower-ac-441p-8613f1.jpg"
    },
    {
      "news_number": 33,
      "title": "A political scandal raises questions about Modi and India's democracy : Up First : NPR",
      "summary": "The Sunday Story: An Indian Political ScandalEnlarge this image toggle caption Screenshot by NPR/Mojo Story/Rafiq Maqbool/AP Screenshot by NPR/Mojo Story/Rafiq Maqbool/APStarting in 2018, sixteen people were arrested in India for allegedly plotting to assassinate Prime Minister Narendra Modi.\nThey included professors, a poet, trade unionists and members of an improv acting troupe.\nThe evidence against them, discovered on their electronic devices, appears damning: minutes of terror cell meetings, emails to banned Maoist rebels and a letter suggesting a suicide attack on Modi.\nThey all say they were falsely accused and that the evidence against them was fabricated and planted by hackers in order to silence them.\nDigital forensic investigators not only agree but say Modi's own government may be involved.",
      "url": "https://www.npr.org/2024/06/02/1198912881/india-modi-political-scandal-activists-jailed",
      "imgURL": "https://media.npr.org/assets/img/2024/05/30/stan-swamy-duo_wide-a769e0cb4c5e3deb23dbae22feb4f0e62cd655fb.jpg?s=1400&c=100&f=jpeg"
    },
    {
      "news_number": 34,
      "title": "Trump’s Conviction Is a Grim Sign for US Politics",
      "summary": "By all appearances, the Republican Party will stick with Donald Trump after his conviction Thursday on 34 felony counts of falsifying business records in a New York City courthouse.\nThe former president will be sentenced on July 11, four days before the party’s convention.\nConceivably, the Republican presidential candidate in 2024 will be nominated from Rikers Island.\nTrump pronounced himself, as you knew he would, “a very innocent man.” He may indeed have room to appeal these charges, which weren’t entirely straightforward.\nAnd one might hope that Trump, always sui generis, is in no sense a precedent.",
      "url": "https://www.bloomberg.com/opinion/articles/2024-05-31/donald-trump-s-guilty-verdict-is-a-grim-sign-for-us-politics",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iL68mw7JMRY8/v1/1200x800.jpg"
    },
    {
      "news_number": 35,
      "title": "The Governor, the Wolf and the Warden: A Fresh Look at a Gianforte Hunt",
      "summary": "“I said I wanted no part of it,” the warden, Justin Hawkaluk, recalled with a barely audible chuckle.\nMr. Hawkaluk now says his sense of dread was warranted.\nThe story of the governor, the wolf and the warden made few waves when it first broke.\nMr. Gianforte was recorded as the killer of the animal, an adult black wolf, and given a warning for not having taken a required trapping course.\nA spokeswoman for the governor said Mr. Gianforte had “immediately rectified the mistake” by taking the course.",
      "url": "https://www.nytimes.com/2024/06/02/us/politics/montana-wolf-killed.html",
      "imgURL": "https://static01.nyt.com/images/2024/06/02/multimedia/02pol-wolves-02-lkcg/02pol-wolves-02-lkcg-facebookJumbo.jpg"
    },
    {
      "news_number": 36,
      "title": "See how Fox News covered Trump’s guilty verdict",
      "summary": "How relevant is this ad to you?\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues",
      "url": "https://www.cnn.com/2024/05/31/politics/video/right-wing-media-fox-trump-hush-money-guilty-verdict-wallace-cnc-digvid",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/still-20671496-2891705-569-still.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 37,
      "title": "Biden campaign HQ staffers finalize union agreement, making it the first presidential reelection campaign to organize",
      "summary": "The unionization effort is affiliated with the Campaign Workers Guild, a non-partisan labor union founded in 2017 to represent workers on campaigns and political committees.\nField organizers on Biden’s previous campaign unionized in May 2020.\nThey worked with Teamsters Local 238 to secure a $15 minimum wage, overtime pay if working more than 40 hours in a week and a six-day work week.\nPresidential campaign work can be notoriously grueling, with long hours and low pay exchanged for the experience and the career benefit of working in American politics at the highest level.\nTrump’s campaign staff is not represented by a union.",
      "url": "https://www.cnn.com/2024/05/31/politics/biden-campaign-unionization/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/c-ap24080058933254.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 38,
      "title": "Politics chat: How voters are responding to Trump's felony conviction",
      "summary": "Politics chat: How voters are responding to Trump's felony conviction We look at what the Democrat and Republican parties each make of former president Donald Trump's felony convictions as well as where the voters stand.\nPolitics Politics chat: How voters are responding to Trump's felony conviction Politics chat: How voters are responding to Trump's felony conviction Listen · 4:36 4:36 We look at what the Democrat and Republican parties each make of former president Donald Trump's felony convictions as well as where the voters stand.\nSponsor Message Become an NPR sponsor",
      "url": "https://www.npr.org/2024/06/01/nx-s1-4988765/politics-chat-how-voters-are-responding-to-trumps-felony-conviction",
      "imgURL": "https://media.npr.org/include/images/facebook-default-wide-s1400-c100.jpg"
    },
    {
      "news_number": 39,
      "title": "Trump verdict becomes fundraising, campaign issue",
      "summary": "A Manhattan jury had rendered its verdict Thursday — Donald Trump, guilty on all counts.\nThis is a scam, this is a rigged trial,” Trump said at Trump Tower on Friday.\nWhat You Need To Know Former President Donald Trump was convicted of 34 counts of falsifying business recordsThe Trump campaign has raised more than $52 million following the verdictPresident Biden cautioned against calling trial 'rigged'It’s close and it may stay that way through November — felonies be damned.\nWhile Trump fumes in front of the cameras, his campaign tries to make the best of a bad situation — announcing on Friday a nearly $35 million fundraising haul after the verdict.\n“It’s reckless, it’s dangerous, and it’s irresponsible for anyone to say this was rigged just because they don’t like the verdict,” Biden said.",
      "url": "https://ny1.com/nyc/all-boroughs/politics/2024/05/31/donald-trump-verdict-presidential-election",
      "imgURL": "https://s7d2.scene7.com/is/image/TWCNews/SN_TimBoyum_Trump_Interview_050924"
    },
    {
      "news_number": 40,
      "title": "Our Strange Politics of Meaning Assignment",
      "summary": "A surprising amount of politics ends up being channeled through contested meanings of used phrases and symbols.\nBut in the absence of knowing it, I will call this the strange politics of meaning assignment.\nA particular symbol or phrase may have different meanings to different people.\nIn that setting, assignment of meaning can cause a lot of trouble.\nIt can effectively create a meaning that isn't what those who use that symbol or phrase mean.",
      "url": "https://reason.com/volokh/2024/05/27/our-strange-politics-of-meaning-assignment/",
      "imgURL": "https://d2eehagpk5cl65.cloudfront.net/img/q60/uploads/2021/11/the-volokh-conspiracy.jpg"
    },
    {
      "news_number": 41,
      "title": "Female Hardliner Politician Registers to Run for Iran’s President",
      "summary": "Former female lawmaker Zohreh Elahian has registered to run in Iran's June 28 snap presidential vote, potentially becoming the first woman ever allowed to stand if approved by the Guardian Council.\nIn her speech following registration, Elahian declared her motto: “Sound government, sound economy, sound society,” and pledged to combat corruption.\nZohreh Elahian enters interior ministry to registerElahian’s qualification to run hinges on the Guardian Council's interpretation of a controversial article of the Constitution.\nAzam Taleghani, a veteran reformist politician and journalist, registered to run in every presidential election from 1997 until her death in 2019.\nAnother of Ahmadinejad’s female nominees, hardliner Marzieh Vahid-Dastjerdi, a physician and former lawmaker, was approved by parliament as Minister of Health, making her the first and only female minister in the history of the Islamic Republic.",
      "url": "https://www.iranintl.com/en/202406016958",
      "imgURL": "https://i.iranintl.com/images/rdk9umy0/production/a3d4907c4a7bc0fa1ef99cb666b118ee65e85efd-600x450.jpg?rect=0,92,600,315&w=1200&h=630&fm=webp&q=70"
    },
    {
      "news_number": 42,
      "title": "How Donald Trump's criminal conviction is already rewriting American history",
      "summary": "A single word uttered 34 times in a Manhattan courtroom on Thursday afternoon changed American history.\nAnd Liebell said she’s “deeply suspicious” of anyone who says they know what impact the New York verdict will have on American politics based on those prior examples.\n“No American president has ever been convicted in a criminal proceeding,” Liebell said.\nThe experts responding to USA TODAY said they were split over how Trump’s felony conviction will affect his chances of victory.\nThey noted that Trump’s campaign is expected to use the verdict to drum up support and fundraising among his base.",
      "url": "https://www.usatoday.com/story/news/politics/2024/06/01/trump-verdict-conviction-american-history-impact/73785567007/",
      "imgURL": "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/05/31/USAT/73922040007-gty-2155356705.jpg?crop=5995,3374,x0,y624&width=3200&height=1801&format=pjpg&auto=webp"
    },
    {
      "news_number": 43,
      "title": "Video: Reporter describes how Trump reacted to guilty verdict",
      "summary": "How relevant is this ad to you?\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues",
      "url": "https://www.cnn.com/2024/05/30/politics/video/donald-trump-hush-money-verdict-reaction-in-court-digvid",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/still-20670480-1596220-819-still-1-20240530215602280.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 44,
      "title": "Trump’s lead attorney reacts to the verdict",
      "summary": "How relevant is this ad to you?\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues",
      "url": "https://www.cnn.com/2024/05/30/politics/video/todd-blanche-trump-defense-attorney-take-the-stand-tsc-digvid",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/todd.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 45,
      "title": "Honig: Although jury’s verdict unclear, sentencing could include jail",
      "summary": "How relevant is this ad to you?\nVideo player was slow to load content Video content never loaded Ad froze or did not finish loading Video content did not start after ad Audio on ad was too loud Other issues",
      "url": "https://www.cnn.com/videos/politics/2024/06/01/smr-honig-on-jury-instructions-and-sentencing.cnn",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/240601093602-smr-honig-on-verdict.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 46,
      "title": "Inside the US effort to build a pier into Gaza",
      "summary": "Even though it was operational for only about a week, the pier helped deliver some 1,000 metric tons of aid into Gaza before breaking apart.\nThat’s well short of the military’s goal of moving 500 tons of aid per day over the pier.\nThe risks however were deemed too great at the time, with unpredictable winter weather and heavy fighting in Gaza.\n“We assumed a lot of risk in using a military operation for this purpose,” a second senior administration official added.\nDeputy Pentagon spokesperson Sabrina Singh emphasized that the solution to aid to Gaza remains the land crossings.",
      "url": "https://www.cnn.com/2024/06/01/politics/gaza-pier-israel-hamas-war/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/c-gettyimages-2152836537.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 47,
      "title": "Marian Robinson, Michelle Obama’s mother, dies",
      "summary": "CNN —Marian Robinson, the mother of former first lady Michelle Obama, has died, according to a statement from the Obama and Robinson families.\nMichelle Obama posted on social media, “My mom Marian Robinson was my rock, always there for whatever I needed.\n“We knew Mrs. Marian Robinson as a devoted mother and grandmother with a fierce and unconditional love of her family.\nMarian Robinson was heavily involved in her kids’ education, according to the statement.\n“And for me, watching her see me in that way meant the world to me,” Michelle Obama said.",
      "url": "https://www.cnn.com/2024/05/31/politics/michelle-obama-mother-marian-robinson-dies/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/ap080728030471.jpg?c=16x9&q=w_800,c_fill"
    }
  ],
  "india": [
    {
      "news_number": 0,
      "title": "What does the death of a jailed Jesuit priest say about India's democracy under Modi?",
      "summary": "What does the death of a jailed Jesuit priest say about India's democracy under Modi?\nBut the suspects, their lawyers and independent experts who've reviewed the evidence in this case say the prisoners were framed.\nYears before this, though, the case that ensnared Swamy was an earlier bellwether for India's democratic decline under Modi, his critics say.\nIn Swamy's case, though, the hacker inserted profanity — in English — into the coding.\nSwamy's death \"will forever remain a stain on India's human rights record,\" Mary Lawlor, the U.N. special rapporteur on human rights defenders, said in a statement.",
      "url": "https://www.npr.org/2024/06/02/1250799690/india-democracy-modi-priest-jail-death",
      "imgURL": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+59/resize/1400/quality/100/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe3%2F7e%2F2137781c418ebcc521fe3d92571b%2Fgettyimages-1233828351-edit.jpg"
    },
    {
      "news_number": 1,
      "title": "Indian election 2024: Five key moments to understand the past six weeks",
      "summary": "India’s election, the biggest in the world, saw more than six weeks of gruelling campaigning - often in blistering heat.\nSo what were the big talking points?\nAnd just how huge was it?\nThe BBC's Christian Parkinson tells you what the key moments and issues of the election were.\nProduced by Nikita Mandhani and Danish Alam",
      "url": "https://www.bbc.com/news/videos/cqqq2g653gro",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/55d1/live/c7224730-1f4d-11ef-80aa-699d54c46324.jpg"
    },
    {
      "news_number": 2,
      "title": "Elections 2024 Opinion: Indians Remain Positive, Congress Wants To Drag India To Nihilism",
      "summary": "In fact, the vast majority of Indians themselves remain positive, hopeful, and full of energy towards realising their personal and collective national ambitions.\nGenerally speaking, the exit polls provide a good directional view of the possible outcome.\nThe June 1 exit polls unanimously pointed to an overwhelming win for the Bharatiya Janata Party (BJP) led alliance.\nInstead of respecting the implied mandate vocalised through the exit polls, the Congress and the INDIA bloc went on record to call these exit polls \"Modi media polls\".\nJust before the exit polls, a senior lawyer made a video depicting 'proper conduct' for the poll officials.",
      "url": "https://www.ndtv.com/opinion/elections-2024-indians-remain-positive-congress-wants-to-drag-india-to-nihilism-5801513",
      "imgURL": "https://c.ndtvimg.com/2019-08/llefbhag_sonia-gandhi-rahul-gandhi-cwc-pti-_625x300_10_August_19.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"
    },
    {
      "news_number": 3,
      "title": "In an India divided by prosperity and poverty, whose dreams come true?",
      "summary": "“Everybody here has a dream to do something in life,” Verma said.\nBut the grueling, never-ending demands of her daily life highlight how much less accessible those dreams can be for some.\n“I had to take care of the home and take on her work to support the family,” Kilare said.\nTo appease the loan sharks, “my husband kept taking loans to repay one loan,” Kilare said.\nAfter work, Verma participates in a variety of hobbies including boxing classes.",
      "url": "https://www.cnn.com/interactive/2024/06/india/india-election-inequality-economy-intl-hnk-dst-cnnphotos/",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/01-india-election-wealth-gap-cnn.jpg?c=16x9&q=w_1100,h_619"
    },
    {
      "news_number": 4,
      "title": "Wall Street Lands on India, Looking for Profits It Can’t Find in China",
      "summary": "Mumbai, India’s financial capital, has seen a lot of new faces over the past year.\nThe heads of global banks have been trooping through, visiting its stock exchanges, buying property and hiring new staff.\nA postpandemic boom has pushed the value of India’s stock market to about $5 trillion, putting it neck and neck with Hong Kong’s.\nWall Street can’t ignore India anymore.\nMumbai has been India’s commercial hub for eight decades, but it was relatively unfamiliar to global finance until the past two years.",
      "url": "https://www.nytimes.com/2024/05/31/business/india-foreign-investors.html",
      "imgURL": "https://static01.nyt.com/images/2024/06/04/multimedia/31mumbai-money-B1/00mumbai-money3-zmwj-facebookJumbo.jpg"
    },
    {
      "news_number": 5,
      "title": "Heatstroke kills 33 polling staff in a state on last day of India election",
      "summary": "While several people have died during the intense heatwave, dozens dying in one day marks an especially grim toll.\nAt least 33 Indian polling staff died on the last day of voting from heatstroke in just one state, says a top election official, after scorching temperatures gripped swaths of the country.\nNavdeep Rinwa, chief electoral officer for the northern state of Uttar Pradesh, where voting in the seventh and final stage of the election ended on Saturday, said 33 polling personnel died due to the heat.\nIn Odisha, at least nine people died due to heat on Saturday, taking the death toll in two days to 54.\nVotes will be counted on Tuesday and the final results are likely to be announced by the end of the day.",
      "url": "https://www.aljazeera.com/news/2024/6/2/heatstroke-kills-33-polling-staff-in-a-state-on-last-day-of-india-election",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/AP24145346208707-1717310336.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 6,
      "title": "India Stocks, Bonds Set to Gain as Polls Show Landslide Modi Win",
      "summary": "Indian stocks, bonds and the rupee are poised to climb on Monday after exit polls indicated a resounding victory for Prime Minister Narendra Modi ’s party in general elections that concluded Saturday.\nThe polls suggest the Bharatiya Janata Party-led alliance will clinch substantially more seats than the 272 required for a majority in the 543-seat lower house of parliament, with most pollsters predicting the group will win between 350 and 400 seats in total.\nIn 2019, the alliance won 352.\nThe votes will be counted on Tuesday.",
      "url": "https://www.bloomberg.com/news/articles/2024-06-02/india-stocks-bonds-set-to-gain-as-polls-show-landslide-modi-win",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iTBnYgs.xwwM/v1/1200x800.jpg"
    },
    {
      "news_number": 7,
      "title": "A bizarre comment stirred speculation India may try to match China's carrier fleet",
      "summary": "Anshuman Poyrekar/Getty Images\"We will not stop at that (three carriers),\" India's defense minister recently said.\nDuring an interview with an Indian newspaper regarding plans to construct a third aircraft carrier, Defense Minister Rajnath Singh said India would build yet more.\n\"He was only trying to dispel suggestions that the government is resistant to a proposal for a third aircraft carrier.\"\nThey would also be less expensive, with the third Indian carrier estimated at around $5 billion, compared to $13 billion for a Ford-class carrier.\nDespite its drawbacks, the aircraft carrier's aura and impact in peacetime operations are unmatched.\"",
      "url": "https://www.businessinsider.com/comment-stirs-speculation-india-may-match-chinas-carrier-fleet-2024-5",
      "imgURL": "https://staticbiassets.in/thumb/msid-110619273,width-700,resizemode-4,imgsize-149114/img6658d8f8cc442a2f676c6735.jpg"
    },
    {
      "news_number": 8,
      "title": "Who invented butter chicken? A court in India will decide.",
      "summary": "For Kumar, 24, butter chicken is his comfort dish and he came with high expectations.\nImmersed in a creamy sauce that tempered its spiciness, the resulting butter chicken was a massive success, even among foreigners.\nButter chicken is “comfort food” in India, Bagga said.\n“It’s definitely one of the best butter chicken I have ever had,” he said.\n“I would like to try the butter chicken in both the places,” Kumar said.",
      "url": "https://www.nbcnews.com/news/world/invented-butter-chicken-court-india-will-decide-rcna153870",
      "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-05/240531-butter-chicken-feud-vl-150p-0a8d9e.jpg"
    },
    {
      "news_number": 9,
      "title": "Modi projected to retain power as voting ends in the last round of India’s election",
      "summary": "READ MORE: Millions vote in India’s grueling election with Modi’s party likely to win 3rd termThe election is considered one of the most consequential in India’s history.\nIf Modi wins, he’ll be only the second Indian leader to retain power for a third term after Jawaharlal Nehru, the country’s first prime minister.\nExit polls by major television news channels projected Modi’s Hindu nationalist Bharatiya Janata Party and its allies were leading over the broad opposition alliance led by the Congress party.\nWhen the election kicked off in April, Modi and his BJP were widely expected to clinch another term.\nBut things are different this time, analysts say, giving Modi’s political challengers a potential opportunity.",
      "url": "https://www.pbs.org/newshour/world/modi-projected-to-retain-power-as-voting-ends-in-the-last-round-of-indias-election",
      "imgURL": "https://d3i6fh83elv35t.cloudfront.net/static/2024/06/2024-06-01T132721Z_1031047453_RC2328AARUG1_RTRMADP_3_INDIA-ELECTION-1024x683.jpg"
    },
    {
      "news_number": 10,
      "title": "Anna Pavlova, Bhaichung Bhutia Among Subjects of India’s Inaugural Doc Film Bazaar Co-Production Market Lab Pitches",
      "summary": "Revered Russian ballerina Anna Pavlova and ace Indian soccer player Bhaichung Bhutia are among the subjects of projects selected at the inaugural edition of India’s Doc Film Bazaar.\nAs revealed by Variety, the market is a documentary-focused sister edition of the Film Bazaar that takes place in Goa annually in November.\nPopular on VarietyPrithul Kumar, festival director, MIFF and Doc Film Bazaar and joint secretary and MD, National Film Development Corporation, said: “One of the Doc Film Bazaar’s most significant sections, the Doc Co-Production Market, provides funding and support for carefully selected projects.\nWe received 62 concepts in 27 languages from 10 countries for the first Doc Co-Production Market at Doc Film Bazaar.\nMIFF takes places June 15-21, while the Doc Film Bazaar unspools June 16-18.",
      "url": "https://variety.com/2024/film/news/india-doc-film-bazaar-coproduction-market-lab-projects-2024-1236022750/",
      "imgURL": "https://variety.com/wp-content/uploads/2024/06/Anna-Pavlova-Bhaichung-Bhutia.jpg?w=1000&h=563&crop=1"
    },
    {
      "news_number": 11,
      "title": "IND vs BAN T20 World Cup 2024 warm-up: India beat Bangladesh by 60 runs",
      "summary": "Powered by Rishabh Pant’s half-century, the Indian men’s cricket team defeated Bangladesh by 60 runs in the final ICC Men’s T20 World Cup 2024 warm-up match, held at the Nassau County International Cricket Stadium in New York on Saturday.\n“Quite happy with how things went,” Indian captain Rohit Sharma said after the match.\nIt’s a new venue, new ground, drop-in pitch - it’s important to get used to it and we managed pretty well.\nAll in happy, happy with how things went,” Rohit summed up.\nIndia opted to bat first in New York and lost Sanju Samson for a single but captain Rohit Sharma (23) rebuilt the innings alongside Pant.",
      "url": "https://olympics.com/en/news/india-vs-bangladesh-t20-world-cup-2024-cricket-warm-up-match-result-scores",
      "imgURL": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/bwurjpoebogd1ov6dw49"
    },
    {
      "news_number": 12,
      "title": "Air India apologises after San Francisco flight fiasco, offers ₹30,000 travel voucher",
      "summary": "Apologising for the lapse in service and the inconvenience caused to passengers after San Francisco flight got delayed by 30 hours, Air India on Saturday offered a travel voucher of USD 350 each to the passengers.\nAir India Executive Vice President and Chief Operating Officer Klaus Goersch wrote a letter to the passengers over the inordinate delay and the inconvenience caused to them.\nAlso Read: Air India passengers faint on San Francisco-bound flight amid 8-hour delay; no AC, say fliersThe San Francisco flight from Delhi got delayed by 30 hours, before it took-off on Friday and landed in San Francisco on Saturday, after the flight duration of around 16 hours.\nThe letter said that as a gesture of apology, Air India has offered a \"travel voucher worth USD 350\" for future travel with the airline.\nThe regulator has asked Air India why enforcement action shall not be initiated against the airline as flight Al-179 dated 24 May and flight Al- 183 dated 30 May were inordinately delayed.",
      "url": "https://www.livemint.com/news/india/air-india-apologises-after-san-francisco-flight-fiasco-offers-rs-30-000-travel-voucher-11717320765493.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2024/06/02/1600x900/Air_India_A350-900_1713508027779_1717321158423.jpg"
    },
    {
      "news_number": 13,
      "title": "My Father’s Fate, and India’s",
      "summary": "India’s most revered cultural, research, scientific, and educational institutions were packed with ideologues who seemed to owe their fealty to the Modi government.\nThis “New India,” as Modi’s supporters call it, is a major exhibit in the tragic twenty-first-century story of global democratic backsliding.\nWorse, according to a study by the International Labour Organization, India’s youth account for eighty-three per cent of the country’s unemployed.\nWhat makes this election unusual is the plain contempt for the cheap consolations of Modi’s Hindu nationalism, even among those who once constituted the core of his support.\ndid not, on its own, empower the government to revoke the citizenship of Indian Muslims.",
      "url": "https://www.newyorker.com/news/dispatch/my-fathers-fate-and-indias",
      "imgURL": "https://media.newyorker.com/photos/6657a4c77a88e4d48573e401/16:9/w_1280,c_limit/Komireddi-Modi.jpg"
    },
    {
      "news_number": 14,
      "title": "India’s massive six-week marathon election comes to a close",
      "summary": "With six weeks of voting and nearly one billion registered voters, India’s massive marathon election ended on Saturday.\nPrime Minister Narendra Modi is expected to win, with final results likely announced on Tuesday.\nNBC News’ Janis Mackey Frayer has more.June 1, 2024",
      "url": "https://www.nbcnews.com/nightly-news/video/india-s-massive-six-week-marathon-election-comes-to-a-close-212088389848",
      "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/mpx/2704722219/2024_06/1717283665313_nn_jma_indias_massive_marathon_election_ends_240601_1920x1080-inm9sl.jpg"
    },
    {
      "news_number": 15,
      "title": "A political scandal raises questions about Modi and India's democracy : Up First : NPR",
      "summary": "The Sunday Story: An Indian Political ScandalEnlarge this image toggle caption Screenshot by NPR/Mojo Story/Rafiq Maqbool/AP Screenshot by NPR/Mojo Story/Rafiq Maqbool/APStarting in 2018, sixteen people were arrested in India for allegedly plotting to assassinate Prime Minister Narendra Modi.\nThey included professors, a poet, trade unionists and members of an improv acting troupe.\nThe evidence against them, discovered on their electronic devices, appears damning: minutes of terror cell meetings, emails to banned Maoist rebels and a letter suggesting a suicide attack on Modi.\nThey all say they were falsely accused and that the evidence against them was fabricated and planted by hackers in order to silence them.\nDigital forensic investigators not only agree but say Modi's own government may be involved.",
      "url": "https://www.npr.org/2024/06/02/1198912881/india-modi-political-scandal-activists-jailed",
      "imgURL": "https://media.npr.org/assets/img/2024/05/30/stan-swamy-duo_wide-a769e0cb4c5e3deb23dbae22feb4f0e62cd655fb.jpg?s=1400&c=100&f=jpeg"
    },
    {
      "news_number": 16,
      "title": "India’s scorching heat and lack of water leave Delhi’s poor to suffer worst of climate crisis",
      "summary": "New Delhi CNN —There’s no fresh water in the slums of Delhi’s Chanakyapuri neighborhood.\nShe tried to run back for it – but it was too late, the water had run out.\nResidents in Delhi’s Chanakyapuri neighborhood clamber to get water under baking heat on May 31, 2024.\nAs record heat grips northern India, the Delhi government has been forced to ration these free water deliveries.\nBut if they get to the hospital late and the intervention is late, the mortality rate is so high.",
      "url": "https://www.cnn.com/2024/06/01/india/india-scorching-heat-climate-crisis-intl-hnk/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/ap24143563410624.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 17,
      "title": "Backed by Modi’s government, NGOs set up shelters for trans people in India. Then, the NGOs say, the government left them hanging for funds",
      "summary": "Wall art is pictured in the room of Garima Greh resident Shubangi Indira Mehra.\nThis time the goal was even more ambitious: “Garima Greh will be set up across the country,” the call announced.\nAccording to the government’s 2020 calculations, a Garima Greh would need $37,664 a year to run.\nSix NGOs told CNN that they appealed to the landlords of the buildings they were using for shelters for delays in rent payments.\n“Since the funding stopped coming, the meetings also stopped because everyone would ask the same thing in the meetings: ‘Where are the funds?’” Patel told CNN.",
      "url": "https://www.cnn.com/interactive/asequals/trans-shelters-india-government-funding-as-equals-intl-cmd/",
      "imgURL": "https://ix.cnn.io/wp-content/uploads/2024/05/Extras-24-scaled.jpg"
    },
    {
      "news_number": 18,
      "title": "As Voting Ends in India, Modi Awaits a Verdict on His 10 Years in Power",
      "summary": "Exit polls released after the last round of voting suggested a comfortable return for his Hindu-nationalist Bharatiya Janata Party, or B.J.P.\nA newly united opposition has put up a fight, rallying against Mr. Modi’s divisive politics and management of India’s deeply unequal economic growth.\nBut the exit polls indicated it was struggling to significantly cut into the sizable majority in the 543-seat Parliament held by Mr. Modi’s party.\nIn a message of thanks after the voting closed, Mr. Modi expressed confidence that “the people of India have voted in record numbers to re-elect” his government.\nBut Mallikarjun Kharge, the president of the largest opposition party, the Indian National Congress, played down the exit polls as “government surveys” and said the official results will show that his alliance was ahead.",
      "url": "https://www.nytimes.com/2024/06/01/world/asia/india-election-modi.html",
      "imgURL": "https://static01.nyt.com/images/2024/06/01/multimedia/01india-exitpolls-chzf/01india-exitpolls-chzf-facebookJumbo.jpg"
    },
    {
      "news_number": 19,
      "title": "FIH Pro League Highlights: Great Britain stops India's winning momentum, win 3-1",
      "summary": "Open Extended ReactionsThe Indian men's hockey team couldn't keep up their winning momentum in the FIH Pro League as they suffered a 3-1 loss against Great Britain in London on Sunday.\nTwo strikes from Nicholas Bandurak in the first quarter and Will Calnan's goal in the final quarter did the job for Great Britain.\nAbhishek scored the only goal for India.\nIndia improved after scoring the goal but still didn't do enough to come up with good scoring opportunities.\nIndia will be back in action in the next weekend to play their final two matches in the season's FIH Pro League.",
      "url": "https://www.espn.in/field-hockey/story/_/id/40261094/india-vs-great-britain-hockey-live-fih-pro-league-scores-updates-commentary-news",
      "imgURL": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0405%2Fr1314513_1296x729_16%2D9.jpg"
    },
    {
      "news_number": 20,
      "title": "India's Elite IIT Graduates Face a Reckoning as Jobs Dry Up",
      "summary": "Welcome to India Edition, I’m Menaka Doshi.\nJoin me each week for a ringside view of the billionaires, businesses and policy decisions behind India’s rise as an emerging economic powerhouse.\nYou can subscribe here, and share feedback with me here.",
      "url": "https://www.bloomberg.com/news/newsletters/2024-05-30/tough-job-market-for-india-s-elite-engineers-sparks-ai-led-existential-concern",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/inbiPXQr_jAE/v0/1200x900.jpg"
    },
    {
      "news_number": 21,
      "title": "Solar system to witness stunning phenomenon: How to watch June 3 2024 planetary alignment in India?",
      "summary": "The planetary alignment is also called as the parade of planets 2024.\nAlso Read: NASA shares tips for enjoying 'parade of planets 2024' on June 3: ‘Look for reddish…’What is planetary aignment?\nPlanetary alignment is a term referred to a rare positioning of planets in the solar system.\nPlanetary alignment 2024 is visible in the sky from all across India, as it is likely to be a clear sky tomorrow.\nIt is also advisable for people to set an alarm to catch a glimpse of the planetary parade before sunrie each day this week.",
      "url": "https://www.livemint.com/science/news/solar-system-to-witness-stunning-phenomenon-how-to-watch-june-3-2024-planetary-alignment-in-india-11717309338317.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2024/06/02/1600x900/NAsa_parade_of_planets_1717043393602_1717309904429.jpg"
    },
    {
      "news_number": 22,
      "title": "India election results 2024: How will votes be counted?",
      "summary": "Here’s how vote counting for elections works:What time will votes be counted for India’s 2024 election?\nThe ECI appoints a returning officer (RO) for each parliamentary constituency, making them responsible for vote counting.\nVote counting begins with the RO counting votes through postal ballots.\nThe control unit of the EVM contains a “Results” button to display the number of votes each candidate received.\nWhen the Results button is pressed, the EVM displays votes secured by candidates one by one, indicated by beep sounds.",
      "url": "https://www.aljazeera.com/news/2024/6/2/india-lok-sabha-election-2024-how-will-votes-be-counted",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/12180950-1716885281.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 23,
      "title": "What to know about India’s election, the world’s biggest democratic event",
      "summary": "As election officials trekked for miles, by foot, hoof and helicopter, to collect the votes of the most remote citizens, India’s top diplomat, S. Jaishankar, called it the “largest electoral logistics exercise that this planet has ever witnessed.”NEW DELHI — The end has come for India’s 47-day marathon election for the lower house of Parliament, the Lok Sabha, in which almost a billion people, from the Himalayas in the north to far flung islands in the Indian Ocean, had registered to vote.\nThe ruling party and Prime Minister Narendra Modi are vying for a third term after a decade in power.\nThey are hoping for a mandate that surpasses their already spectacular performance in 2019, when the party took 303 of the 543 seats — far beyond the 272 needed to rule.\nThey are hoping to maintain their stronghold in the north and make new inroads in the east and south.\nResults will be announced Tuesday.",
      "url": "https://www.washingtonpost.com/world/2024/06/01/india-election-lok-sabha/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PNGFLUHH75TUZV2JS6RQ6JOQCA_size-normalized.jpg&w=1440"
    },
    {
      "news_number": 24,
      "title": "As Indian voting wraps up, reports of electoral irregularities mount",
      "summary": "SURAT, India — As India wraps up a seven-week-long marathon election, reports of irregularities have reached a level not seen in decades.\nAfter all eight opposition candidates dropped out under questionable circumstances, local officials declared a winner by default: the candidate from Prime Minister Narendra Modi’s BJP.\nIn Khajuraho, another central city, the BJP candidate also ran without a major-party rival after election officials disqualified his opponent, citing incomplete paperwork.\nEven leaders within the BJP’s Delhi headquarters wondered whether the Gujarat party officials went too far, said a senior Gujarat political journalist who covered the saga closely.\nThe state party was under pressure to demonstrate its strength and deliver high voter turnout.",
      "url": "https://www.washingtonpost.com/world/2024/05/31/india-elections-bjp-voting-irregularities/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BNL3TN2NUCVEUIQQN24CYFE3W4_size-normalized.jpg&w=1440"
    },
    {
      "news_number": 25,
      "title": "Delhi, Bihar: Heat kills at least 15 in India as temperatures near 50C",
      "summary": "Heat-stroke related deaths have also been reported from the states of Bihar, Rajasthan and Jharkhand and the national capital, Delhi.\nThe searing heat comes as India is holding its general election, the results of which will be declared on 4 June.\nOn Thursday, a labourer admitted with a heat stroke died while receiving treatment at a hospital in Delhi.\nVideos of residents in Delhi jostling for water from water tankers have been widely shared on social media.\nGetty Images A hospital in Delhi has set up a room for patients suffering from heat strokes",
      "url": "https://www.bbc.com/news/articles/czddy30ezd5o",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/39e2/live/8c52dc20-1f50-11ef-baa7-25d483663b8e.jpg"
    },
    {
      "news_number": 26,
      "title": "As temperatures in India break records, ancient terracotta air coolers are helping fight extreme heat",
      "summary": "Nandita Iyer For millennia, earthen pots known as \"matkas\" have been used to cool water.\nBut in recent years, as India contends with extreme heat, the need for cool is growing more urgent.\nAnt Studio CoolAnt's \"Beehive\" design is based on the principles of evaporative cooling and natural ventilation (Credit: Ant Studio)Researchers have also experimented with terracotta cooling prototypes.\nMechanical engineering students from Maharashtra, India, built a terracotta air conditioner, that used a fan to suck in air and expel it over wet terracotta.\n\"In the last 100 years, modern technologies have revolutionised our air cooling.",
      "url": "https://www.bbc.com/future/article/20240530-how-ancient-knowledge-of-terracotta-is-cooling-modern-indian-buildings",
      "imgURL": "https://ychef.files.bbci.co.uk/624x351/p0j19xkk.jpg"
    },
    {
      "news_number": 27,
      "title": "Gautam Gambhir breaks silence on replacing Rahul Dravid as India's head coach after T20 World Cup: 'No bigger honour…'",
      "summary": "The deadline for applying for the head coach post of Indian men's cricket team chief coach ended on Monday.\nGambhir has already received the backing of former BCCI president Sourav Ganguly to coach Rohit Sharma and Co. after the T20 World Cup.\nThe Indian head coach was handed a short-term extension after his two-year contract expired last year.\nThe T20 World Cup is Dravid's last assignment as the head coach of the Men In Blue.\nIf everyone starts praying for us and we start playing and representing them, India will win the World Cup.",
      "url": "https://www.hindustantimes.com/cricket/gautam-gambhir-breaks-silence-on-replacing-rahul-dravid-as-india-head-coach-after-t20-world-cup-would-love-to-101717337443210.html",
      "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/06/02/1600x900/CRICKET-IND-IPL-T20-HYDERABAD-KOLKATA-100_1717338207057_1717338223841.jpg"
    },
    {
      "news_number": 28,
      "title": "T20 World Cup: India's squad sends confusing signals",
      "summary": "Why India's T20 World Cup squad sends confusing signals2 days ago Ayaz Memon , Cricket writer ShareAFP As the highest IPL run-getter, Virat Kohli reaffirmed his status as the world's best all-format batsmanRanked No.\n1, India enters the ninth T20 World Cup 2024 as favourites.\nLast year, India lost in the final of the World Test Championship and ODI World Cup, both times to Australia.\nHowever, the Indian squad for the World Cup based on IPL 2024 sends confusing signals.\nHarshal Patel and Varun Chakravarthy, top wicket-takers in the recent IPL and part of India's 2022 T20 World Cup team, have been overlooked.",
      "url": "https://www.bbc.com/news/articles/cx99gj445wno",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/a799/live/19e1abe0-1c0c-11ef-a11e-b1a4ba8bef4b.jpg"
    },
    {
      "news_number": 29,
      "title": "‘Minority exclusion’: Are Indian Muslims facing voter suppression?",
      "summary": "'” he told Al Jazeera.\nI made the video under their pressure,” he told Al Jazeera.\nI have always been in Barpeta,” the 43-year-old told Al Jazeera.\nBut they refused to allow her to vote, saying her name and photo don’t match,” he told Al Jazeera.\n“I still have the fear that if I speak up, they might do something worse to me,” he told Al Jazeera.",
      "url": "https://www.aljazeera.com/features/2024/6/1/india-election-fairness-concerns-amid-muslim-vote-suppression-allegations",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/AFP__20240513__34RF2HZ__v1__HighRes__IndiaPoliticsVote-1715598178.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 30,
      "title": "Modi's BJP-led alliance projected to win decisive majority in India's election, exit polls show",
      "summary": "Supporters of the ruling Bharatiya Janta Party (BJP) holding cut-outs of India's Prime Minister a Narendra Modi during an election campaign rally in Amritsar on May 30, 2024.\nIndia's Prime Minister Narendra Modi looks set for a rare third consecutive term in power, as local exit polls on Saturday suggested his Bharatiya Janata Party-led alliance will clinch a decisive parliamentary majority.\nThe party or coalition that wins at least 272 votes will form the government.\nIf the exit polls, which have a patchy record, are confirmed, Modi will serve for another five years as the country's prime minister — a position he has held since 2014.\nUnder Modi's decade-long reign, India has witnessed robust economic growth and a leap in its global reputation.",
      "url": "https://www.cnbc.com/2024/06/01/india-election-modis-bjp-alliance-set-to-win-parliamentary-majority.html",
      "imgURL": "https://image.cnbcfm.com/api/v1/image/107423034-1717295991307-gettyimages-2154665075-AFP_34UA3NR.jpeg?v=1717296025&w=1920&h=1080"
    },
    {
      "news_number": 31,
      "title": "The Incarcerations: BK-16 and the Search for Democracy in India by Alpa Shah – review",
      "summary": "In August that year, the police raided the homes of, among others, a leftwing political columnist, a cartoonist, a poet, a human rights lawyer, a Dalit scholar and a Jesuit priest.\nSudha Bharadwaj, a Massachusetts-born labour organiser and human rights attorney, was among the first to condemn Sen’s arrest and found herself in jail a couple of months later.\nIn 2020, the human rights watchdog Amnesty International ceased its operations in India after the government decided to freeze its bank accounts.\nShah suggests that the saga of this multiform crisis unfolding in India is encapsulated in the lives of the BK 16.\nafter newsletter promotionView image in fullscreen Rona Wilson, human rights activist and one of the BK 16.",
      "url": "https://www.theguardian.com/books/article/2024/jun/02/the-incarcerations-bk-16-and-the-search-for-democracy-in-india-by-alpa-shah-review",
      "imgURL": "https://i.guim.co.uk/img/media/c7305a9ba852581b6fc623f3d7a6b09040555182/0_302_8256_4954/master/8256.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=d35f18a155109a4ba5282f372bacf613"
    },
    {
      "news_number": 32,
      "title": "The Indian women trumpeting their caste on Instagram",
      "summary": "The Indian women trumpeting their caste on Instagram3 days ago Divya Arya , BBC Hindi ShareBBC Shivi Dikshit shoots Instagram Reels at home for her 150,000 followersYoung women in small towns and villages across India are proudly trumpeting their caste identities on Instagram, making it the latest battleground for caste politics.\nThis is just one of hundreds of Instagram Reels made by Shivi Dikshit, a 24-year-old from the northern state of Uttar Pradesh who shares short videos about her Brahmin caste with her 150,000 followers on Instagram.\nMs Dikshit is among the thousands of Indian women who are using Instagram to talk about their caste in new and imaginative ways.\nIn pictures: The many lives of India's DalitsWhat is India's caste system?\nGetty Images Many young Indian women are using Instagram to talk about their caste identitiesThese influencers also highlight the fault lines in a country marked by religious and social divisions.",
      "url": "https://www.bbc.com/news/articles/cgrrq9e2pelo",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/21ac/live/9d609d50-1ea0-11ef-baa7-25d483663b8e.jpg"
    },
    {
      "news_number": 33,
      "title": "Air India Delhi-Vancouver flight takes off after 22 hours delay in third incident in a week",
      "summary": "Air India's Vancouver flight from Delhi of June 1 finally departed at 3.15 a.m. on June 2 after a delay of nearly 22 hours, a source said.\n\"The Delhi-Vancouver flight of Air India, which was to depart on Saturday morning, finally left at around 3.15 a.m. on Sunday,\" the source said.\nHowever, despite the passengers' plight due to the massive delay, Tata Group-owned Air India did not issue any official statement.\nAir India, which was earlier under the ownership of the Indian government, was privatised and handed over to Tata Group in January 2022.\nThe previous day, aviation regulator DGCA issued a show cause notice to Air India for some flight delays and failure to take due care of the passengers.",
      "url": "https://www.thehindu.com/business/Industry/air-india-delhi-vancouver-flight-takes-off-after-22-hours-delay-in-third-incident-in-a-week/article68242522.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/xvt57v/article68242567.ece/alternates/LANDSCAPE_1200/IMG_Elevated_Eastern_Cro_2_1_36CL69CE.jpg"
    },
    {
      "news_number": 34,
      "title": "Photos: India votes in last phase of world’s largest electoral exercise",
      "summary": "Voters in India have braved soaring temperatures to cast their ballots in the last phase of the country’s staggered elections to decide the fate of 904 candidates, including Prime Minister Narendra Modi.\nThe polls on Saturday conclude the largest electoral exercise in the world that kicked off on April 19, with some 969 million people eligible to vote.\nFifty-seven seats across eight states and federally-run territories (union territories) are up for grabs in the seventh phase as voters elect members of parliament to the 18th Lok Sabha, the lower house of parliament.\nThe previous six phases – April 19, April 26, May 7, May 13, May 20 and May 25 – recorded turnouts of 66.1, 66.7, 61, 67.3, 60.5 and 63.4 percent, respectively.\nResults are expected on June 4.",
      "url": "https://www.aljazeera.com/gallery/2024/6/1/photos-india-votes-in-last-phase-of-worlds-largest-electoral-exercise",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/2024-06-01T015607Z_812645529_RC2128AF180O_RTRMADP_3_INDIA-ELECTION-1717239235.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 35,
      "title": "Exit polls forecast decisive majority for Narendra Modi in India’s election",
      "summary": "Try unlimited accessOnly ₹100 for 4 weeksThen ₹4,335 per month.\nComplete digital access to quality FT journalism on any device.\nCancel anytime during your trial.",
      "url": "https://www.ft.com/content/41f48391-ce38-49ed-bd89-c5744f9985c3",
      "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/ftlogo-v1%3Abrand-ft-logo-square-coloured?source=update-logos&format=svg"
    },
    {
      "news_number": 36,
      "title": "Air India's Delhi-Vancouver Flight Faces Over 9 Hour Delay. Airline Says...",
      "summary": "In recent days, some ultra long haul flights of Air India have faced inordinate delays.\nAn Air India flight from the national capital to Vancouver was delayed for over nine hours due to a technical issue on Sunday.\nThe flight AI 185, which was to take off at around 0530 hours, departed at about 1450 hours, according to data from flight tracking websites.\nEarlier in the day, Air India's Vancouver flight from Delhi of June 1 departed at 0315 after a delay of nearly 22 hours.\n\"Air India regrets the inconvenience caused to passengers due to the operational disruption,\" the spokesperson said.",
      "url": "https://www.ndtv.com/india-news/air-indias-delhi-vancouver-flight-faces-over-9-hour-delay-airline-says-5801715",
      "imgURL": "https://c.ndtvimg.com/2023-11/7281frb8_air-india-generic_625x300_24_November_23.jpeg"
    },
    {
      "news_number": 37,
      "title": "India election 2024 exit polls updates: Modi’s alliance projected to win",
      "summary": "This live page is now closed.\nYou can continue to follow our coverage of India’s election here.",
      "url": "https://www.aljazeera.com/news/liveblog/2024/6/1/india-election-exit-polls-live-news-will-modi-win-a-rare-third-term-as-pm",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/2023-08-04T123702Z_408029614_RC2ZG2AMVNW6_RTRMADP_3_INDIA-POLITICS-GANDHI-1-1715067525.jpg?resize=1200%2C630"
    },
    {
      "news_number": 38,
      "title": "India’s exit polls show a majority for Modi’s BJP-led alliance in election",
      "summary": "A summary of exit polls project the NDA could win between 355 and 380 seats in the 543-member lower house of parliament.\nIndian Prime Minister Narendra Modi’s Bharatiya Janata Party (BJP)-led alliance is projected to win an emphatic majority in the general election, TV exit polls say, suggesting the right-wing party would do better than expected by most analysts.\nMost exit polls on Saturday projected the ruling National Democratic Alliance (NDA) could win a two-thirds majority in the 543-member lower house of parliament, where 272 is needed for a simple majority.\n“Exit polls always show the BJP winning.\nIn his first comments after the voting ended, Modi claimed victory without referring to the exit polls.",
      "url": "https://www.aljazeera.com/news/2024/6/1/indias-exit-polls-predict-a-big-majority-for-modis-bjp-led-alliance",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/AP24153260225493-1717239833.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 39,
      "title": "Six planets to align in skies: These Indian cities to witness rare cosmic event",
      "summary": "A rare planetary alignment is set to grace the skies, presenting a stunning celestial display that astronomy enthusiasts won't want to miss.\nThe optimal viewing time for this planetary alignment falls on June 3, 2024, but the spectacle will be visible over several days leading up to and following this date.\nThis planetary parade, featuring Mercury, Jupiter, Saturn, Mars, Uranus, and Neptune, promises a visual treat for sky gazers.\nHowever, observing these planets close to the horizon just before sunrise may pose a challenge due to their proximity to the Sun.\nAccording to experts, the planetary alignment could be seen from across India, given clear skies ahead of sunrise.",
      "url": "https://www.indiatoday.in/science/story/six-planets-to-align-in-skies-these-indian-cities-to-witness-rare-cosmic-event-2546806-2024-06-02",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/parade-of-planets-224245182-16x9.jpg?VersionId=euNhzgE1Aq13m0LdS7zmelF8sQeBL.Bt"
    },
    {
      "news_number": 40,
      "title": "Air India apologises for delay in Delhi-San Francisco flight, offers $350 travel voucher to passengers",
      "summary": "Air India has apologised and offered a travel voucher of $350 each to the passengers of the San Francisco flight that took off from the national capital after a delay of more than 30 hours.\nAs a gesture of apology, Air India has offered a \"travel voucher worth $350\" for future travel with the airline, the letter dated May 31 said.\nThe Delhi-San Francisco flight that was originally scheduled to take off at around 3:30 p.m. on Thursday faced an inordinate delay due to various factors, including technical glitch, non-functional air-conditioning system, and payload issues.\nOn Friday, aviation regulator DGCA issued a show cause notice to Air India for some flight delays and failure to take due care of the passengers.\nIn the show cause notice, the watchdog mentioned the inordinate delay of two international flights - AI 183 from Delhi to San Francisco on May 30 and AI 179 from Mumbai to San Francisco on May 24.",
      "url": "https://www.thehindu.com/news/national/delhi-san-francisco-flight-delay-air-india-apologises-offers-350-travel-voucher-to-passengers/article68240434.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/ob0j5g/article68240514.ece/alternates/LANDSCAPE_1200/20240502145L.jpg"
    },
    {
      "news_number": 41,
      "title": "India GDP: Economy grows by 8.2%",
      "summary": "Gross domestic product (GDP) increased by 8.2%, according to the Statistics Ministry, cementing India’s status as the world’s fastest growing major economy.\nModi is running on his economic record over the past 10 years, a period of robust growth for India.\nIt also experienced the largest percentage growth in GDP over the decade compared to other major economies.\n“After China, India is the only economy that can achieve economies of scale, due to its large market,” wrote Nomura economists in a report earlier this week.\nRising mercury levels in India risks reversing progress on poverty alleviation, health and economic growth, experts say.",
      "url": "https://www.cnn.com/2024/05/31/business/india-gdp-q4-growth-intl-hnk/index.html",
      "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2144493358.jpg?c=16x9&q=w_800,c_fill"
    },
    {
      "news_number": 42,
      "title": "Imperious Pant leads India to warm-up win over Bangladesh",
      "summary": "Bangladesh, off the back of their 2-1 series defeat to the USA, had some positive signs - including some fine fielding, notably Mahmudullah's wonderful catch on the boundary, with deft footwork and well-timed handling to remove Dube for 14.\nIndia were without Virat Kohli, who joined up with the squad late after his IPL exploits and was given a rest.\nAnd captain Rohit Sharma hinted that his starting line-up against Ireland on Wednesday is not yet confirmed, saying in the post-match ceremony: \"We have got 15 good players here.\nWe have to see what the conditions are and then see what combination is best for us.\"\nAll in all, it was a fine limited-capacity test event for the Nassau County International Cricket Stadium ahead of the beginning of the ICC Men's T20 World Cup 2024.",
      "url": "https://www.icc-cricket.com/tournaments/t20cricketworldcup/news/imperious-pant-leads-india-to-warm-up-win-over-bangladesh",
      "imgURL": "https://images.icc-cricket.com/image/upload/t_ratio16_9-size40/prd/qa0cxgxqwym2ngbwcxef"
    },
    {
      "news_number": 43,
      "title": "Exit Polls 2024: “Will shave my head if Modi retains PM post”, says AAP’s Somnath Bharti",
      "summary": "Exit polls on June 1 predicted that Mr. Modi will retain power for a third straight term, with the BJP-led NDA expected to win a big majority in the Lok Sabha polls.\nAll exit polls will be proven wrong on 4th June and Modi ji will not become Prime Minister for the third time,\" Mr. Bharti said.\nFear of Mr. Modi does not allow exit polls to show him loose (lose).\nMost exit polls for Delhi predicted the BJP to win five to seven Lok Sabha seats.\nHowever, AAP Rajya Sabha MP Sanjay Singh rejected the exit polls, saying they were \"sponsored\" and called them \"Modi's exit poll.\"",
      "url": "https://www.thehindu.com/elections/lok-sabha/aaps-bharti-vows-to-shave-head-if-modi-retains-pm-post-kejriwal-says-india-bloc-to-form-next-government/article68242324.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/chpae/article68242358.ece/alternates/LANDSCAPE_1200/PTI05_22_2024_000199A.jpg"
    },
    {
      "news_number": 44,
      "title": "How video gaming in India is now a ‘Bharat’ phenomenon",
      "summary": "Video gaming , once perceived as a niche pastime, has rapidly evolved into a Bharat phenomenon, captivating millions across the subcontinent.\nA major hurdle is the ongoing lack of talent, especially in key areas like programming, game development and design.\nInconsistent power supplies and the lack of high-end gaming hardware in certain areas can also disrupt game development processes.There is also a need for more education and awareness concerning careers in game development.\nWith a burgeoning player base, supportive communities and the potential for groundbreaking game development, India is well positioned to become a major force on the global gaming scene.\nThe history of India’s gaming industry is one of progress, excitement and aspiration.The author is CEO and founder, JetSynthesys.",
      "url": "https://m.economictimes.com/tech/catalysts/how-video-gaming-in-india-is-now-a-bharat-phenomenon/articleshow/110627140.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-110627212,width-1200,height-630,imgsize-43594,overlay-ettech/photo.jpg"
    }
  ]
}