[{"news_number": 0, "title": "Pak Admits Violating Pact With India, Nawaz Sharif Says \"Was Our Fault\"", "summary": "After a historic summit here, Nawaz Sharif and Ata Bihari Vajpayee signed the Lahore Declaration on February 21, 1999.\nHe said all cases against him were false while the cases against Pakistan Tehreek-e-Insaf founder leader Imran Khan were true.\nHe asked Imran Khan to deny that he was not launched by the ISI.\nThe three-time premier talked about receiving a message from Gen Islam to resign from the office of prime minister (in 2014).\nSharif also praised his younger brother Prime Minister Shehbaz Sharif for standing by his side through thick and thin.", "keywords": ["nawaz", "khan", "imran", "admits", "pakistan", "kargil", "india", "pak", "fault", "minister", "vajpayee", "violating", "talked", "prime", "sharif", "pact", "gen"], "url": "https://www.ndtv.com/world-news/pak-violated-lahore-agreement-signed-with-india-in-1999-nawaz-sharif-5765586", "imgURL": "https://c.ndtvimg.com/2024-02/vftlr57o_nawaz-sharif-afp_625x300_10_February_24.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 1, "title": "Horoscope Today: May 29, 2024", "summary": "When in doubt, ask yourself the question: how can I show up for my fellow unicorns?\nWhat Spirit is urging you to do right now is: adopt the spirit of selfless service as you drop your attachments to a certain outcome.\nWhat’s out: letting the opinions of others weigh you down.\nAquarius, the week ahead could bring positive news on the domestic front, especially if you have been looking to shift base.\nThis is also a wonderful time to invest in a holiday home too, if that’s something you’ve been thinking about.", "keywords": ["spirit", "2024", "youre", "horoscope", "good", "ahead", "youve", "whove", "today", "letting", "whats", "question", "29", "wonderful"], "url": "https://www.vogue.in/horoscope/collection/horoscope-today-may-29-2024/", "imgURL": "https://media.vogue.in/wp-content/uploads/2021/12/Daily-Horoscope-1920x1080.jpg"}, {"news_number": 2, "title": "India's T20 World Cup journey starts in USA; Virat Kohli on dinner date with Anushka Sharma in Mumbai", "summary": "Team India has started training after the first two batches of players have reached the USA ahead of the T20 World Cup.\nMeanwhile, the BCCI has reportedly scheduled Kohli's visa appointment for a later date as he will travel to the USA on May 30.\nKohli was spotted on a dinner date with Anushka Sharma on Tuesday night in Mumbai as the couple was accompanied with former cricketer Zaheer Khan and his wife Sagarika Ghatge.\nThe Men in Blue will start their T20 World Cup campaign on June 5 against Ireland at the newly constructed Nassau County International Cricket Stadium in New York.\nThey will later play tournament co-hosts USA (June 12) and Canada (June 15) to wrap up their Group A matches.", "keywords": ["sharma", "mumbai", "journey", "kohli", "bcci", "team", "training", "members", "starts", "world", "t20", "york", "virat", "indias", "usa", "players"], "url": "https://www.hindustantimes.com/cricket/india-t20-world-cup-journey-starts-in-usa-virat-kohli-on-dinner-date-with-anushka-sharma-in-mumbai-101716951189521.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/India_training_Kohli-Anushka_1716951757014_1716951767563.jpg"}, {"news_number": 3, "title": "India successfully test fires RudraM-II missile. Here’s why it matters", "summary": "On Wednesday, the Indian Air Force successfully test-fired the RudraM-II air-to-surface missile off the coast of Odisha.\nThe RudraM-I was test-fired four years ago by the Indian Air Force at the integrated test range in Odisha’s Balasore.\nIn May 2019, the Indian Air successfully test-fired the aerial version of the BrahMos missile from a Su-30 MKI fighter aircraft.\nIt has demonstrated the indigenousness of the missile system and the advanced propulsion and control technologies that have been incorporated into it.\nSingh said the successful test has consolidated the role of the RudraM-II system as a force multiplier to the Armed Forces.", "keywords": ["heres", "developed", "range", "indian", "successfully", "matters", "india", "missile", "force", "defence", "fires", "air", "system", "test", "rudramii"], "url": "https://www.firstpost.com/explainers/india-test-fires-rudram-ii-missile-why-it-matters-13776604.html", "imgURL": "https://images.firstpost.com/uploads/2024/05/1200-2024-05-95e1893d1d916100a2e4493fe84ee80f.jpg?im=FitAndFill=(1200,675)"}, {"news_number": 4, "title": "Leaflet by Leaflet, a Few Aging Activists Fight India’s Tide of Bigotry", "summary": "One recent morning, Roop Rekha Verma, an 80-year-old peace activist and former university leader, walked through a north Indian neighborhood prone to sectarian strife and parked herself near a tea shop.\nFrom her sling bag, she pulled out a bundle of pamphlets bearing messages of religious tolerance and mutual coexistence and began handing them to passers-by.\nDon’t let anyone divide you,” one read in Hindi.\nSpreading those simple words is an act of bravery in today’s India.\nMs. Verma and others like her are waging a lonely battle against a tide of hatred and bigotry increasingly normalized by India’s ruling Bharatiya Janata Party, or B.J.P.", "keywords": ["verma", "aging", "activists", "words", "bigotry", "walked", "leaflet", "tide", "tea", "fight", "waging", "strife", "university", "indias", "tolerance", "todays"], "url": "https://www.nytimes.com/2024/05/28/world/asia/india-activists.html", "imgURL": "https://static01.nyt.com/images/2024/05/12/world/00india-activists/00india-activists-facebookJumbo.jpg"}, {"news_number": 5, "title": "India may have recorded its hottest temperature ever amid severe heat wave", "summary": "India may have recorded its hottest temperature ever amid severe heat waveOne of the hottest countries on Earth potentially recorded its highest temperature ever.\nIndia recorded a temperature of 52.3 degrees Celsius -- or about 126 degrees Fahrenheit -- on Wednesday at a weather station in Mungeshpur, a suburb of New Delhi, according to the India Meteorological Department.\nThe previous record at the Mungeshpur station occurred in 2002 -- 49.2 degrees Celsius (120.6 degrees Fahrenheit), according to NDTV.\nThe previous record for hottest temperature recorded in India was in 2016, in Rajasthan, -- 51 degrees Celsius (123.8 degrees Fahrenheit), according to the IMD.\nHeat waves in India are considered \"severe\" once temperatures reach 6.5 degrees Celsius higher than normal.", "keywords": ["according", "severe", "delhi", "india", "recorded", "degrees", "amid", "summer", "wave", "heat", "hottest", "temperatures", "celsius", "temperature"], "url": "https://abcnews.go.com/International/india-records-hottest-temperature-amid-severe-heat-wave/story?id=110639547", "imgURL": "https://i.abcnewsfe.com/a/52e96c3b-41ba-4539-a96f-8d0cf079d221/india-heat4-gty-ml-240529_1716988641177_hpMain_16x9.jpg?w=1600"}, {"news_number": 6, "title": "India issues heat wave alert as Delhi hits 122 degrees", "summary": "NEW DELHI — India’s weather department issued a red alert for several parts of the country’s northwest on Wednesday, warning of a severe heat wave a day after parts of the capital Delhi recorded their highest temperature ever at almost 50 degrees Celsius (122 Fahrenheit).\nA red alert implies a “very high likelihood” of people developing “heat illness and heat stroke,” and calls for “extreme care” for vulnerable people, according to the India Meteorological Department.\nIndia has been grappling with unusually high temperatures this summer, and the weather department has said “heat wave to severe heat wave” conditions are likely to continue in several parts, including the capital, through Wednesday.\nIndia declares a heat wave when the maximum temperature of a region is 4.5 C (8.1 F) to 6.4 C (11.5 F) higher than usual, while a severe heat wave is declared when the maximum temperature is 6.5 C (11.7 C) higher than normal or more.\nChildren running behind a truck spraying water in New Delhi on Tuesday.", "keywords": ["hits", "c", "issues", "parts", "f", "delhi", "severe", "water", "weather", "india", "degrees", "alert", "heat", "wave", "122", "temperature"], "url": "https://www.nbcnews.com/news/world/india-issues-heat-wave-alert-delhi-hits-122-degrees-rcna154439", "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-05/290524-india-heat-water-wc-1037-5066fd.jpg"}, {"news_number": 7, "title": "Weeks of sweltering heat scorch northern India", "summary": "BIKANER, India (AP) — People in northern India have been struggling with an unrelenting, weekslong heat wave that has forced schools to close in some places and raised the risk of heatstrokes for laborers working outdoors.\n(AP Photo/Anupam Nath)A man sleeps under a truck on a hot summer day in Guwahati, India, Saturday, May 25, 2024.\n(AP Photo/Anupam Nath)A man drinks water on a hot summer day in Jammu, India, Monday, May 27, 2024.\n(AP Photo/Channi Anand)A man walks past the India Gate monument on a hot summer day in New Delhi, India, Monday, May 27, 2024.\n(AP Photo/Manish Swarup)A cobbler rests by her work equipment on a hot summer day in Lucknow, India, Monday, May 27, 2024.", "keywords": ["day", "northern", "2024", "hot", "27", "scorch", "sweltering", "weeks", "water", "india", "ap", "summer", "heat", "man", "temperatures"], "url": "https://apnews.com/article/india-heat-wave-a347b08dc2acbcc141ef6eae45ad2175", "imgURL": "https://dims.apnews.com/dims4/default/de41c4e/2147483647/strip/true/crop/7337x4127+0+382/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2F33%2Fb3e336f1f725f8a10cb5aec9479f%2F72172c1bb08346539a80271f7ec16930"}, {"news_number": 8, "title": "New Delhi records highest-ever temperature of 52.3C as north India swelters", "summary": "The India Meteorological Department (IMD), which reported “severe heatwave conditions”, recorded the temperature in the New Delhi suburb of Mungeshpur on Wednesday afternoon, smashing the previous national record in the desert of Rajasthan by more than one degree Celsius.\nRajasthan’s Phalodi town previously held the all-time heat record, hitting 51C (124F) in 2016.\nIndia declares a heatwave whenever temperatures are above 45C (113 F).\nApril, May and June are hot in most parts of India before monsoon rains bring cooler temperatures.\nNew Delhi authorities have also warned of the risk of water shortages as the capital swelters in headache-inducing heat – cutting supplies to some areas.", "keywords": ["swelters", "delhi", "523c", "severe", "highestever", "water", "weather", "india", "record", "heatwave", "north", "heat", "risk", "temperatures", "records", "temperature"], "url": "https://www.aljazeera.com/gallery/2024/5/29/photos-north-india-swelters-as-new-delhi-records-highest-ever-temperature-of-49-9c", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/AP24150128815523-1716962709.jpg?resize=1920%2C1440"}, {"news_number": 9, "title": "Delhi temperature hits highest ever in India: weather bureau", "summary": "Women shelter from the sun as they walk along a street on a hot summer day in India's city of Varanasi.\nBoys sit beneath a makeshift canopy along a street on a hot summer day in New Delhi.\n'Water scarcity'New Delhi authorities have also warned of the risk of water shortages as the capital swelters in headache-inducing heat.\nDelhi Water Minister Atishi, who only uses one name, said supplies had been halved in many areas to boost flow to \"water-deficient areas\".\nChildren run behind a truck spraying water along a street on a hot summer day in New Delhi on Tuesday.", "keywords": ["hits", "day", "hot", "delhi", "water", "weather", "india", "warned", "street", "bureau", "summer", "heat", "highest", "temperatures", "state", "temperature"], "url": "https://phys.org/news/2024-05-indian-capital-highest-temperature-celsius.html", "imgURL": "https://scx2.b-cdn.net/gfx/news/2024/a-vendor-with-an-umbre.jpg"}, {"news_number": 10, "title": "India MotoGP promoter cancels this year's race, eyes March 2025 date", "summary": "The Buddh International Circuit, located on the outskirts of capital Delhi, was due to stage the 14th round of the season on 23-25 September.\nAlthough the statement from Fairstreet didn’t explicitly talk about cancellation, it can be interpreted that the promoter is talking about moving this year’s race to March 2025.\n“The unsuitable weather conditions in September posed significant challenges for both riders and marshals, as observed last year.\nThe organisation had previously been adamant that the 2024 race will go ahead as planned and that any doubts about the race were primarily due to the ongoing general elections in the country.\nVR46 rider Marco Bezzecchi won the inaugural Indian Grand Prix last year on a 2022-spec Ducati.", "keywords": ["2024", "kazakhstan", "promoter", "event", "prix", "fairstreet", "india", "second", "motogp", "date", "cancels", "statement", "eyes", "motorsportcom", "2025", "race"], "url": "https://www.motorsport.com/motogp/news/india-motogp-promoter-cancels-this-years-race-eyes-march-2025-date/10616977/", "imgURL": "https://cdn-8.motorsport.com/images/amp/YMdaMaL2/s6/marco-bezzecchi-vr46-racing-te.jpg"}, {"news_number": 11, "title": "Deepika Padukone, Shah Rukh Khan Top IMDb Indian Stars List", "summary": "BOLLYWOOD STARS SHINE BRIGHTLYDeepika Padukone, who made her Bollywood debut with “Om Shanti Om” (2007), has topped IMDb’s list of the top 100 most viewed Indian stars of the last decade.\nShah Rukh Khan, her co-star in that and several other films, is in second place.\nThe list is determined by the page views of the 250 million monthly visitors to IMDb worldwide.\nFADE OUTDemi Moore-, Margaret Qualley- and Dennis Quaid-starring “The Substance” has been set as the closing night film of the upcoming Sydney Film Festival (June 5-16).\nSLASHER SCREENINGThe Edinburgh International Film Festival has revealed a pre-festival, preview midnight screening of Chris Nash’s slasher, “In a Violent Nature,” which had debuted at Sundance, on July 11.", "keywords": ["imdb", "deepika", "shah", "festival", "bollywood", "indian", "audiences", "film", "list", "rukh", "padukone", "screening", "place", "stars", "khan", "disneyland"], "url": "https://variety.com/2024/film/news/deepika-padukone-shah-rukh-khan-imdb-indian-stars-list-1236018332/", "imgURL": "https://variety.com/wp-content/uploads/2024/05/Deepika-Padukone-Shah-Rukh-Khan.jpg?w=1000&h=563&crop=1"}, {"news_number": 12, "title": "U.S. created Indian boarding schools to destroy cultures and seize land", "summary": "European settlers waged war against Native Americans for centuries, decimating tribes through violence and spreading disease.\nMaps showing loss of Native American land from 1819 to 1879.\nNative American land Reservation land Land ceded to the U.S. Unceded land 1819 1839 1859 1879 Source: Invasion of America Native American land Reservation land Unceded land Land ceded to the U.S. 1819 1839 1859 1879 Source: Invasion of AmericaGeorge Washington believed that forcing Native Americans to assimilate to White culture would reduce bloodshed and expand the new country’s territory.\nPresident Thomas Jefferson's confidential message to Congress concerning relations with Native Americans.\n(National Archives)Jefferson also wanted to force Native Americans into debt so they would sell their land.", "keywords": ["america", "american", "schools", "united", "created", "indian", "1819", "seize", "native", "unceded", "wrote", "cultures", "boarding", "americans", "destroy", "way", "land"], "url": "https://www.washingtonpost.com/investigations/interactive/2024/american-indian-boarding-schools-history-legacy/", "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RWVECJMCWRHXBB5RZFCXRJR2RU.jpg&w=1200"}, {"news_number": 13, "title": "Delhi heat wave: Indian capital breaks all-time heat record, as authorities impose water rationing", "summary": "New Delhi CNN —India’s capital territory of Delhi sweltered to its highest-ever temperature of 49.9 degrees Celsius (121.8 degrees Fahrenheit) on Tuesday, as an oppressive heat wave forced authorities to impose water rationing.\nThe Indian Meteorological Department (IMD) said the new record was measured in the suburb of Mungeshpur, surpassing Delhi’s previous high of 49.2 degrees Celsius (120.5 degrees Fahrenheit), observed in May 2022.\nThe temperature in the city of Churu in the state of Rajasthan soared to 50.5 degrees Celsius (122.9 degrees Fahrenheit).\nSirsa, a city in the state of Haryana, saw thermometers reach 50.3 degrees Celsius (122.5 degrees Fahrenheit), Indian authorities said.\nA man drinks water at a roadside stall serving free drinking water to commuters in New Delhi on May 22.", "keywords": ["capital", "rationing", "indian", "delhi", "impose", "fahrenheit", "record", "water", "india", "degrees", "breaks", "singh", "wave", "heat", "state", "celsius", "temperature"], "url": "https://www.cnn.com/2024/05/29/weather/india-heat-record-water-rationing-intl/index.html", "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2154585630.jpg?c=16x9&q=w_800,c_fill"}, {"news_number": 14, "title": "Amid India Coach Rumours, Gautam Gambhir Breaks Silence On \"Next Mission\", It Has Enough Hint That He'll...", "summary": "Will Gautam Gambhir be the Rahul Dravid's successor in the Indian Cricket team as head coach?\nThat perhaps, is the biggest question in Indian cricket currently.\nSo I think, the next mission is that, if we can make KKR the most successful team in the IPL.\nBut the journey abhi shuru hui hai (the journey has just started),\" Gautam Gambhir said on Sportskeeda.\nThe official deadline for application submission for the post of Indian cricket team coach selection is over.", "keywords": ["silence", "dravids", "rumours", "indian", "bcci", "coach", "team", "hell", "india", "ipl", "kkr", "hint", "cricket", "gautam", "breaks", "successor", "gambhir", "mission"], "url": "https://sports.ndtv.com/ipl-2024/gautam-gambhir-wont-become-india-coach-and-continue-with-kkr-star-says-next-mission-5772757", "imgURL": "https://c.ndtvimg.com/2024-05/82jsloa_shah-rukh-khan-gautam-gambhir_625x300_27_May_24.jpeg?im=FitAndFill,algorithm=dnn,width=1200,height=675"}, {"news_number": 15, "title": "India's Modi taps power of cricket on campaign trail", "summary": "SEOUL -- When India's mighty cricket squad lost to Australia at the World Cup final in November, Prime Minister Narendra Modi took the unusual step of consoling shocked players in the dressing room of a massive stadium named after himself.\nSince then, Modi has invoked India's most popular sport on the campaign trail, and some saw last year's global sporting showpiece as the start of his re-election bid in national polls set to wrap up next week.", "keywords": ["campaign", "week", "start", "trail", "unusual", "modi", "step", "wrap", "world", "cricket", "taps", "power", "indias", "took"], "url": "https://asia.nikkei.com/Politics/India-elections/India-s-Modi-taps-power-of-cricket-on-campaign-trail", "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F0%2F3%2F6%2F1%2F47751630-4-eng-GB%2FCropped-1716948909AP23323399845441.jpg?width=1260&height=630&fit=cover&gravity=faces&source=nar-cms"}, {"news_number": 16, "title": "Record breaking heatwave hits Delhi as India swelters – in pictures", "summary": "Temperatures in Delhi have soared to record highs of 49.9C (121.8F) as authorities warn of water shortages.\nThe India Meteorological Department (IMD), which reported “severe heatwave conditions”, recorded the temperatures on Tuesday, saying they were nine degrees higher than expected", "keywords": ["hits", "swelters", "warn", "delhi", "severe", "shortages", "record", "water", "reported", "india", "recorded", "pictures", "heatwave", "breaking", "soared", "saying", "temperatures"], "url": "https://www.theguardian.com/world/gallery/2024/may/29/india-heatwave-weather-delhi-record-temperatures-photos-pictures", "imgURL": "https://i.guim.co.uk/img/media/df4a28374a28ac1ebeaa3ed06ef7501da2010c24/0_15_3289_1974/master/3289.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=264f27f3928165341874f8b44dd5c39f"}, {"news_number": 17, "title": "The enormous stakes of India’s election", "summary": "The 2024 Indian election is the largest in world history: Nearly 1 billion people are eligible to cast their ballots.\nYet India’s nonpartisan Election Commission has somehow managed to run consistently well-regarded contests for decades.\nInstead, they’re voting for the local members of his Bharatiya Janata Party (BJP) or its many rivals.\nThere’s every indication Modi’s crackdown on both democracy and minority rights will continue if the BJP triumphs in this election.\nThere’s a lot going on in the Indian election.", "keywords": ["enormous", "indian", "modi", "democracy", "party", "majority", "election", "modis", "prime", "indias", "stakes", "bjp"], "url": "https://www.vox.com/world-politics/351497/india-election-2024-explainer-narendra-modi-bjp", "imgURL": "https://platform.vox.com/wp-content/uploads/sites/2/2024/05/gettyimages-2153591529.jpg?quality=90&strip=all&crop=0,10.776130549589,100,78.447738900822"}, {"news_number": 18, "title": "Cyclone Remal Tears Through India and Bangladesh, Killing at Least 23", "summary": "At least 23 people were killed and millions were left without power after Cyclone Remal, the first tropical storm of the season, hit Bangladesh and neighboring eastern India on Sunday.\nRemal, which had measured winds of over 70 miles per hour, left a trail of destruction, uprooting trees and damaging power lines throughout the region, officials said.\nThe storm killed 13 people in Bangladesh, and it damaged or destroyed more than 35,000 homes across the coastal areas, affecting about 3.5 million people, according to officials.\nMore than 13 million people there lost electricity on Monday evening, according to power ministry officials.\nThe storm also caused power outages and damaged homes in the Indian state of West Bengal.", "keywords": ["officials", "indian", "homes", "million", "india", "tears", "remal", "bangladesh", "23", "killing", "killed", "cyclone", "power", "storm", "state", "left"], "url": "https://www.nytimes.com/2024/05/28/world/asia/cyclone-remal-bangladesh-india.html", "imgURL": "https://static01.nyt.com/images/2024/05/28/multimedia/28bangladesh-cyclone-gzfl/28bangladesh-cyclone-gzfl-facebookJumbo.jpg"}, {"news_number": 19, "title": "New York increases security ahead of India vs Pakistan T20 World Cup match", "summary": "Security cover will be raised at the Eisenhower Park stadium in New York following reports of threats to the India vs Pakistan match on June 9 in T20 World Cup 2024 .\nA statement released by the governor's office said they are monitoring the situation and according to their intel \"there is no credible public safety threat at this time.\"\n\"I have also directed the New York State Police to engage in elevated security measures, including an increased law enforcement presence, advanced surveillance, and thorough screening processes,\" she said.\n\"Public safety is my top priority and we are committed to ensuring the Cricket World Cup is a safe, enjoyable experience.\"\nAn ICC spokesperson said: \"The safety and security of everyone at the event is our number one priority and we have a comprehensive and robust security plan in place.", "keywords": ["safety", "including", "vs", "pakistan", "world", "t20", "india", "authorities", "threat", "york", "robust", "increases", "cup", "stadium", "match", "state", "security"], "url": "https://www.espncricinfo.com/story/new-york-increases-security-ahead-of-india-pakistan-t20-world-cup-match-1435767", "imgURL": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/369000/369009.6.jpg"}, {"news_number": 20, "title": "Delhi temperature hits 50.5C as India’s capital records hottest day", "summary": "Temperatures in Delhi have hit a record high of 50.5C (122.9F), as authorities warned of water shortages in India’s capital.\nThe temperature was more than nine degrees higher than expected, the IMD said, and came on the second day of record-breaking heat.\nProtesting Indian farmers endure severe heatwave – videoThe IMD warned of the heat’s impact on health, especially for children, elderly people and those with chronic diseases.\nWork is work.\nRajasthan’s desert region of Phalodi holds the country’s all-time heat record, hitting 51C in 2016.", "keywords": ["hits", "day", "capital", "505c", "work", "delhi", "temperatures", "record", "water", "india", "warned", "working", "heat", "hottest", "records", "indias", "imd", "temperature"], "url": "https://www.theguardian.com/world/article/2024/may/29/delhi-temperature-hits-499c-as-indias-capital-records-hottest-day", "imgURL": "https://i.guim.co.uk/img/media/0fc7c896a4c480035381ed594623d43c58e26260/0_105_2229_1337/master/2229.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1f9e0decf696fa54636c262491ee80db"}, {"news_number": 21, "title": "Prajwal Revanna: Absconding MP says will return to India to face sex abuse cases", "summary": "Prajwal Revanna, an MP from Hassan district in Karnataka who is seeking re-election, had left India on 27 April using his diplomatic passport after the videos went viral.\nPrajwal Revanna's father HD Revanna and uncle HD Kumaraswamy are both influential legislators in the Karnataka state assembly.\nThey contained 2,960 clips, which reports say were shot by Mr Revanna himself, and showed the faces of the women.\nMr Revanna did not address any of these direct allegations in his video.\nA state minister accused the BJP of fielding Mr Revanna for the election despite knowing that \"hundreds of women had been abused by the candidate\".", "keywords": ["revanna", "cases", "month", "mr", "mp", "face", "videos", "party", "return", "india", "minister", "revannas", "absconding", "political", "sex", "abuse", "prajwal", "state"], "url": "https://www.bbc.com/news/articles/cx99gkpwgq8o", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/0d8d/live/900f90a0-1ccc-11ef-94e3-d78ab9e658c9.jpg"}, {"news_number": 22, "title": "National Spelling Bee reflects the economic success and cultural impact of immigrants from India", "summary": "Of the 34 since, 28 have been Indian American, including three straight years of Indian American co-champions and one year (2019) when eight champions were declared, seven of Indian ancestry.\nThe experiences of first-generation Indian Americans and their spelling bee champion children illustrate the economic success and cultural impact of the nation’s second-largest immigrant group.\nFILE - Ishika Varipilli, 11, from Spring, Texas, waits on stage during the Scripps National Spelling Bee, Wednesday, June 1, 2022, in Oxon Hill, Md.\nSince 1999, 28 of the last 34 Scripps National Spelling bee champions have been Indian American.\nThe experiences of first-generation Indian Americans and their spelling bee champion children illustrate the economic success and cultural impact of the nation’s second-largest immigrant group.", "keywords": ["success", "spelling", "american", "cultural", "indian", "impact", "bee", "india", "champion", "scripps", "parents", "national", "economic", "immigrants", "children", "reflects"], "url": "https://apnews.com/article/spelling-bee-indian-americans-immigration-b14ba87533dfcd8af813de568ee5958f", "imgURL": "https://dims.apnews.com/dims4/default/af496b2/2147483647/strip/true/crop/2857x1607+0+149/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2Fbd%2Ff36035f92a2b3de05ae58bca761b%2F9d47672141b34313bf9643a059fa19c8"}, {"news_number": 23, "title": "Cyclone Remal: At least 16 killed in Bangladesh and India", "summary": "At least 16 dead as cyclone hits Bangladesh and India2 days ago Hafsa Khalil , BBC News ShareKM Asad/Getty ImagesAt least 16 people have died after a cyclone crashed into coastal parts of India and southern Bangladesh.\nNearly a million people were evacuated as Cyclone Remal made landfall on Sunday evening.\nAhead of Cyclone Remal, nearly three million people in Bangladesh saw their electricity shut off to avoid accidents, ministry officials said.\nSave the Children said it had sent four emergency response teams to the country's affected areas, including a medical team, to support recovery.\nThe charity's country director Shumon Sengupta said the cyclone \"shows yet again how vulnerable Bangladesh is to extreme weather events\".", "keywords": ["areas", "including", "16", "west", "told", "million", "bangladesh", "remal", "india", "killed", "cyclone", "nearly"], "url": "https://www.bbc.com/news/articles/ckvv8q10vxvo", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/24d9/live/4f1867f0-1c47-11ef-ac61-e7bb0ab72f9c.jpg"}, {"news_number": 24, "title": "Uttar Pradesh: The state holding the key to India PM Modi's re-election", "summary": "The Indian state holding the key to PM Modi's re-election22 hours ago Geeta Pandey , BBC News ShareAnkit Srinivas A group of women in Uttar Pradesh, India's most politically crucial state with 80 parliament seatsAs India votes to elect a new government, all eyes are on the northern state of Uttar Pradesh, commonly known by its initials UP.\nSpread over an area roughly the size of Britain, the state packs in nearly four times as many people.\nThe state is among just three in India which are voting in all seven phases in the elections which are spread over 44 days.\nHe’s set his Bharatiya Janata Party (BJP) a goal of 370 seats - a party needs 272 to win.\nIn 2014, BJP won 71 seats in the state and in 2019, it got 62.", "keywords": ["mr", "modi", "uttar", "party", "reelection", "key", "india", "seats", "city", "holding", "modis", "pradesh", "indias", "state", "bjp"], "url": "https://www.bbc.com/news/articles/cqee449yl5lo", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/770b/live/10b1e040-1cf6-11ef-a13a-0b8c563da930.jpg"}, {"news_number": 25, "title": "At least 27 reportedly dead in fire at amusement arcade in Guajarat, India", "summary": "India games arcade fire kills 27, officials sayWatch: The gaming arcade in Rajkot was engulfed in a \"massive fire\"At least 27 people have died in a “massive fire” at a games arcade in India, local officials say.\nFlames and a huge pall of smoke could be seen rising into the sky at the building in Rajkot, in the western state of Gujarat.\n\"The bodies are charred beyond recognition and hence their identification will be difficult,\" senior police officer Radhika Bharai told reporters after providing the updated death toll.\nEarlier, Rajkot Police Commissioner Raju Bhargava told BBC Gujarati 24 people had died.\nThe blaze broke out on Saturday afternoon when the arcade was packed with children and young people.", "keywords": ["games", "arcade", "victims", "amusement", "27", "rajkot", "guajarat", "reportedly", "told", "officials", "massive", "india", "died", "minister", "dead"], "url": "https://www.bbc.com/news/articles/cneemmm3njyo", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/e73e/live/0767de80-1ac2-11ef-baa7-25d483663b8e.jpg"}, {"news_number": 26, "title": "Payal Kapadia: India celebrates historic win at Cannes Film Festival", "summary": "CNN —Filmmaker Payal Kapadia made history Saturday, as she became the first person from India to clinch the prestigious Grand Prix at the 77th Cannes Film Festival, the second highest prize after the Palme d’Or.\nIt is the first Indian movie in three decades to compete in Cannes’ main competition.\n“Please don’t wait another 30 years to have an Indian film,” she said to the audience.\n“Indian stars shining bright… These women have scripted history, and inspired the entire Indian film fraternity,” he wrote on the platform.\nIn 1947, filmmaker Chetan Anand took Cannes’ top prize for his film “Neecha Nagar,” becoming the only Indian to win the accolade.", "keywords": ["payal", "festival", "indian", "cannes", "country", "india", "prize", "film", "kapadia", "win", "celebrates", "historic", "festivals", "light", "main"], "url": "https://www.cnn.com/2024/05/27/style/payal-kapadia-india-cannes-grand-prix-intl-hnk/index.html", "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2154660758.jpg?c=16x9&q=w_800,c_fill"}, {"news_number": 27, "title": "Who is Dhruv Rathee? From Modi fan to Indian PM’s most formidable critic", "summary": "Consider the numbers: On YouTube, Rathee has more than 20 million subscribers, nearly four times the BJP channel’s count.\nThe Congress, the principal opposition party, has a little more than 5 million YouTube subscribers, while its biggest leader, Rahul Gandhi, has 6 million.\nBack then, to Rathee, Modi symbolised hope.\nA lighter sideThat approach is complemented by the other YouTube channel that Rathee runs: Dhruv Rathee Vlogs.\nAs with his political videos, Rathee speaks to his viewers in Hindi.", "keywords": ["formidable", "critic", "videos", "modi", "indian", "fan", "video", "million", "india", "rathees", "political", "dhruv", "channel", "youtube", "pms", "rathee"], "url": "https://www.aljazeera.com/features/2024/5/29/who-is-dhruv-rathee-from-modi-fan-to-indian-pms-most-formidable-critic", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/Screenshot-2024-05-29-at-8.22.35 AM-1-1716960841.jpg?resize=1200%2C630"}, {"news_number": 28, "title": "Lok Sabha elections: LGBTQ Indians are more accepted than ever - but politics hasn't caught up", "summary": "Lok Sabha elections: LGBTQ Indians are more accepted than ever - but politics hasn't caught up3 days ago By Zoya Mateen , BBC News, Delhi ShareGetty Images Despite progress, LGBTQ Indians have not found meaningful political representationMadhu Bai says she is like a rainbow.\nShe dances and sings with other hijras, or trans women, at weddings and birth ceremonies - a common livelihood in India's transgender community.\nMadhu's short but successful political foray in India is a rarity in a field where the LGBTQ community is still heavily underrepresented.\nDespite this, Mr Gawande insists that LGBTQ rights are a current that Indian politics can no longer dismiss.\nBut she hopes others from the community seek political opportunities, so that queer people are no longer seen as oddities.", "keywords": ["trans", "politics", "madhu", "community", "indians", "caught", "accepted", "court", "rights", "lok", "political", "transgender", "sabha", "banu", "lgbtq", "elections"], "url": "https://www.bbc.com/news/world-asia-india-68933715", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/6B97/production/_133334572_6.png"}, {"news_number": 29, "title": "More than 50 killed by Cyclone Remal in India and Bangladesh", "summary": "CNN —More than 50 people have died in India and Bangladesh after Tropical Cyclone Remal lashed the area with torrential rain and heavy winds, according to local officials.\nMore than 1 million people in India and Bangladesh were evacuated Sunday as the cyclone made landfall near the border between the two countries.\nCyclone Remal made landfall in Bangladesh on May 26, 2024.\nAbout 2 million people live in storm-affected areas in Bangladesh, according to non-profit BRAC.\nLocals stand near the sea as Cyclone Remal made landfall in Bangladesh on May 26, 2024.", "keywords": ["according", "indian", "west", "50", "landfall", "bangladesh", "remal", "india", "bengal", "killed", "cyclone", "rain"], "url": "https://www.cnn.com/2024/05/26/india/cyclone-remal-india-bangladesh-landfall-intl-hnk/index.html", "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2154230665.jpg?c=16x9&q=w_800,c_fill"}, {"news_number": 30, "title": "Modi’s Middling Economy", "summary": "Another explanation is that Modi has managed the economy well, with India recently overtaking the United Kingdom to become the fifth-largest economy in the world, and soon surpassing stagnant Germany and Japan to become the third largest.\nThe government’s 2016 ban on high-value currency notes hurt small and midsized businesses, which were further damaged by Modi’s mismanagement of the pandemic.\nIn the ongoing election, the opposition has strived to highlight Indians’ economic anxiety.\nAn economy led by services exports would follow a very different path from the manufacturing-led-exports path the government desires.\nThere are multiple reasons for Modi’s high ratings among those who are not simply attracted by his Hindutva agenda.", "keywords": ["economy", "modi", "indian", "jobs", "world", "india", "indians", "services", "economic", "modis", "middling", "prime", "indias"], "url": "https://www.foreignaffairs.com/india/modis-middling-economy", "imgURL": "https://cdn-live.foreignaffairs.com/sites/default/files/styles/social_share/public/images/2024/05/27/2024-01-31T120456Z_1211970507_RC2XS5A2FM45_RTRMADP_3_INDIA-BUDGET_e.jpg?itok=xRKf5po3"}, {"news_number": 31, "title": "Why MS Dhoni Is Not Eligible To Apply For India Head Coach Job - Explained", "summary": "The race is on for India's new men's cricket head coach.\nHowever, one popular name, MS Dhoni, is not eligible to become the coach, once Rahul Dravid steps down after the 2024 ICC T20 World Cup.\nDespite retiring from international cricket in 2020, Dhoni is still playing in the IPL for the Chennai Super Kings, and therefore, cannot be elected as the head coach.\nIt is important to remember that he mentored the Indian team during the 2021 T20 World Cup, held in the UAE.\nThe applications for India's head coach position ended on Monday.", "keywords": ["head", "explained", "indian", "coach", "apply", "team", "eligible", "india", "world", "t20", "dhoni", "ms", "potential", "job", "indias", "applications"], "url": "https://sports.ndtv.com/cricket/as-bccis-hunt-is-on-ms-dhoni-eligible-to-be-indias-new-coach-no-this-is-the-reason-5764534", "imgURL": "https://c.ndtvimg.com/2019-09/con6mlfs_ms-dhoni-india-afp_625x300_17_September_19.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675"}, {"news_number": 32, "title": "Hardik Pandya joins Team India in New York, starts training on ‘national duty’ for T20 World Cup", "summary": "Flamboyant India all-rounder Hardik Pandya has reached the USA and he straightaway started training with the Indian team.\nHardik Pandya has started training with other Indian players ahead of T20 World Cup.\n(X-Image/@hardikpandya7)Team India has started the preparations for the mega ICC event and focused on bringing the trophy back home.\nPandya was booed by the fans on several venues and faced heat on social media too.\nIndia will start their T20 World Cup campaign on June 5 against Ireland at the newly constructed Nassau County International Cricket Stadium in New York.", "keywords": ["started", "rohit", "team", "training", "joins", "world", "t20", "starts", "india", "ipl", "york", "pandya", "national", "social", "season", "media"], "url": "https://www.hindustantimes.com/cricket/hardik-pandya-joins-team-india-in-new-york-starts-training-on-national-duty-for-t20-world-cup-101716952535413.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/Hardik_Pandya_training_1716954241791_1716954247986.jpg"}, {"news_number": 33, "title": "‘Kalki 2898 AD’: Inside The Prabhas-Starring Sci-Fi Epic That Is One Of India’s Most Expensive Movies Of All Time", "summary": "EXCLUSIVE: “I’m not so good at this part, you know,” Indian megastar Prabhas tells Deadline on the set of upcoming mythological sci-fi movie Kalki 2898 AD.\nReleasing on June 27 after multiple delays, director Nag Ashwin’s Kalki 2898 AD is a sci-fi infused retelling of the Hindu myth of Kalki and the Kali Yuga, the end of the current world age.\nThis is an achievement beyond anything’.”While India’s international film footprint is primarily associated with Hindi-speaking Bollywood, Kalki 2898 AD is shot primarily in Telugu and will release simultaneously in five languages.\n“I hope people will feel really strange when they leave the theater after watching Kalki 2898 AD, and will say, ‘Where am I?\nAshwin is not concerned, stating that Kalki 2898 AD does not involve any characters actively worshipped by large numbers of Hindus.", "keywords": ["2898", "scifi", "prabhas", "movie", "prabhasstarring", "indian", "fans", "feel", "film", "epic", "inside", "movies", "expensive", "indias", "seen", "kalki", "ad"], "url": "https://deadline.com/2024/05/kalki-2898-ad-exploring-nag-ashwin-prabhas-amitabh-bachchan-deepika-padukone-movie-1235942384/", "imgURL": "https://deadline.com/wp-content/uploads/2024/05/IMG_2038-e1716914502162.jpeg?w=1024"}, {"news_number": 34, "title": "Indian PM Modi’s latest campaign message to supporters: ‘God has sent me’", "summary": "CNN —India’s Prime Minister Narendra Modi has a new message for supporters on the campaign trail: God has chosen him.\n“This is why I have dedicated myself to God.”Modi continued: “God doesn’t reveal his cards.\nThis, he added has “rallied his base who feel pride in such religiosity.”India is a deeply religious country.\n“(He is) the first prime minister, they say, to be unashamed about this faith,” Sinha said.\nIt ignited widespread anger among Muslim leaders and opposition politicians and calls for election authorities to investigate.", "keywords": ["god", "supporters", "indian", "modi", "country", "indias", "modis", "minister", "ram", "hindu", "election", "latest", "campaign", "prime", "sent", "bjp", "message"], "url": "https://www.cnn.com/2024/05/28/india/india-narendra-modi-chosen-by-god-intl-hnk/index.html", "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/2024-04-21t171632z-74092274-mt1asnews20240421229l-rtrmadp-3-ani.jpg?c=16x9&q=w_800,c_fill"}, {"news_number": 35, "title": "\"Force Multiplier\": India Successfully Tests Anti-Radiation Missile 'Rudram-II'", "summary": "India successfully test-fired an air-surface anti-radiation missile from a Su-30MKI fighter jet.\nThe Rudram-II anti-radiation supersonic missile is developed by the Defence Research and Development Organisation (DRDO).\nAn indigenously developed solid-propelled air-launched missile system, Rudram-II is one of the finest and meant to neutralise many types of enemy assets.\nThe @DRDO_India has successfully flight tested the RudraM-II Air-to-Surface missile from Su-30 MK-I platform of Indian Air Force (IAF), off the coast of Odisha.\nIn 2022, the Indian Air Force proposed the acquisition of the Next Generation Anti-Radiation Missile (NGARM) in a Rs 1,400 crore deal.", "keywords": ["tested", "multiplier", "version", "range", "antiradiation", "successfully", "tests", "enemy", "india", "missile", "force", "flight", "system", "test", "rudramii"], "url": "https://www.ndtv.com/india-news/force-multiplier-india-successfully-tests-anti-radiation-missile-rudram-ii-5772442", "imgURL": "https://c.ndtvimg.com/2024-05/434hutl8_rudramii-missile_625x300_29_May_24.jpeg?ver-20240506.08"}, {"news_number": 36, "title": "India heat wave: Delhi posts national record temperature – DW – 05", "summary": "A new Indian heat record was recorded on Wednesday as temperatures in the capital, Delhi, passed 52 degrees Celsius.\nA prolonged heatwave in northern India and Pakistan has caused water shortages and heat strokes.\nTemperatures in India's capital city Delhi soared to 52.3 degrees Celsius (126.1 Fahrenheit) on Wednesday, setting a new national record amid an ongoing heatwave.\nThe India Meteorological Department (IMD) warned of \"severe heat-wave conditions\" after recording the record temperature in the Delhi suburb of Mungeshpur on Wednesday afternoon.\nPeople across northern India have been struggling with unrelenting heat which has forced schools to close down in some cities and towns.", "keywords": ["web", "dw", "view", "delhi", "video", "record", "water", "india", "degrees", "national", "wave", "heat", "05", "heatwave", "posts", "temperature"], "url": "https://www.dw.com/en/india-heat-wave-delhi-posts-national-record-temperature/a-69210847", "imgURL": "https://static.dw.com/image/69210979_6.jpg"}, {"news_number": 37, "title": "India sweats as highest temperature recorded in Delhi's Mugeshpur: Here are today's top 10 hottest places", "summary": "It seems like you're already an ETPrime member withLogin using your ET Prime credentials to enjoy all member benefitsLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.", "keywords": ["mugeshpur", "enjoy", "et", "log", "using", "delhis", "temperature", "places", "india", "loggedin", "credentials", "withlogin", "youre", "recorded", "sweats", "member", "highest", "hottest", "prime", "todays"], "url": "https://m.economictimes.com/news/india/india-sweats-as-highest-temperature-recorded-in-delhis-mugeshpur-here-are-todays-top-10-hottest-places/articleshow/110539663.cms", "imgURL": "https://img.etimg.com/thumb/msid-110539740,width-1200,height-630,imgsize-36292,overlay-economictimes/photo.jpg"}, {"news_number": 38, "title": "India bids to host D Gukesh vs Ding Liren World Chess Championship match", "summary": "However, the deadline for submitting bids is May 31, and Singapore is expected to enter the race, although they have not yet officially submitted their bid documents.\nThe tournament will span 25 days, and the regulations will be finalized by July 1.\nFIDE will award a total prize money of around Rs 20 crore, an increase from the previous year's prize pool of Rs 17 crore.Gukesh's remarkable achievement at the Candidates Tournament has ignited a renewed interest in chess in India.\nThe young player, who has been guided by the legendary Viswanathan Anand , broke Garry Kasparov 's 40-year-old record by becoming the youngest Candidates champion at the age of 17.\nHowever, in 2013, Anand lost to the Norwegian challenger Magnus Carlsen .", "keywords": ["chess", "gukesh", "fide", "submitted", "vs", "host", "world", "india", "rs", "tournament", "ding", "crore", "hosting", "d", "match", "bid", "liren"], "url": "https://timesofindia.indiatimes.com/sports/chess/india-bids-to-host-d-gukesh-vs-ding-liren-world-chess-championship-match/articleshow/110533435.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110533607,width-1070,height-580,imgsize-53772,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 39, "title": "Is It Really 52.9 Degrees In Delhi? Weather Chief Says Investigating Readings", "summary": "This weather station reported 52.9 degree Celsius today, the highest ever in India.\nHe said the Mungeshpur station is an \"outlier\", and the recording needs to be confirmed.\n\"The maximum temperature over Delhi NCR varied from 45.2 to 49.1 degree Celsius in different parts of the city.\nDelhi's primary weather station Safdarjung observatory recorded a maximum temperature of 46.8 degree Celsius, highest in 79 years.\nOther areas that reported extremely high temperature are both in the desert state Rajasthan - 51 degree Celsius in Phalodi, and 50.8 degree Celsius.", "keywords": ["529", "mungeshpur", "chief", "delhi", "winds", "weather", "degrees", "degree", "recorded", "investigating", "readings", "station", "really", "imd", "celsius", "temperature"], "url": "https://www.ndtv.com/india-news/delhi-hits-52-3-degrees-highest-ever-recorded-temperature-5771382", "imgURL": "https://c.ndtvimg.com/2024-05/kcpn93t8_delhi-heat_625x300_29_May_24.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 40, "title": "Ztech India IPO day 1 Check Subscription status , GMP, key dates and all you need to know", "summary": "Ztech India IPO is most likely to see its listing on the NSE SME by Tuesday, June 4, 2024.\nZtech India IPO subscription statusZtech India IPO had been subscribed 20.48 times by 5 PM as per Chittorgarh.com data.\nZtech India IPO issue Size and other detailsThe ₹37.30 crore Ztech India IPO is a book-built offering where Ztech India is issuing 33.91 lakh new shares .\nMaashitla Securities Private Limited is the IPO registrar, while Narnolia Financial Services Ltd. is the book running lead manager of the Ztech India IPO.\nAlso Read- Beacon Trusteeship IPO booked 32.02 times on day 1; check GMP, subscription status, key dates, moreZtech India IPO objectives of the issueZtech India IPO plan to tilie the proceeds from the IPO toward meeting the Working Capital requirements of the Company.", "keywords": ["day", "share", "subscription", "gmp", "issue", "shares", "status", "know", "ztech", "key", "india", "need", "ipo", "market", "price", "indias", "times"], "url": "https://www.livemint.com/market/stock-market-news/ztech-india-ipo-day-1-check-subscription-status-gmp-key-dates-and-all-you-need-to-know-11716977866826.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/29/1600x900/Ztech_India_IPO_1716792530502_1716978197608.webp"}, {"news_number": 41, "title": "Amazon India vs Canada video of Indian-origin woman goes viral", "summary": "An Indian-origin woman, Selene Khosla, took to social media to share her challenging experience with returning an Amazon parcel in Canada.\nShe captioned the video 'Amazon India vs Canada.\nI mean, people who are even working in the Indian post office don't go to the post office.\n\"Google Maps is pretty much the same here because the first Canada Post location I went to was not even Canada Post.\nAfter the video went viral on the internet, the users jumped into the comment box of Khosla.", "keywords": ["woman", "goes", "indianorigin", "post", "canada", "video", "went", "vs", "return", "india", "amazon", "come", "viral", "parcel", "office"], "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-origin-girl-selena-khosla-canada-amazon-parcel-return-policy-india-video-instagram-2545206-2024-05-29", "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/indian-origin-girl-in-canada-290747172-16x9_0.png?VersionId=gmO2XKpYC0gAJg0dqI5WM7avVPm4q3db"}, {"news_number": 42, "title": "India elections: PM Narendra Modi claims he has been chosen by God", "summary": "Indian prime minister Narendra Modi has said he believes he has been chosen by God, as the multi-stage Indian election nears its completion.\n“I am convinced that ‘Parmatma’ (God) sent me for a purpose.\nModi has built up a well-established cult of personality within his Hindu nationalist Bharatiya Janata Party (BJP), with many supporters unable to name other cabinet members or their local BJP candidate.\nAfter she passed away, upon reflecting on all my experiences, I was convinced that God had sent me,” he said.\nAsked by a TV anchor whether Modi was suffering from a “God complex”, BJP spokesperson Sanju Verma replied by extolling his energy.", "keywords": ["verma", "god", "work", "modi", "chosen", "indian", "claims", "party", "narendra", "india", "purpose", "making", "sent", "bjp", "elections"], "url": "https://www.theguardian.com/world/article/2024/may/27/india-elections-pm-narendra-modi-claims-he-has-been-chosen-by-god", "imgURL": "https://i.guim.co.uk/img/media/98b5c8da20dd796a697503ca08af2486689c5bc5/0_307_5293_3176/master/5293.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6b55e404aac3e4545ee084abd20b22bb"}, {"news_number": 43, "title": "IMD Heatwave Warning : '50.5°C, 50.3°C, 49.9°C...': It's raining fire in north India", "summary": "Delhi on Tuesday recorded its highest ever temperature with mercury reaching 49.9 degrees Celsius.\nTwo women from Delhi and Karnataka, both aged 63, and a 40-year-old man from Agra were undergoing treatment for heatstroke at Sawai Man Singh Hospital in Jaipur.\nJust three locations recorded temperature between 44 and 45°C during peak hours.Scorching heat, cloudless skies and searing winds blowing from Rajasthan sent Tuesday’s day temperature soaring to an all-time high on record in Delhi.\nAt many places in the state, the maximum temperature was between 44 and 47°C.\nThe IMD has issued weather advisory, asking people to remain hydrated and avoid coming out between 11am and 4pm.In Safdarjung, the city’s base observatory, maximum temperature was 45.8 degrees, five degrees above normal, and the highest this year.", "keywords": ["raining", "505c", "503c", "delhi", "maximum", "india", "degrees", "warning", "recorded", "499c", "heatwave", "north", "highest", "heat", "temperatures", "imd", "celsius", "temperature"], "url": "https://timesofindia.indiatimes.com/city/delhi/50-5c-50-3c-49-9c-its-raining-fire-in-north-india/articleshow/110519856.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110520156,width-1070,height-580,imgsize-1504740,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 44, "title": "S&P raises outlook for India to positive, affirms rating at BBB-", "summary": "It seems like you're already an ETPrime member withLogin using your ET Prime credentials to enjoy all member benefitsLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.", "keywords": ["withlogin", "enjoy", "youre", "bbb", "sp", "affirms", "et", "positive", "log", "rating", "india", "using", "loggedin", "outlook", "member", "credentials", "prime", "raises"], "url": "https://m.economictimes.com/news/economy/indicators/sp-revises-outlook-for-india-to-positive-affirms-rating-at-bbb-/articleshow/110528726.cms", "imgURL": "https://img.etimg.com/thumb/msid-110528723,width-1200,height-630,imgsize-29538,overlay-economictimes/photo.jpg"}, {"news_number": 45, "title": "Multibagger stock: Cummins India records over 270% surge in 2 years, gains 1270% from 2020 low", "summary": "Despite fluctuations in the market, the shares of Cummins India, one of the leading power solution providers, have consistently exhibited a robust upward trajectory.\nAlso Read: NBCC shares rise 5%, surge over 233% in last one year; what’s behind the rally?\nAdditionally, the stock is trading 1270% higher compared to its 2020 low of ₹280 per share.\nIt presently operates in three business segments: engines, power systems, and distribution.\nIn the industrial segment, demand is bolstered by the government's ongoing focus on infrastructure development.", "keywords": ["low", "segments", "2020", "read", "gains", "270", "demand", "multibagger", "market", "business", "surge", "india", "rise", "cummins", "stock", "quarter", "segment", "shares", "records"], "url": "https://www.livemint.com/market/stock-market-news/multibagger-stock-cummins-india-share-price-records-over-270-surge-in-2-years-gains-1270-from-2020-low-11716981189414.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/29/1600x900/gf95cd2fc2cf3b9572d4035f0697f27168f88ec86ed2babecb_1712294766794_1716981535808.jpg"}, {"news_number": 46, "title": "Riyan Parag: 'I'm going to play for India, I don't really care when'", "summary": "Parag, after enjoying a breakout IPL season, said his statement exuded belief in himself and not arroganceRiyan Parag is confident of representing India at some point in the future.\nSo that is my belief, I'm going to play for India,\" Parag was quoted as saying by PTI.\n[Even] when I was not scoring runs - I said this in an [earlier] interview as well that I am going to play for India.\nI don't really put my thought behind when I should play,\" Parag said.\nParag on RR's loss in the Eliminator\"What you saw this year in the IPL is how I play domestic cricket,\" Parag said.", "keywords": ["im", "care", "dont", "going", "tour", "india", "ipl", "point", "riyan", "runs", "parag", "really", "play", "season"], "url": "https://www.espncricinfo.com/story/riyan-parag-i-am-going-to-play-for-india-i-dont-really-care-when-1435763", "imgURL": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/378400/378460.6.jpg"}, {"news_number": 47, "title": "India: New Delhi heatwave declared 'severe' as record-breaking temperatures cause children to faint", "summary": "India's capital New Delhi has endured sweltering conditions in a record-breaking heatwave, which has seen temperatures reach as high as 52.3C (126.1F).\nThe heatwave has now been classed as \"severe\" - meaning temperatures are at least 6.5C above average.\nImage: A man rides his cycle in New Delhi, where temperatures have hit 52.3C.\nIndia and other parts of South Asia - and South East Asia - have been grappling with heatwaves since last month.\nAccording to weather officials, however, temperatures are likely to ease from Thursday over northwest and central India.", "keywords": ["sky", "declared", "severe", "delhi", "pic", "water", "weather", "india", "cause", "indias", "recordbreaking", "heatwave", "children", "heat", "temperatures", "south", "faint"], "url": "https://news.sky.com/story/india-new-delhi-heatwave-declared-severe-as-record-breaking-temperatures-cause-children-to-faint-13144993", "imgURL": "https://e3.365dm.com/24/05/1600x900/skynews-drinks-heatwave_6568675.jpg?20240529125812"}, {"news_number": 48, "title": "A chicken recipe so good its origin is being fought in court", "summary": "A chicken recipe so good its origin is being fought in court1 day ago By Tamara Hinson ShareGetty Images Butter chicken is one of the most popular curries around the world (Credit: Getty Images)A dish beloved around the world, butter chicken is now at the heart of a legal battle being waged by two of India's oldest restaurants.\nTo add insult to injury, its tagline included the words \"by the inventors of Butter Chicken\".\nWhose grandfather prepared that first portion of butter chicken is almost certainly impossible to prove, although Bagga believes it was probably a collaboration.\n\"Their case is about someone saying their grandfather invented butter chicken, but who knows which partner invented it?\"\nSure, some people might come because of the story, but they won't return if the butter chicken isn't good.\"", "keywords": ["moti", "gravy", "jaggi", "recipe", "delhi", "good", "fought", "chicken", "origin", "dish", "daryaganj", "butter", "restaurant", "court", "mahal"], "url": "https://www.bbc.com/travel/article/20240528-a-chicken-recipe-so-good-its-origin-is-being-fought-in-court", "imgURL": "https://ychef.files.bbci.co.uk/624x351/p0j0090y.jpg"}, {"news_number": 49, "title": "Ukraine war keeps Air India on top of non-stop routes to US; can the Tata Group airline maintain pole position?", "summary": "The Tata Group took control of Air India in the last days of January 2022.\nAir India operated 33 non-stop flights per week to the US pre-COVID.\nOn the other side of COVID, Air India now operates 51 weekly non-stops to the United States.\nInterestingly, of all its routes to the US, Air India launched the ones to San Francisco the last, but today it has maximum capacity out of San Francisco.\nWill it proceed as planned and help Air India deploy the refurbished planes to the United States?", "keywords": ["war", "american", "united", "francisco", "weekly", "position", "keeps", "tata", "india", "states", "ukraine", "maintain", "san", "nonstop", "air", "routes", "pole"], "url": "https://www.livemint.com/companies/ukraine-war-air-india-non-stop-routes-to-us-american-delta-united-aviation-tata-group-b777s-11716799274426.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/27/1600x900/Air_india_1700183184005_1716800654296.JPG"}, {"news_number": 50, "title": "Temperature in North India remains high; drizzle in some parts", "summary": "(HT Photo/Sunil Ghosh)The maximum temperature recorded in Rajasthan on Wednesday was at 48.2 degrees Celsius in Pilani district, followed by 47.7 degrees Celsius in Churu, which had recorded 50.5 degrees Celsius on Tuesday, followed by 47.5 degrees Celsius in Alwar.\nChuru’s all-time highest recorded maximum temperature was 50.8 degrees Celsius in June 2019.\nThe India Meteorological Department (IMD) said that in most places in Rajasthan, the maximum temperature was one to three degrees less than the maximum temperature on Tuesday.\nJhansi, which recorded the highest temperature (49 degrees Celsius) in 132 years on Tuesday, recorded 47.5 degrees Celsius on Wednesday.\nSrinagar recorded 27.5 degree Celsius while Qazigund, the gateway to Kashmir, witnessed 28.6 degree Celsius.", "keywords": ["parts", "high", "remains", "maximum", "record", "india", "degrees", "recorded", "degree", "north", "highest", "temperatures", "drizzle", "imd", "celsius", "temperature"], "url": "https://www.hindustantimes.com/india-news/temperature-in-north-india-remains-high-drizzle-in-some-parts-101716993828511.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/Children-taking-bath-in-water-fountain-in-scorchin_1716993780534.jpg"}, {"news_number": 51, "title": "How women party workers are reshaping Indian politics", "summary": "This sentiment, highlighting the unique advantage women party workers have in reaching women voters, is one I have heard countless times in conversations with women workers from various political parties.\nThe rise of grassroots women party workers, or “party women” is driving this new era of women voter-party linkages.\nMotorbike rallies organised by women party workers — one of the few women party events that make media headlines — exemplify how women claim credit and secure party tickets in the run-up to elections.\nHow does grassroots organising by ordinary women party workers explain the gender shift in India’s politics?\nBeyond elections, women party workers organise countless events, ranging from planting drives to dharnas and seva abhiyans, mobilising women from a range of social groups such as Self-Help Groups (SHGs) and Anganwadi workers for party activities, and keeping them engaged in politics between election cycles.", "keywords": ["politics", "indian", "women", "parties", "party", "offers", "turnout", "reshaping", "workers", "political", "voters", "bjp", "womens"], "url": "https://indianexpress.com/article/opinion/columns/how-women-party-workers-are-reshaping-indian-politics-9357869/", "imgURL": "https://images.indianexpress.com/2024/05/Opinion1_29th-May.jpg"}, {"news_number": 52, "title": "India successfully test-fires RudraM-II air-to-ground missile", "summary": "NEW DELHI: India successfully flight-tested the indigenous RudraM-II air-to-ground missile , which is designed to have a strike range of almost 350-km, from a Sukhoi-30MKI fighter of the IAF off the coast of Odisha on Wednesday.The RudraM series are being developed by the DRDO as new-generation anti-radiation missiles (NGARMs) for destroying a variety of enemy surveillance, communication, radars, and command and control centers on the ground.The 150-km range RudraM-I missile, with INS-GPS navigation with a passive homing head for the final attack, was first tested in Oct 2020, while a 550-km RudraM-III is also under-development.\nThe missiles are meant for suppression of enemy air defences (SEAD) from long stand-off ranges, which in turn will enable IAF strike aircraft to carry out bombing missions without hindrance.The test of the solid-propelled RudraM-II around 11.30 am on Wednesday met all the trial objectives, validating the propulsion system and control and guidance algorithm.“The missile’s performance was validated from the flight data captured by range tracking instruments like electro-optical systems, radar and telemetry stations, including a ship, deployed at various locations by the Integrated Test Range at Chandipur,” a defence ministry official said.Defence minister Rajnath Singh congratulated DRDO, IAF and industry partners on the successful test-flight of RudraM-II, which incorporates “a number of state-of-the-art indigenous technologies” developed by various DRDO labs.\n“The successful test has consolidated the role of the RudraM-II system as a force multiplier to the armed forces,” he said.", "keywords": ["testfires", "successful", "range", "successfully", "iaf", "airtoground", "strike", "india", "missile", "various", "missiles", "drdo", "system", "test", "rudramii"], "url": "https://timesofindia.indiatimes.com/india/india-successfully-test-fires-rudram-ii-air-to-ground-missile/articleshow/110539863.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110539856,width-1070,height-580,imgsize-829291,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 53, "title": "BCCI receives surprise MS Dhoni proposal as India coach from Virat Kohli’s close connection amid Gambhir reports", "summary": "File photo of MS Dhoni (R) with Virat Kohli during T20 World Cup 2021(ANI)The Dronacharya awardee coach floated in legendary cricketer MS Dhoni's name.\nWhen he took over as captain, the Indian team was filled with big names and Dhoni managed things quite well, said Sharma.\nDhoni had worked with the Indian team as a mentor during their campaign in the 2021 T20 World Cup in the UAE.\nFormer India fast bowler Atul Wasan offered a different perspective on the role of a coach in T20 cricket.\nDravid's contract as India's head coach will end this year after the T20 World Cup.", "keywords": ["indian", "surprise", "coach", "team", "kohlis", "india", "world", "t20", "cricket", "dhoni", "reports", "virat", "ms", "cup", "proposal", "teams", "gambhir", "receives"], "url": "https://www.hindustantimes.com/cricket/bcci-jay-shah-receive-surprise-ms-dhoni-proposal-as-india-head-coach-from-virat-kohli-s-coach-amid-gambhir-reports-101716868099123.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/28/1600x900/Virat_Kohli_MS_Dhoni_1636427886192_1716868798628.jpg"}, {"news_number": 54, "title": "High Humidity Is Causing Heat Stress In India's 6 Major Cities", "summary": "Sharanjeet Kaur, a program officer at the Centre for Science and Environment, told NDTV that high temperature and humidity are crucial to understanding cities' heat stress.\n\"Usually, heatwaves occur between March and July, but nowadays, we are witnessing more humidity than heat, resulting in heat stress.\nThe CSE analysis shows that heat stress results from a deadly combination of air temperature, land surface temperature and relative humidity, which leads to acute thermal discomfort and heat stress in cities.\nWhen the relative humidity is combined with high heat, it adversely impacts human thermal comfort and health, Ms Kaur told NDTV.\nThey should be provided fluids or umbrellas to protect themselves, adding that the poor are more prone to suffer heat stress,\" she added.", "keywords": ["cities", "high", "causing", "increased", "increase", "major", "zones", "humidity", "degrees", "stress", "heat", "relative", "indias", "land", "temperature"], "url": "https://www.ndtv.com/india-news/heat-wave-crisis-has-worsened-in-big-indian-cities-expert-explains-why-5764183", "imgURL": "https://c.ndtvimg.com/2024-05/oulpqqd_heatwave-india_625x300_21_May_24.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 55, "title": "Giant crocodile tries to climb over railing in UP, video goes viral", "summary": "NEW DELHI: A video of a giant crocodile attempting to jump back into a canal is going viral on social media.\nIn the video, the locals are seen in a panic as the large reptile, which crawled out of the canal, is seen attempting to climb over a railing but ultimately failing.Videos shared by netizens claimed that the incident took place in Uttar Pradesh's Bulandshahr .Sharing the video, one of the locals said, \" UP : This crocodile came out of Ganga canal in Narora of Bulandshahr district.\nThe forest department team reached there and rescued it and released it back in the canal.\nCrocodile brother, it is hot here, stay in the water...\"Several people recorded this incident and shared on social media claiming that the size of the croc was at least 10 feet.As per the video, officials who came to capture the reptile covered its head with a cloth and sought to immobilize its limbs to prevent any potential attacks on the rescue team.\nSubsequently, ropes were employed to secure its legs, with four forest officials gripping the ropes attached to the crocodile's head and front legs, while another official looped a piece of rope around its hind legs.Additional personnel lifted the crocodile's tail while others secured a rope around its mouth, as depicted in the videos of the operation.", "keywords": ["tries", "goes", "canal", "video", "team", "ropes", "social", "railing", "crocodile", "shared", "rope", "viral", "climb", "giant", "seen", "reptile"], "url": "https://timesofindia.indiatimes.com/india/giant-crocodile-tries-to-climb-over-railing-in-up-video-goes-viral/articleshow/110537472.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110538234,width-1070,height-580,imgsize-58482,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 56, "title": "India's capital records record temperature of 52.3ºC", "summary": "A woman holding an umbrella walks near the India Gate during severe heatwave on a hot summer day in New Delhi on May 29, 2024.\nMONEY SHARMA / AFPTemperatures in India's capital soared to a record-high 52.3ºC on Wednesday, May 29, the government's weather bureau said.\nIndia is no stranger to searing summer temperatures.\n'Water scarcity'New Delhi authorities have also warned of the risk of water shortages as the capital swelters in headache-inducing heat – cutting supplies to some areas.\nWater Minister Atishi Marlena has called for \"collective responsibility\" in stopping wasteful water use, the Times of India newspaper reported Wednesday.", "keywords": ["day", "capital", "supply", "delhi", "record", "water", "reported", "india", "523ºc", "summer", "heat", "temperatures", "records", "indias", "state", "temperature"], "url": "https://www.lemonde.fr/en/india/article/2024/05/29/india-s-capital-records-record-temperature-of-49-9-c_6672988_168.html", "imgURL": "https://img.lemde.fr/2024/05/29/0/0/6070/4046/1440/960/60/0/121d275_5620260-01-06.jpg"}, {"news_number": 57, "title": "Sachin Tendulkar might meet Rohit Sharma, Virat Kohli and others before India vs Pakistan T20 World Cup match", "summary": "Sachin Tendulkar is likely to be present in New York on June 9 to cheer for Team India during their T20 World Cup 2024 match against Pakistan.\nIndia begin their World Cup campaign against hosts USA on June 5 but needless to say, it is the match against Pakistan that has all the attention.\nIn the last two meetings at the T20 World Cup, India and Pakistan got one apiece.\nSachin Tendulkar with Virat Kohli during 2023 ODI World Cup(ANI)The presence of Tendulkar is sure to boost the Indian side's confidence ahead of the big-ticket clash.\nHe was also ICC's ‘Brand Ambassador’ during the 2015 ODI World Cup in Australia and New Zealand.", "keywords": ["sharma", "rohit", "indian", "tendulkar", "vs", "world", "t20", "pakistan", "meet", "york", "sachin", "virat", "cup", "match", "usa"], "url": "https://www.hindustantimes.com/cricket/sachin-tendulkar-might-meet-rohit-sharma-virat-kohli-and-others-before-india-vs-pakistan-t20-world-cup-match-101716953647708.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/ANI-20231119117-0_1701285188279_1716954022046.jpg"}, {"news_number": 58, "title": "Gautam Gambhir's Many Challenges Before Agreeing For India Coach Role - Report Says \"Young Family...\"", "summary": "Gautam Gambhir - next Indian cricket team head coach?\nAll indications by BCCI secretary Jay Shah suggest that an Indian coach will succeed Rahul Dravid as the head coach from July 1, 2024.\nThe official deadline for application submission for the post of Indian cricket team coach selection is over.\nThe former Indian cricket team star has a young family.\nThe report claimed the inside details of the conversation between Jay Shah and Gautam Gambhir after the IPl 2024 final.", "keywords": ["report", "challenges", "shah", "young", "indian", "jay", "coach", "team", "gambhir", "india", "ipl", "cricket", "added", "gautam", "family", "agreeing", "gambhirs", "role"], "url": "https://sports.ndtv.com/cricket/gautam-gambhirs-many-challenges-before-agreeing-for-india-coach-role-report-says-young-family-5767149", "imgURL": "https://c.ndtvimg.com/2024-05/5ckmljug_virat-kohli-gautam-gambhir-bcci_625x300_22_May_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675"}, {"news_number": 59, "title": "Rinku Singh breaks silence on exclusion from India's T20 World Cup 2024 squad: ‘Big thing for….’", "summary": "Rinku Singh's exclusion from the 15-member India's T20 World Cup 2024 squad raised a lot of eyebrows.\nAfter his magical performance in IPL 2023, Rinku Singh sprang into limelight and soon became a household name owing to his talent.\nAmid intense buzz around his exclusion, Rinku Singh broke his silence and revealed that he was a bit upset in the beginning.\nWinning the World Cup is a big thing.\nIt is a big thing for me that from the place I am from, it is a big thing to make a place in the reserve,\" the star batter added.", "keywords": ["silence", "squad", "rinku", "dream", "reserve", "good", "exclusion", "team", "world", "t20", "singh", "cup", "thing", "indias", "big"], "url": "https://www.livemint.com/sports/cricket-news/rinku-singh-breaks-silence-on-exclusion-from-indias-t20-world-cup-2024-squad-big-thing-for-11716979601660.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/29/1600x900/India-IPL-Cricket-31_1716981091813_1716981127512.jpg"}, {"news_number": 60, "title": "Why elections in India, the world’s largest democracy, are crucial to watch", "summary": "Over the weekend, in an election campaign rally in northwest India, Modi referred to Muslims as “infiltrators.” His critics have called it hate speech.\nNearly 200 million Muslims call India their home, making up the third largest population of Muslims in the world.\nwith questions as to who is next on the list,” said Raqib Naik, a U.S.-based journalist and founder of India Hate Lab, a research group that documents hate speech and polarization.\nIn 2023, India Hate Lab documented 668 hate speech events targeting Muslims, 3/4th of them were in BJP ruled states and federally governed territories.\nAnd this has been deliberate and systematic,” said Naik of India Hate Labs.", "keywords": ["china", "democracy", "crucial", "modi", "indian", "freedom", "india", "watch", "worlds", "muslims", "modis", "singh", "largest", "indias", "hate", "elections"], "url": "https://www.pbs.org/newshour/world/why-elections-in-india-the-worlds-largest-democracy-are-crucial-to-watch", "imgURL": "https://d3i6fh83elv35t.cloudfront.net/static/2024/04/2024-04-22T142102Z_897427929_RC2YW6AWY7WF_RTRMADP_3_INDIA-ELECTION-RELIGION-MODI-1024x685.jpg"}, {"news_number": 61, "title": "Ztech India IPO opens for subscription: Price band at ₹104 - 110 per share, key details here", "summary": "Ztech India IPO: The initial public offering for civil engineering products designer Ztech India opens for subscription today (May 29).\nZtech India IPO: Ztech India IPO price band has been fixed at ₹ 104 to ₹ 110 per share, while the IPO lot size is 1,200 shares.\nZtech India IPO priceThe price band of the IPO has been fixed at ₹104 to ₹110 per share.\nZtech India IPO registrarThe book running lead manager of the IPO is Narnolia Financial Services Ltd while Maashitla Securities Private Limited is the registrar.\nZtech India IPO objectives and company detailsNet proceeds from the IPO will be used by the company to meet the working capital requirements and general corporate purposes, it said.", "keywords": ["share", "theme", "size", "subscription", "shares", "ztech", "key", "india", "ipo", "details", "products", "opens", "sme", "price", "waste", "band"], "url": "https://www.hindustantimes.com/business/ztech-india-ipo-opens-for-subscription-price-band-at-rs-104-110-per-share-key-details-here-101716954953266.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/Sona_Comstars_IPO__1716955068797_1716955068926.png"}, {"news_number": 62, "title": "Deepika Padukone tops IMDb’s list of Top 100 Most Viewed Indian Stars of last decade, beating Shah Rukh Khan, Alia Bhatt", "summary": "Deepika Padukone has hit a remarkable milestone by securing the top position on IMDb’s list of the Top 100 Most Viewed Indian Stars of the Last Decade.\nAmongst a constellation of Bollywood luminaries, including Shah Rukh Khan and Aamir Khan, Padukone's extraordinary journey in the film industry has set her apart.\n(Also read: Deepika Padukone’s ‘sunshine’ yellow gown sold for ₹34,000; proceeds to go to charity) Deepika Padukone is making waves not just in India but abroad as well.\nOn Deepika's journeySince her debut in the blockbuster film Om Shanti Om opposite Shah Rukh Khan, Deepika Padukone has become a household name.\nFollowing Deepika Padukone on the list are industry stars like Shah Rukh Khan and Aishwarya Rai Bachchan, alongside newer talents such as Alia Bhatt and Triptii Dimri.", "keywords": ["deepika", "shah", "tops", "indian", "padukones", "imdbs", "film", "list", "rukh", "viewed", "padukone", "stars", "khan"], "url": "https://www.hindustantimes.com/entertainment/bollywood/deepika-padukone-tops-imdb-s-list-of-top-100-most-viewed-indian-stars-of-last-decade-beating-shah-rukh-khan-alia-bhatt-101716963410586.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/Deepika_Padukone_1716963509725_1716963509880.jpg"}, {"news_number": 63, "title": "PM Modi Unique, Both An Insider And Outsider: Fareed Zakaria To NDTV", "summary": "Mr Zakaria said there has been a global backlash against liberalism.\nMr Zakaria said India can also provide a counterweight in terms of upholding a rules-based international order, which it has historically been in favour of.\nIndia has the potential to be a rule maker, rather than a rule taker in the new world order.\nIt can shape the agenda, it can make the rules but, in order to do that, it has to live by them,\" Mr Zakaria emphasised.\n\"Prime Minister Modi is almost unique in that he has been able to both be an insider and an outsider.", "keywords": ["insider", "china", "term", "mr", "modi", "fareed", "country", "order", "world", "india", "journalist", "theres", "unique", "outsider", "ndtv", "zakaria"], "url": "https://www.ndtv.com/india-news/tremendous-goodwill-market-for-india-fareed-zakaria-to-ndtv-5766097", "imgURL": "https://c.ndtvimg.com/2024-05/lqvdc9_fareed-zakaria-interview_625x300_28_May_24.jpg"}, {"news_number": 64, "title": "UN Peacekeepers Day: Ruchira Kamboj lauds India's contribution to global peace and security", "summary": "NEW DELHI: Ruchira Kamboj , India's Permanent Representative on the United Nations praised the nation's remarkable contributions to global peace and security , on the occasion of International Day of UN Peacekeepers .She emphasised the unwavering bravery of Indian peacekeepers in safeguarding vulnerable communities worldwide.\nKamboj paid tribute to those who sacrificed their lives while serving as UN peacekeepers, acknowledging their \"ultimate sacrifice under the blue flag\" in the pursuit of peace.\n\"Countless indian peacekeepers have made the ultimate sacrifice under the blue flag, laying down their lives in the pursuit of peace.\nIt honors the more than 4,000 peacekeepers who have lost their lives in the pursuit of peace over the past 70 years.\nThis year's theme, \"Fit for the future, building better together,\" recognises the vital contributions of civilian, military, and law enforcement peacekeepers.", "keywords": ["kamboj", "day", "peacekeeping", "indian", "pursuit", "lives", "contribution", "peace", "ruchira", "military", "peacekeepers", "nations", "sacrifice", "lauds", "global", "indias", "international", "security"], "url": "https://timesofindia.indiatimes.com/india/un-peacekeepers-day-ruchira-kamboj-lauds-indias-contribution-to-global-peace-and-security/articleshow/110526977.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110527371,width-1070,height-580,imgsize-690902,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 65, "title": "Indian elite’s longing for the West’s high table can only bring ridicule", "summary": "The explanation that this decision reflects New Delhi’s commitment to advance the interests of the Global South won’t fly.\nIndia’s ruling elite are in an untenable position being branded as pariahs by mainstream US media.\nSigns are multiplying that the US has fallen out of love with India’s ruling elite.\nAgain, Quad gets marginalised in favour of a new grouping called ‘The Squad’ with the Philippines taking India’s place.\nOf course, this estrangement is attributable largely to India’s refusal to identify with the Western moves to isolate Russia.", "keywords": ["explanation", "high", "bring", "ridicule", "table", "ruling", "indian", "longing", "wests", "elite", "western", "wont", "untenable", "terminal", "ukraine", "decision", "indias", "elites"], "url": "https://www.deccanherald.com/opinion/indian-elites-longing-for-the-wests-high-table-can-only-bring-ridicule-3042859", "imgURL": "https://images.deccanherald.com/deccanherald%2F2024-05%2Fa73db94f-4512-4cb6-b1b1-1a29eadf16db%2Ffile7rvvlk9d49kpcmk1570.jpg?rect=0%2C0%2C600%2C315&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop"}, {"news_number": 66, "title": "‘Attack on integrity of India’: BJP attacks Mani Shankar Aiyar over India-China war remark", "summary": "Senior Congress leader Mani Shankar Aiyar.\n(HT File Photo)“Mani Shankar Aiyar says that in 1962 China allegedly invaded India.\nThis shows the anti-India mindset of the Congress party,” BJP leader Gaurav Bhatia said.\n“In October 1962, the Chinese allegedly invaded India,” Aiyar said at the event as per a purported video circulating on social media.\nThese traitorous words are of Mani Shankar Aiyar, but this thought is of Rahul Gandhi.”“Just a few days ago, Mani Shankar Aiyar had said that Pakistan has the atomic bomb... Our army is our pride.", "keywords": ["china", "war", "shankar", "sacrificed", "party", "chinese", "india", "mani", "attacks", "attack", "1962", "congress", "aiyar", "integrity", "indiachina", "remark", "bjp"], "url": "https://www.hindustantimes.com/india-news/attack-on-integrity-of-india-bjp-attacks-mani-shankar-aiyar-over-india-china-war-remark-101716977666154.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/Senior-Congress-leader-Mani-Shankar-Aiyar---HT-Fil_1716977617778.jpg"}, {"news_number": 67, "title": "Why Rohit Sharma's Wife Deleted Her 'All Eyes For Rafah' Insta Post", "summary": "All eyes on Rafah image: People have dropped comments on Ms Sajdeh's birthday post for Rohit SharmaIndian cricket captain Rohit Sharma's wife Ritika Sajdeh was among those who shared the \"All Eyes On Rafah\" image in her Instagram Stories.\nWhile Ms Sajdeh deleted the post within hours, several users accused her of being \"selective\" in speaking against oppression and atrocities.\nPeople have dropped comments on Ms Sajdeh's birthday post for Rohit Sharma.\nHowever, there were a handful of people who lauded Ms Sajdeh for supporting Palestine.\nA user said, \"Thank you for supporting Palestine.”“Respect for Rohit Sharma and his wife\" was the sentiment online.", "keywords": ["sharma", "sajdeh", "rafah", "post", "rohit", "deleted", "wife", "palestinians", "ms", "image", "eyes", "sharmas", "insta", "israeli"], "url": "https://www.ndtv.com/india-news/rohit-sharmas-wife-ritika-sajdeh-deletes-all-eyes-on-rafah-instagram-story-trolled-5770789", "imgURL": "https://c.ndtvimg.com/2024-05/vaoh4cr8_rohit-sharma-wife_625x300_29_May_24.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 68, "title": "DRDO performs successful flight test of India's RudraM-II air-to-surface missile", "summary": "India on Wednesday conducted the successful flight test of RudraM-II air-to-surface missile from the Su-30 MK-I platform of the Indian Air Force.\nIndia on Wednesday conducted the successful flight test of RudraM-II air-to-surface missile from the Su-30 MK-I platform of the Indian Air Force.\n\"Indigenously developed Air to Surface RudraM-II missile was successfully flight-tested from Su-30 MK-I off the Odisha coast today.\nHe said that the successful test has consolidated the role of RudraM-II system as a force multiplier to the Indian Armed Forces.\"\nAbout the RudraM-II Air-to-Surface missileAccording to the Ministry of Defence, RudraM-II is an indigenously developed solid-propelled air-launched missile system.", "keywords": ["successful", "mki", "flight", "missile", "airtosurface", "performs", "su30", "defence", "indias", "drdo", "system", "test", "rudramii"], "url": "https://www.hindustantimes.com/india-news/drdo-performs-successful-flight-test-of-indias-rudram-ii-air-to-surface-missile-101717001456297.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/RudraM-2_1717001560158_1717001585311.jpg"}, {"news_number": 69, "title": "Gautam Gambhir a step closer to becoming India coach, Shah Rukh Khan aware as Dravid’s successor all but certain: Report", "summary": "During his stint as a mentor for both the IPL sides, Gambhir indulged himself in other career activities like working as a cricket expert for a broadcasting channel.\nHowever, if he signs the contract with BCCI for the head coach role, he won't be allowed to engage in multiple professional roles.\nAccording to a report in Cricbuzz, he has told people close to him that he is keen to take up the India role.\nIn fact, even KKR co-owner Shah Rukh Khan is well aware of it.\nHowever, the report could not confirm whether Gambhir formally applied for the position, given that Monday was the last day to submit the form.", "keywords": ["dravids", "report", "shah", "head", "khan", "step", "bcci", "coach", "world", "india", "ipl", "gautam", "rukh", "role", "successor", "gambhir"], "url": "https://www.hindustantimes.com/cricket/gautam-gambhir-step-closer-to-becoming-india-head-coach-shah-rukh-khan-aware-rahul-dravid-successor-all-but-certain-101716909918543.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/28/1600x900/GOKODjpbcAAmiWW_1716910213193_1716910236196.jpg"}, {"news_number": 70, "title": "Prajwal Revanna seeks anticipatory bail ahead of his return to India", "summary": "Suspended JD(S) MP Prajwal Revanna, who is facing charges of sexually abusing several women, has filed a plea in a Bengaluru court seeking anticipatory bail.\nRevanna, who has been absconding since the sex tape scandal broke out last month, is expected to return to India from Germany on Friday, May 31.\nThe Special Court for People's Representatives, where the bail plea was presented, issued a notice to the Special Investigation Team (SIT) to file objections.", "keywords": ["revanna", "sex", "seeks", "tape", "women", "team", "ahead", "return", "india", "plea", "sit", "sexually", "anticipatory", "special", "bail", "court", "prajwal", "suspended"], "url": "https://www.indiatoday.in/india/karnataka/video/prajwal-revanna-seeks-anticipatory-bail-ahead-of-his-return-to-india-2545422-2024-05-29", "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/video/202405/prajwal-293656222-16x9_0.jpg?VersionId=KJU8Qs3Lk0uswhAUbvCuXiK7QXura4cO"}, {"news_number": 71, "title": "India may be heading for a 50-degree-Celsius economy. Is it ready?", "summary": "Climate change means temperatures will be higher more often than they have been across the relatively more populous and less rich states of northern India.\nBut is India’s economy ready to cope with 50 degree Celsius?\nSince farmers can’t be expected to toil in the farms in such high temperatures, agriculture will have to become less labour-intensive.\nTo safeguard against that, a complete overhaul of the food policies will have to be undertaken.\nIf the economy restructures away from some sectors, favouring others, then a churn in the financial markets may follow.", "keywords": ["economy", "longer", "agriculture", "prices", "policies", "output", "sectors", "especially", "ready", "heading", "50degreecelsius", "india", "food", "temperatures"], "url": "https://www.livemint.com/opinion/india-may-be-heading-for-a-50-degree-celsius-economy-is-it-ready-11716977466338.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/29/1600x900/INDIA-CLIMATE-WEATHER-HEAT-3_1716977911666_1716977933581.jpg"}, {"news_number": 72, "title": "Under leadership of PM Modi, foreign policy of India has given fame to our nation: EAM Jaishankar", "summary": "Lauding Prime Minister Narendra Modi's government, External Affairs Minister S Jaishankar said that it is under his leadership that the foreign policy of India has given fame to the nation, which has resulted in New Delhi gaining popularity across the globe.\nIn an interaction with intellectuals during an event in Shimla, Jaishankar said, \"Under the leadership of PM Modi, the foreign policy of India has given fame to our country and India is going to play the role of Vishvaguru in the near future...\"", "keywords": ["foreign", "policy", "modi", "vishvaguru", "india", "given", "nation", "leadership", "eam", "minister", "fame", "shimla", "jaishankar"], "url": "https://timesofindia.indiatimes.com/india/under-leadership-of-pm-modi-foreign-policy-of-india-has-given-fame-to-our-nation-eam-jaishankar/articleshow/110527910.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110528064,width-1070,height-580,imgsize-1144473,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 73, "title": "Basic principle of French Armed Forces is unicity of command: General Valentin Seiler", "summary": "The fundamental principle of the French Armed Forces is the “unicity of command”, a senior French Army officer said while highlighting the importance of joint military commands for France.\nAdvertisementThe French military has at least 10 joint commands, including major overseas bases such as New Caledonia, La Reunion, and French Polynesia, the General said.\nSeiler was in India for the seventh edition of the India-France joint military exercise SHAKTI, which concluded on Sunday at Umroi in Meghalaya.\nHe said there are several engagements with key partners in the Indo-Pacific region and India is one of the “top partners for the country”.\nAdvertisement“The joint exercise will focus on operations in the semi-urban and mountainous terrain.", "keywords": ["general", "valentin", "unicity", "principle", "joint", "command", "french", "region", "military", "armed", "seiler", "operations", "indopacific", "basic", "exercise", "forces", "shakti"], "url": "https://indianexpress.com/article/india/basic-principle-of-french-armed-forces-is-unicity-of-command-gen-valentin-9358020/", "imgURL": "https://images.indianexpress.com/2024/05/french-army-2cols.jpg"}, {"news_number": 74, "title": "An Indigenous Mexican rain dance and feeling the heat in India: photos of the day – Tuesday", "summary": "El Bosque, Mexico View of debris from houses destroyed by rising sea levels and coastal erosion associated with the climate crisis in the community of El Bosque in Tabasco state.\nSeveral houses are already submerged under the waters of the Gulf of Mexico, but some of the walls and cisterns stand out as proof that there used to be a fishing village where 700 people livedPhotograph: Yuri Cortéz/AFP/Getty Images", "keywords": ["indigenous", "photos", "el", "day", "heat", "houses", "yuri", "village", "dance", "india", "rain", "mexico", "used", "waters", "view", "mexican", "feeling", "bosque", "walls"], "url": "https://www.theguardian.com/news/gallery/2024/may/28/an-indigenous-mexican-rain-dance-and-feeling-the-heat-in-india-photos-of-the-day-tuesday", "imgURL": "https://i.guim.co.uk/img/media/093ae721275fd6b5b08fe5b911915cc9f34cc2e6/0_576_8640_5184/master/8640.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=55473acc061862eb485ffad717640dd7"}, {"news_number": 75, "title": "BCCI to neglect deadline as Gautam Gambhir mum on India head coach role, no notable foreign names apply: Report", "summary": "BCCI is in no hurry to release the list of applicants for Team India's head coach role or even talk about it.\nRahul Dravid's contract ends after the T20 World Cup.\nRight now, the team will be busy with World T20 for the better part of the month of June.\nA lot of foreign names like DC head coach Ricky Ponting, LSG head coach Justin Langer, CSK head coach Stephen Fleming and MI director of cricket Mahela Jayawardene were floated, but none of them has reportedly applied.\nAnother aspect that needs to be investigated seriously is how senior India players, currently in New York, feel about Gambhir's potential replacement for Rahul Dravid.", "keywords": ["report", "head", "shah", "bcci", "team", "coach", "gambhir", "world", "india", "senior", "t20", "gautam", "neglect", "notable", "mum", "role", "names"], "url": "https://www.hindustantimes.com/cricket/bcci-to-neglect-deadline-as-gautam-gambhir-mum-on-india-head-coach-role-no-notable-foreign-names-apply-report-101716960006577.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/CRICKET-IND-IPL-T20-HYDERABAD-KOLKATA-101_1716960112257_1716960134235.jpg"}, {"news_number": 76, "title": "5 Facts About Radhika Sen, Indian Army Officer Set To Be Honoured By UN", "summary": "Ms Sen led peacekeeping efforts in the eastern Democratic Republic of the Congo (DRC).\nWho is Radhika Sen?\nBorn in Himachal Pradesh, Radhika Sen initially pursued a career in biotechnology engineering.\nRadhika Sen is the second Indian peacekeeper to receive the Military Gender Advocate of the Year Award.\nBefore Ms Sen, Major Suman Gawani was recognised for her service with the UN Mission in South Sudan.", "keywords": ["facts", "army", "efforts", "congo", "officer", "indian", "women", "peacekeeping", "democratic", "set", "radhika", "ms", "republic", "sen", "honoured"], "url": "https://www.ndtv.com/india-news/who-is-radhika-sen-indian-army-major-to-get-un-award-for-gender-advocacy-5769115", "imgURL": "https://c.ndtvimg.com/2024-05/atra6qu8_major-radhika-sen_625x300_29_May_24.jpeg"}, {"news_number": 77, "title": "Top 10 Stock Markets In The World: India Among Top 5! Where Do China, US, Japan Rank? Check List", "summary": "Top 10 Stock Markets in the World 2024: What is the largest stock market in the world?\nDid you know that the market capitalization of the world’s largest stock market is more than 11 times of the Indian stock market?\nWhat is the largest stock market in Asia and where does India rank?\nStock markets are broadly seen as an indicator of an economy’s strength.\nWe take a look at the world’s top 10 stock markets in terms of combined market capitalization of its stock exchanges as per data shared by Anand Rathi Shares and Stock Brokers: (AI image)", "keywords": ["china", "japan", "check", "strength", "terms", "capitalization", "markets", "world", "india", "market", "list", "worlds", "rank", "largest", "times", "stock"], "url": "https://timesofindia.indiatimes.com/business/india-business/top-10-stock-markets-in-the-world-india-among-top-5-where-do-china-us-japan-rank-check-list/photostory/110541619.cms", "imgURL": "https://static.toiimg.com/photo/110541620.cms"}, {"news_number": 78, "title": "Can Indian carriers break the Malaysian jinx?", "summary": "Indian carriers have tried connecting Kuala Lumpur to their network multiple times.\nThe connectivity at the start of 2000 comprised just 14 flights, nine by Malaysia Airlines and five by Air India & Indian Airlines combined.\nGradually airlines from India started pulling out, with Air India, Indian Airlines, Air Sahara, Jet Airways all vacating the route while the last one Air India Express vacating the market in 2016.\nIn terms of capacity, Thailand and Singapore see their local carriers and Indian carriers being neck to neck.\nWill Indian carriers do so in future?", "keywords": ["indian", "jinx", "carriers", "lumpur", "airasia", "malaysian", "india", "kuala", "flights", "malaysia", "air", "break", "airlines"], "url": "https://www.hindustantimes.com/india-news/can-indian-carriers-break-the-malaysian-jinx-101716977480246.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/Jet-airways-Aircraft-taxis-for-take-off-at-Mumbai-_1683312442459_1716978367116.jpg"}, {"news_number": 79, "title": "Gautam Gambhir's 'next step' in IPL adds fresh twist to India coaching role: 'KKR still 2 IPL trophies behind MI, CSK'", "summary": "Returning to Kolkata Knight Riders (KKR) as the mentor of the franchise, Gambhir guided Shreyas Iyer and Co. to their third Indian Premier League (IPL) title in the 2024 season.\nGambhir has been in speculation about replacing Dravid ever since KKR started dominating the league phase of the cash-rich league.\nGambhir was recently asked about his future with the Knight Riders after a remarkable season in the cash-rich league.\nGambhir's legacy at KKRBefore lifting the title in the 2024 season, KKR last won an IPL crown when Gambhir was at the helm.\nUnder Gambhir's leadership, the Knight Riders recorded their first-ever title win in 2012.", "keywords": ["twist", "step", "indian", "riders", "gambhir", "league", "india", "ipl", "kkr", "cricket", "gambhirs", "gautam", "win", "knight", "mi", "trophies", "role"], "url": "https://www.hindustantimes.com/cricket/gautam-gambhir-next-step-in-ipl-adds-fresh-twist-to-india-coaching-role-kkr-still-2-ipl-trophies-behind-mi-csk-101716987342443.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/CRICKET-IND-IPL-T20-KOLKATA-MUMBAI-17_1716989774226_1716989805310.jpg"}, {"news_number": 80, "title": "How heat stress has increased in urban India this year", "summary": "This combination of intense heat and humidity during the prolonged summer months is leading to increased heat stress across several regions in India.\nWhile nine of the 65 cities analysed showed nil hours of heat stress, 55 others recorded an increase in the heat stress hours during May - typically considered the peak summer month.\nThe report further categorised heat stress into two categories: humid heat stress (when relative humidity exceeds 50%) and dry heat stress (when relative humidity is below 50%).\nStill, 13 of the 28 other cities that observed humid heat stress hours recorded an increase in heat stress hours between the first and fourth weeks of May.\nAlthough lower humidity is considered relatively better, an analysis of cities experiencing dry heat stress showed that the number of heat stress hours increased in more inland cities.", "keywords": ["cities", "analysed", "report", "increased", "hours", "65", "humidity", "india", "humid", "stress", "levels", "heat", "urban"], "url": "https://www.livemint.com/news/india/how-heat-stress-has-increased-in-urban-india-this-year-11716972106559.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/29/1600x900/The-Tripura-government-has-ordered-the-closure-of-_1682335279080_1716975344330.jpg"}, {"news_number": 81, "title": "India set for wheat imports after six years, to shore up reserves", "summary": "It seems like you're already an ETPrime member withLogin using your ET Prime credentials to enjoy all member benefitsLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits.", "keywords": ["withlogin", "wheat", "enjoy", "youre", "et", "set", "log", "india", "using", "loggedin", "imports", "member", "credentials", "prime", "reserves", "shore"], "url": "https://m.economictimes.com/news/economy/agriculture/india-set-for-wheat-imports-after-six-years-to-shore-up-reserves/articleshow/110531794.cms", "imgURL": "https://img.etimg.com/thumb/msid-110531863,width-1200,height-630,imgsize-2954541,overlay-economictimes/photo.jpg"}, {"news_number": 82, "title": "Explained: Why some Indian tech startups are 'reverse flipping' now", "summary": "Related stories Be prepared for the worst while you are building a business at scale: Bizongo cofounder & CEO Sachin AgrawalSmall-town startups see 3x increase in fundingCan Indian startups take an Uber ride?\nThen there was an Indian entity below it, which was the main operating entity.\nThe VC and PE funds have understood India; they've understood how investments work in India.\nThere is also the overall concept of a nationalist approach, where you feel proud of being an Indian promoter, having listed an Indian company.\nIn fact, till a few years ago you could not do a cross-border merger when you had Indian companies involved.", "keywords": ["explained", "indian", "flip", "understood", "company", "reverse", "india", "entity", "holding", "tech", "companies", "flipping", "startups"], "url": "https://www.forbesindia.com/article/startups/explained-why-some-indian-tech-startups-are-reverse-flipping-now/93224/1", "imgURL": "https://www.forbesindia.com/media/images/2024/May/img_235001_startups.jpg"}, {"news_number": 83, "title": "'Narendra Modi', 'Sachin Tendulkar', 'Amit Shah' Apply For India Coach Job", "summary": "The deadline for submitting applications for Team India's head coach has passed, with the Board of Control for Cricket in India (BCCI) reportedly receiving more than 3000 applications.\nThough former India cricketer Gautam Gambhir reportedly leads the race, a few others with some famous names like Narendra Modi, Sachin Tendulkar, and Amit Shah have also applied for the role.\nWith the BCCI deciding to make the application for Team India's head coach public, many random people filled the form and submitted applications, using fake names of famous celebrities and political leaders.\nTeam India's current head coach Rahul Dravid will see his stint come to an end after the conclusion of the T20 World Cup 2024.\nPost the marquee event, the BCCI would hope to assign a new head coach with the Indian team.", "keywords": ["shah", "head", "modi", "bcci", "indian", "coach", "tendulkar", "narendra", "apply", "india", "team", "amit", "reportedly", "sachin", "job", "indias", "applications", "names"], "url": "https://sports.ndtv.com/cricket/narendra-modi-sachin-tendulkar-amit-shah-apply-for-india-coach-job-5761761", "imgURL": "https://c.ndtvimg.com/2024-05/2u1t4iio_rahul-dravid-bcci_625x300_28_May_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675"}, {"news_number": 84, "title": "Delhi Temperature: 52.3 degrees Celsius in Delhi, highest ever temperature for capital", "summary": "NEW DELHI: Breaking all the records, northwest Delhi's Mungeshpur area on Wednesday recorded maximum temperature of 52.3 degrees Celsius, highest ever for the capital.The temperature was recorded at Jawahar Navodaya Vidyalaya in Mungeshpur village that doubles up as an automatic weather station (AWS).The area lies around 50km north of the city centre.The AWS centre has been recording the city’s hottest maximum temperature for the past few days.“It’s excessively hot, almost as if it is raining fire,” exclaimed Pradeep Kumar, the school vice-principal.“Last year, at peak summer, there were no heatwaves.\nIt even rained occasionally.\nEven a year before that, the summer hadn’t been as punishing.”", "keywords": ["village", "capital", "mungeshpur", "523", "delhi", "maximum", "area", "weather", "vidyalaya", "degrees", "recorded", "summer", "highest", "viceprincipallast", "celsius", "temperature"], "url": "https://timesofindia.indiatimes.com/city/delhi/52-3-degrees-celsius-in-delhis-mungeshpur-highest-ever-for-capital/articleshow/110535160.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110535103,width-1070,height-580,imgsize-86106,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 85, "title": "Delhi Temperature Now Just 3.8 Degrees Shy Of World Record Set In 1913", "summary": "The US ranch where the world record was set is now called the Furnace Creek Ranch.\nThe national capital recorded its highest-ever temperature of 52.9 degrees Celsius, just 4.4 degrees shy of the highest temperature ever recorded on Earth: 56.7 degrees Celsius at the Greenland Ranch in California's Death Valley.\nAt 51 degrees Celsius, the previous highest temperature in India was recorded in Rajasthan's Phalodi in 2016.\nThis was followed by 50.8 degrees in Churu, also in the desert state, in 2019 and 50.6 degrees in Alwar in 1956.\nThe world's highest temperature, according to the Guinness World Records, was recorded on July 10, 1913.", "keywords": ["delhi", "set", "record", "world", "lot", "degrees", "recorded", "winds", "shy", "1913", "buildings", "heat", "highest", "ranch", "38", "celsius", "temperature"], "url": "https://www.ndtv.com/india-news/delhi-temperature-now-just-4-4-degrees-shy-of-world-record-set-in-1913-5771883", "imgURL": "https://c.ndtvimg.com/2024-05/ra3q26oo_heatwave-ians_625x300_06_May_24.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 86, "title": "Rise of Harmeet Singh: After setbacks on and off the field and selectorial rejection to playing for USA against India in T20 World Cup", "summary": "He will be playing against India for his new adopted country USA in the T20 world cup.\nIt has been a great week as his USA defeated Bangladesh in a series and Harmeet played his part, slamming unbeaten matchwinning 13-ball 33 runs.\nHe is not the lone Indian in the USA World Cup squad.\nThe dressing room environment is nice and talent is there, hope we will have a good World Cup,” Harmeet says.\nFor Harmeet’s father, it will be a proud moment to see his son play in the World Cup.", "keywords": ["mumbai", "son", "playing", "play", "world", "t20", "selectorial", "setbacks", "india", "cricket", "rise", "singh", "life", "rejection", "played", "usa", "harmeet"], "url": "https://indianexpress.com/article/sports/cricket/harmeet-singh-t20-world-cup-2024-spot-fixing-usa-team-mlc-9357401/", "imgURL": "https://images.indianexpress.com/2024/05/Harmeet-Singh.jpg"}, {"news_number": 87, "title": "Watch: Radhika Gupta advises Shark Tank India staff on investing in mutual funds backstage", "summary": "Edelweiss CEO Radhika Gupta pushed staff associated with her on Shark Tank India to begin investing in mutual funds and use systematic investment plans (SIPs) as well.\nIn a video posted on X (formerly Twitter), Radhika Gupta was seen behind the scenes on the sets of Shark Tank India advising staff to begin investing.\nEdelweiss MF’s Radhika Gupta on the sets of Shark Tank India.\n(X/@iRadhikaGupta)She posted, “Can’t take the Mutual Fund CEO out of me, even behind the shoots of Shark Tank.\nIn the video, she was seen asking Shark Tank India staff backstage if they have invested in mutual funds or started an SIP.", "keywords": ["start", "tank", "video", "mutual", "gupta", "radhika", "india", "shark", "watch", "funds", "staff", "investing"], "url": "https://www.hindustantimes.com/business/watch-radhika-gupta-advising-shark-tank-india-staff-on-investing-in-mutual-funds-backstage-101716956996241.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/29/1600x900/BTS_X_Shark_Tank_India_Radhika_Gupta_Edelweiss_MF_1716940208698_1716957313698.png"}, {"news_number": 88, "title": "India records temperature at 50 degrees: Understanding the causes behind country's extreme heatwave", "summary": "Historic temperaturesCyclone Remal Makes Landfall Over Bangladesh, Bengal Coasts With 110-120kmph Max WindspeedThe El Niño effectHow heatwave is form in India?\nWhat are Rossby waves?\nThe region will continue to endure scorching temperatures in June, with only brief relief expected after three days due to western disturbances.\nWhile climate change is a significant factor in rising temperatures, there are multiple underlying reasons contributing to the extreme heat in India.\nThey are named after Carl-Gustaf Rossby, who first identified them, according to NASA .These waves play a crucial role in our weather.", "keywords": ["extreme", "normal", "understanding", "rossby", "waves", "50", "weather", "india", "degrees", "countrys", "causes", "heatwave", "heat", "rajasthan", "temperatures", "records", "air", "temperature"], "url": "https://timesofindia.indiatimes.com/city/delhi/india-records-temperature-at-50-degree-understanding-the-causes-behind-countrys-extreme-heatwave/articleshow/110491165.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110493266,width-1070,height-580,imgsize-975993,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}]