[{"News": 0, "title": "French government spokeswoman says President Emmanuel Macron is traveling to violence-hit New Caledonia", "summary": "French government spokeswoman says President Emmanuel Macron is traveling to violence-hit New CaledoniaFrench government spokeswoman says President Emmanuel Macron is traveling to violence-hit New Caledonia", "keywords": ["emmanuel", "violencehit", "president", "caledonia", "spokeswoman", "caledoniafrench", "macron", "traveling", "french"], "polarity": 0.06818181818181818, "subjectivity": 0.22727272727272727, "url": "https://abcnews.go.com/International/wireStory/french-government-spokeswoman-president-emmanuel-macron-traveling-violence-110426127", "imgURL": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg"}, {"News": 1, "title": "Austrian leader lauds UK's efforts on migration and cites its plan for deportations to Rwanda", "summary": "Austrian Chancellor Karl Nehammer's conservative party has long taken a hard line on migration and faces a strong challenge from the far-right Freedom Party in an election expected this fall.\nNehammer said Austria and the United Kingdom, which left the European Union in 2020, are “strategic partners when it comes to being able to conduct asylum proceedings in safe third countries.\"\n“The United Kingdom is a pioneer for this path, which will also be important for the European Union,” he said at a joint news conference with Sunak.\nThat call came after EU nations endorsed sweeping reforms to the bloc’s failed asylum system.\n___Follow all AP stories on global migration at https://apnews.com/hub/migration.", "keywords": ["sunak", "safe", "proceedings", "efforts", "cites", "countries", "pioneer", "lauds", "migrants", "austrian", "plan", "deportations", "uks", "rwanda", "migration", "leader", "asylum"], "polarity": 0.08573232323232323, "subjectivity": 0.36725589225589217, "url": "https://abcnews.go.com/International/wireStory/austrian-leader-lauds-uks-efforts-migration-cites-plan-110426590", "imgURL": "https://i.abcnewsfe.com/a/33224762-7c13-415d-8fff-e3c029ace854/wirestory_6cc4a34351329d41af7006c441fdb0e1_16x9.jpg?w=1600"}, {"News": 2, "title": "At least 40 villagers shot dead in latest violence in Nigeria's conflict-hit north", "summary": "Nigerian authorities say Armed men attacked remote villages in northcentral Nigeria, killing at least a dozen villagers during a late-night raidAt least 40 villagers shot dead in latest violence in Nigeria's conflict-hit northABUJA, Nigeria -- Armed men attacked remote villages in northcentral Nigeria, killing at least a dozen villagers during a late-night raid, authorities said Tuesday.\nThe local Punch newspaper cited witnesses as saying at least 40 people were killed in Plateau’s Wase district on Monday night.\n“We are trying to comb the area to see whether we have more casualties or people with bullet wounds,” he added.\nLocals have repeatedly expressed concern over how the assailants can attack villages for hours and escape before security forces arrive on the scene.\nIn December, assailants killed at least 140 residents during an attack that targeted more than a dozen communities over two days.", "keywords": ["latest", "violence", "villagers", "attack", "killed", "shot", "conflicthit", "attacked", "north", "40", "wase", "nigeria", "targeted", "dead", "dozen", "villages", "nigerias"], "polarity": -0.0022988505747126354, "subjectivity": 0.42298850574712643, "url": "https://abcnews.go.com/International/wireStory/40-villagers-shot-dead-latest-violence-nigerias-conflict-110438986", "imgURL": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg"}, {"News": 3, "title": "Jailed Guatemalan journalist to AP: 'I can defend myself, because I am innocent'", "summary": "The journalist’s money laundering conviction was tossed out, and last week a judge finally ordered his conditional release to await a new trial.\nI have to face justice because I can defend myself, because I am innocent.”International press freedom organizations have labeled Zamora’s arrest and detention a political prosecution.\nZamora said his treatment has improved somewhat since President Bernardo Arévalo took office in January, but the bar was low.\nThe long hours without daylight, the isolation and being awakened several times a night by guards amount to psychological torture, Zamora said.\nZamora explained that a well-known painter friend of his had donated a painting, which he then sold to pay the newspaper’s debts.", "keywords": ["times", "cases", "day", "defend", "zamora", "week", "ap", "spent", "innocent", "cell", "trial", "guatemalan", "journalist", "prison", "went", "jailed"], "polarity": 0.05480371900826446, "subjectivity": 0.3724517906336089, "url": "https://abcnews.go.com/International/wireStory/jailed-guatemalan-journalist-ap-crossed-mind-flee-face-110449608", "imgURL": "https://i.abcnewsfe.com/a/b6f55bd1-aecc-436e-a3e2-e60e4eebe8ce/wirestory_8ed172677f3f10505a0dee9572ad4547_16x9.jpg?w=1600"}, {"News": 4, "title": "China is accelerating the forced urbanization of rural Tibetans, rights group says", "summary": "The international rights organization cited a trove of Chinese internal reports contradicting official pronouncements that all Tibetans who have been forced to move, with their past homes destroyed on departure, did so voluntary.\nAlong with the official Tibetan Autonomous Region, Tibetans make up communities in the neighboring provinces of Sichuan, Yunnan and Qinghai.\nChina has consistently defended its policies in Tibet as bringing stability and development to a strategically important border region.\nChina consistently says allegations of human rights abuses in Tibetan regions are groundless accusations intended to smear China’s image.\nHRW recommended the U.N. Human Rights Council undertake an independent investigation into human rights violations committed by the Chinese government in Tibet and other areas.", "keywords": ["china", "tibetans", "traditional", "state", "rights", "tibet", "report", "urbanization", "accelerating", "group", "tibetan", "forced", "human", "region", "rural"], "polarity": 0.07470614828209764, "subjectivity": 0.31078963230861967, "url": "https://abcnews.go.com/International/wireStory/report-china-accelerating-forced-urbanization-rural-tibetans-110440166", "imgURL": "https://i.abcnewsfe.com/a/5a9d08e2-4bba-4441-8bf4-b3edf5d2a955/wirestory_a0b07de64a948db06f9bc9e5ff4ce215_16x9.jpg?w=1600"}, {"News": 5, "title": "No more cute snaps of Mount Fuji over a convenience store. A screen was built to stop tourist crowds", "summary": "A Japanese town known for some of the best views of Mount Fuji has raised a large black screen to block the view and deter tourists from overcrowding the stretch of streetNo more cute snaps of Mount Fuji over a convenience store.\nA screen was built to stop tourist crowdsTOKYO -- Sorry, the screen is now up — no more snapping cute photos of Mount Fuji from a popular sidewalk spot in the Japanese town of Fujikawaguchiko.\nA particularly popular photo location was outside a Lawson convenience store, from where a photograph taken at a particular angle would make it seem as if Mount Fuji was sitting atop the store roof.\nDesignated a UNESCO World Cultural Heritage site in 2013, Mount Fuji used to be a place of pilgrimage.\nOver-tourism has also become a growing issue at other popular tourist destinations such as Kyoto and Kamakura.", "keywords": ["fuji", "crowds", "store", "trail", "convenience", "mount", "tourists", "screen", "sidewalk", "popular", "town", "summit", "stop", "tourist", "snaps", "cute"], "polarity": 0.14586602173336866, "subjectivity": 0.474320169626292, "url": "https://abcnews.go.com/International/wireStory/cute-snaps-mt-fuji-screen-japanese-town-prevent-110428270", "imgURL": "https://i.abcnewsfe.com/a/1468c6de-dfa2-460f-8b7e-2bf2644a9aa1/wirestory_e1fa287577735d6949aad140d54b0568_16x9.jpg?w=1600"}, {"News": 6, "title": "How 2 debunked accounts of sexual violence on Oct. 7 fueled a global dispute over Israel-Hamas war", "summary": "As some of the first people on the scene, ZAKA volunteers offered testimony of what they saw that day.\nAnd the fallout from the debunked accounts shows how the topic of sexual violence has been used to further political agendas.\nIt has accused the international community of ignoring or playing down evidence of sexual violence claims, alleging anti-Israel bias.\nThe U.N. report shines a light on the issues that have contributed to the skepticism over sexual violence.\nIn the fraught global discourse surrounding Oct. 7 and the war it sparked, sexual violence has been a particular point of tension.", "keywords": ["body", "israeli", "bodies", "violence", "debunked", "volunteers", "war", "israelhamas", "fueled", "accounts", "landau", "global", "dispute", "oct", "zaka", "sexual"], "polarity": 0.06646904848425758, "subjectivity": 0.42335221812408086, "url": "https://abcnews.go.com/International/wireStory/2-debunked-accounts-sexual-violence-oct-7-fueled-110455496", "imgURL": "https://i.abcnewsfe.com/a/a7ee46ce-a4e9-435c-8b02-777972c92c6e/wirestory_ca7905bf9520b1e646f86d72cdf03244_16x9.jpg?w=1600"}, {"News": 7, "title": "Resigned to a fate of constant displacement, India's river islanders return home in between floods", "summary": "The 56-year-old farmer from northeastern India’s Assam state lives with his wife and son on Sandahkhaiti island on India’s Brahmaputra River.\nThe island, like two thousand others on the river, floods with increasing ferocity and unpredictability as human-caused climate change makes rain heavier and more erratic in the region.\nAnd while local governments have talked about it, only a few river islanders have been offered land rights in the state.\nWhen it rains, the family stays as long as they can, living in knee-deep water inside their small hut, sometimes for days.\nCooking, eating and sleeping, even as the river water rises.", "keywords": ["river", "water", "island", "resigned", "fate", "state", "islanders", "constant", "ali", "displacement", "return", "small", "climate", "family", "wife", "floods", "indias"], "polarity": 0.028293957815234413, "subjectivity": 0.3982223450308557, "url": "https://abcnews.go.com/International/wireStory/resigned-fate-constant-displacement-indias-river-islanders-return-110453025", "imgURL": "https://i.abcnewsfe.com/a/ca04c154-522b-49eb-b454-9b0e2dec0edd/wirestory_5a49df1ce02e3e8a9b913115dc182a2c_16x9.jpg?w=1600"}, {"News": 8, "title": "German far-right party bans its top European election candidate from campaigning after Nazi remark", "summary": "Germany’s far-right Alternative for Germany party has banned its top candidate for next month’s European election from making any more campaign appearances and said he would resign from the party’s board immediatelyBERLIN -- Germany's far-right Alternative for Germany party on Wednesday banned its top candidate for next month's European election from making any further campaign appearances and said he would resign from the party's board immediately.\nThe scandals involving Krah come at a most inconvenient time for the Alternative for Germany, or AfD — only a few weeks before the party is hoping to make big gains at the European election.\n2 on the AfD’s list for the European Parliament election, Petr Bystron, last month separately denied allegations in a Czech daily that he may have received money from a pro-Russian network.\nIt wasn't immediately clear if he was still running for the European Parliament.\nSo far, the Rassemblement National, or RN, had been working together with the AfD in the European Parliament, but now the French far-right is considering ending its cooperation with the AfD on the European level, dpa reported.", "keywords": ["german", "board", "farright", "party", "european", "ss", "candidate", "campaigning", "bans", "parliament", "war", "nazi", "afd", "remark", "election", "krah"], "polarity": 0.06387152777777778, "subjectivity": 0.2752777777777778, "url": "https://abcnews.go.com/International/wireStory/german-party-bans-top-european-election-candidate-campaigning-110468530", "imgURL": "https://i.abcnewsfe.com/a/624892f4-a5f4-4d37-8c00-08767dc6917b/wirestory_2c3b1537d02622a9948933c18c14dd51_16x9.jpg?w=1600"}, {"News": 9, "title": "German author Jenny Erpenbeck wins International Booker Prize for tale of tangled love affair", "summary": "German author Jenny Erpenbeck and translator Michael Hofmann have won the International Booker Prize for the novel “Kairos.”LONDON -- German author Jenny Erpenbeck and translator Michael Hofmann won the International Booker Prize for fiction Tuesday for “Kairos,” the story of a tangled love affair during the final years of East Germany’s existence.\nThe 50,000 pounds ($64,000) in prize money is divided between author and translator.\nThe International Booker Prize is awarded every year.\nIt is run alongside the Booker Prize for English-language fiction, which will be handed out in the fall.\nErpenbeck is the first German winner of the International Booker Prize, and Hofmann is the first male translator to win since the prize launched in its current form in 2016.", "keywords": ["german", "booker", "translator", "erpenbeck", "prize", "tangled", "novel", "love", "fiction", "hofmann", "jenny", "tale", "writer", "wins", "international", "book"], "polarity": 0.08005050505050505, "subjectivity": 0.3313131313131314, "url": "https://abcnews.go.com/International/wireStory/german-author-jenny-erpenbeck-wins-international-booker-prize-110447693", "imgURL": "https://i.abcnewsfe.com/a/b2ab081e-8279-45b4-8bce-75e549fb1427/wirestory_7edae456f37200d623706c5f9996e8fd_16x9.jpg?w=1600"}, {"News": 10, "title": "Weather forecasters warn Pakistanis to stay indoors ahead of new heat wave", "summary": "“The sweltering heat will continue this month,” said Zaheer Ahmed Babar, a senior official at the Pakistan Meteorological Department.\nBabar said another intense heat wave will hit the country in June, when the temperature is likely to reach 45 degrees (113 Fahrenheit).\nFarmers and other livestock owners should take measures to protect their animals during extreme heat, he said.\nHowever, many people, especially laborers and construction workers in the impoverished nation, ask how they can stay indoors as their families will suffer if they don't work.\n“I feel the heat even in the morning, but people say the temperatures will go up even further,” he said.", "keywords": ["pakistanis", "say", "stay", "indoors", "wave", "forecasters", "extreme", "warn", "temperatures", "weather", "pakistan", "ahead", "country", "heat", "hit"], "polarity": -0.011275132275132275, "subjectivity": 0.5213280423280422, "url": "https://abcnews.go.com/International/wireStory/weather-forecasters-warn-pakistanis-stay-indoors-ahead-new-110425071", "imgURL": "https://i.abcnewsfe.com/a/3f0de98f-0744-46b0-ac7a-aafef7fc825b/wirestory_ce0c3c876b45cdd47303c9f66e90bf9b_16x9.jpg?w=1600"}, {"News": 11, "title": "It's so hot in Mexico, howler monkeys are falling dead from the trees", "summary": "At least 83 howler monkeys were found dead in the Gulf coast state of Tabasco.\nIt's so hot in Mexico, howler monkeys are falling dead from the treesMEXICO CITY -- It’s so hot in Mexico that howler monkeys are falling dead from the trees.\nIt was heatstroke.”While Mexico's brutal heat wave has been linked to the deaths of at least 26 people since March, veterinarians and rescuers say it has killed dozens and perhaps hundreds of howler monkeys.\nIn the town of Tecolutilla, Tabasco, the dead monkeys started appearing Friday, when a local volunteer fire-and-rescue squad showed up with five of the creatures in the bed of a truck.\nNormally quite intimidating, howler monkeys are muscular and some can be as tall as 90 centimeters (3 feet), with tails just as long.", "keywords": ["water", "monkeys", "falling", "state", "theyre", "trees", "local", "howler", "mexico", "set", "dead", "hot", "pozo", "heat"], "polarity": -0.006679362304362306, "subjectivity": 0.4694184981684982, "url": "https://abcnews.go.com/International/wireStory/hot-mexico-howler-monkeys-falling-dead-trees-110439435", "imgURL": "https://i.abcnewsfe.com/a/244eba54-6746-4cd3-8677-1cb4f2ca566b/wirestory_b99e0570dfb53a2fb7ebe663acecde78_16x9.jpg?w=1600"}, {"News": 12, "title": "Irish Prime Minister Simon Harris says his government is recognizing a Palestinian state, calls it an 'important day'", "summary": "Irish Prime Minister Simon Harris says his government is recognizing a Palestinian state, calls it an 'important day'Irish Prime Minister Simon Harris says his government is recognizing a Palestinian state, calls it an 'important day'", "keywords": ["recognizing", "important", "state", "prime", "simon", "day", "palestinian", "harris", "calls", "irish", "minister"], "polarity": 0.2, "subjectivity": 0.5, "url": "https://abcnews.go.com/International/wireStory/irish-prime-minister-simon-harris-government-recognizing-palestinian-110457641", "imgURL": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg"}, {"News": 13, "title": "Vatican makes fresh overture to China, reaffirms that Catholic Church is no threat to sovereignty", "summary": "ROME -- The Vatican made another big overture to China on Tuesday, reaffirming the Catholic Church poses no threat to Beijing's sovereignty and admitting that Western missionaries had made “errors” in past centuries in their zeal to convert the Chinese faithful.\nThe presence of Shanghai Bishop Joseph Shen Bin alongside the Vatican secretary of state, Cardinal Pietro Parolin, at the Pontifical Urbaniana University was in itself noteworthy.\nTheir attitudes helped fuel the anti-Western and anti-Christian sentiment behind the Boxer Rebellion, which aimed to rid China of foreign influences.\nSpeaking through an interpreter, Shen said the Catholic Church today must have a Chinese point of view, respect Chinese culture and develop alongside Chinese society.\nTuesday’s conference provided a venue for the Holy See to publicly admit to certain errors of the past, reaffirm its respect for a fully Chinese Catholic Church and insist that the Vatican poses no threat to it.", "keywords": ["china", "threat", "sovereignty", "fresh", "bishop", "vatican", "foreign", "western", "shanghai", "makes", "catholic", "local", "church", "chinese", "overture", "reaffirms"], "polarity": 0.03972431077694235, "subjectivity": 0.3072525062656643, "url": "https://abcnews.go.com/International/wireStory/vatican-makes-fresh-overture-china-reaffirms-catholic-church-110429564", "imgURL": "https://i.abcnewsfe.com/a/f833f2a2-1f50-4284-9165-3f67d212bc95/wirestory_e322c14ea9ceae11fd72e90b7bc73076_16x9.jpg?w=1600"}, {"News": 14, "title": "Germany's foreign minister says in Kyiv that air defenses are an 'absolute priority' for Ukraine", "summary": "Germany’s foreign minister says sending air defense systems to Ukraine to help protect it from Russian cruise missiles, rockets and drones is an “absolute priority.”Germany's foreign minister says in Kyiv that air defenses are an 'absolute priority' for UkraineKYIV, Ukraine -- Sending air defense systems to Ukraine to help protect it from Russian cruise missiles, rockets and drones is an “absolute priority,” Germany’s foreign minister said in Kyiv on Tuesday after visiting a local power plant that was largely reduced to ruins by a recent barrage.\nGermany recently pledged a third U.S.-made Patriot battery for Ukraine, but Kyiv officials say they are still facing an alarming shortfall of air defenses against the Russian onslaught.\nBaerbock, accompanied by Ukrainian Energy Minister Herman Halushchenko, toured a thermal power plant in central Ukraine that was heavily damaged on April 11.\nZelenskyy said that Ukraine’s forces are still in control of the contested areas, though Russia says it has captured a series of border villages.\nAlmost 11,000 people have been evacuated from Kharkiv border areas since Russia launched its offensive actions there on May 10.", "keywords": ["air", "priority", "ukraine", "ukrainian", "foreign", "russian", "ukraines", "defenses", "defense", "border", "absolute", "forces", "kyiv", "minister", "germanys", "kharkiv"], "polarity": 0.04085714285714286, "subjectivity": 0.31849206349206344, "url": "https://abcnews.go.com/International/wireStory/germanys-foreign-minister-visits-kyiv-ukraine-battles-hold-110425161", "imgURL": "https://i.abcnewsfe.com/a/a0c40e6f-6997-4f6f-89bf-d7a8e3146a89/wirestory_7da2c54c3c777fef4d95baf4752133de_16x9.jpg?w=1600"}, {"News": 15, "title": "New Zealand and Australia sending planes to evacuate nationals from New Caledonia's unrest", "summary": "New Zealand and Australia sending planes to evacuate nationals from New Caledonia's unrestNew Zealand and Australia sending planes to evacuate nationals from New Caledonia's unrest", "keywords": ["unrest", "sending", "planes", "nationals", "unrestnew", "caledonias", "zealand", "evacuate", "australia"], "polarity": 0.13636363636363635, "subjectivity": 0.45454545454545453, "url": "https://abcnews.go.com/International/wireStory/new-zealand-australia-sending-planes-evacuate-nationals-new-110421016", "imgURL": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg"}, {"News": 16, "title": "UK court rules that extension of police powers to intervene in protests is unlawful", "summary": "Britain’s High Court has ruled that new regulations that gave U.K. police more powers to intervene in protests were unlawfulUK court rules that extension of police powers to intervene in protests is unlawfulLONDON -- Britain's High Court ruled Tuesday that new regulations that gave U.K. police more powers to intervene in protests are unlawful.\nCivil liberties campaign group Liberty brought legal action against the British government over a law passed last year that lowered the threshold for what is considered “serious disruption” to community life caused by a protest.\nThe 2023 Public Order Act broadened the definition of “serious disruption” from “significant” and “prolonged” disturbance to individuals or an organization to “more than minor.\"\nAuthorities introduced the changes by a process called statutory instrument, which faces less scrutiny, after Parliament rejected them earlier.\nTwo judges ruled Tuesday that the Home Office acted outside of its powers and failed to carry out a fair consultation process.", "keywords": ["powers", "rejected", "extension", "court", "protests", "unlawful", "rules", "serious", "disruption", "right", "uk", "ruled", "intervene"], "polarity": 0.03837012987012989, "subjectivity": 0.4721517556517557, "url": "https://abcnews.go.com/International/wireStory/uk-court-rules-extension-uk-police-powers-intervene-110427217", "imgURL": "https://i.abcnewsfe.com/a/c63e48e9-9bba-4daa-b593-940e1cd5a7c6/wirestory_5e60caae22315f06a683dedbbc090800_16x9.jpg?w=1600"}, {"News": 17, "title": "EU reprimands Kosovo's move to close down Serb bank branches over the use of the dinar currency", "summary": "Since Feb. 1, the government required areas dominated by the ethnic Serb minority in Kosovo to adopt the euro currency, which is used in the rest of the country, and abolished the use of the Serbian dinar.\nPristina postponed the move for about three months, following pressure from the EU and the United States, concerned that the decision would negatively impact the ethnic Serb minority in northern Kosovo.\n“Why are Kosovo’s Serbs, the only community in Europe which cannot do business normally?\nDon't Kosovo Serbs have the right to salaries and pensions?” Vucevic said.\nParts of Kosovo’s north, populated mostly by ethnic Serbs, continue to use the dinar.", "keywords": ["branches", "ethnic", "serb", "serbs", "minority", "dinar", "reprimands", "kosovo", "serbian", "bank", "close", "currency", "eu", "kosovos"], "polarity": -0.005251862649821833, "subjectivity": 0.3380871396177519, "url": "https://abcnews.go.com/International/wireStory/eu-reprimands-kosovos-move-close-serb-bank-branches-110429681", "imgURL": "https://i.abcnewsfe.com/a/e298e321-f8b1-4f3c-b08d-4f10131866f0/wirestory_1f58dcd11f6ee92bc0fa281e15aa3093_16x9.jpg?w=1600"}, {"News": 18, "title": "Takeaways from AP examination of how 2 debunked accounts of sexual violence on Oct. 7 originated", "summary": "Some allege the accounts of sexual assault were purposely concocted.\nThe military was focused on battling back militants still hiding out in southern Israel.\nZAKA’s main experience with victim identification before then was limited to distinguishing militant attackers from their victims, not determining who was a victim of sexual assault.\nThat means bodies that might have shown signs of sexual assault could have eluded examination.\nA U.N. fact-finding team found “reasonable grounds” to believe that some of those who stormed southern Israel on Oct. 7 had committed sexual violence, including rape and gang rape.", "keywords": ["body", "bodies", "violence", "debunked", "ap", "sexual", "assault", "israel", "southern", "landau", "takeaways", "accounts", "oct", "zaka", "examination", "originated"], "polarity": 0.09081803902116399, "subjectivity": 0.39722966269841287, "url": "https://abcnews.go.com/International/wireStory/takeaways-ap-examination-2-debunked-accounts-sexual-violence-110455498", "imgURL": "https://i.abcnewsfe.com/a/e367895d-a4f6-4bae-aeda-2ab9062fa769/wirestory_a12f75ddecab75989426f4dc24906ba9_16x9.jpg?w=1600"}, {"News": 19, "title": "Vietnam’s top security official To Lam confirmed as president", "summary": "Vietnam’s National Assembly has confirmed the country’s top security official, To Lam, as its new presidentBANGKOK -- Vietnam’s top security official To Lam was confirmed Wednesday as the nation's new president.\nAs Vietnam's top security official, Lam has led Trong's sweeping anti-graft campaign.\nFollowing Lam's confirmation as president, Deputy Public Security Minister Tran Quoc To was appointed to take over from him at the ministry in an interim role.\nLam spent more than four decades in the Ministry of Public Security before becoming the minister in 2016.\nDuring Lam's years heading the Public Security Ministry, Human Rights Watch, Amnesty International and other watchdog organizations have strongly criticized Vietnam for its harassment and intimidation of critics.", "keywords": ["german", "security", "vietnams", "president", "vietnam", "sentenced", "official", "lam", "confirmed", "vietnamese", "lams", "minister", "public"], "polarity": 0.07402847152847153, "subjectivity": 0.3724209124209122, "url": "https://abcnews.go.com/International/wireStory/vietnams-top-security-official-confirmed-president-110454044", "imgURL": "https://i.abcnewsfe.com/a/29c28778-85f8-4454-a5b9-a5891a030fa8/wirestory_1c7c8e83a5c5fb1c92192f1121c50189_16x9.jpg?w=1600"}]