[{"news_number": 0, "title": "Leaflet by Leaflet, a Few Aging Activists Fight India’s Tide of Bigotry", "summary": "One recent morning, Roop Rekha Verma, an 80-year-old peace activist and former university leader, walked through a north Indian neighborhood prone to sectarian strife and parked herself near a tea shop.\nFrom her sling bag, she pulled out a bundle of pamphlets bearing messages of religious tolerance and mutual coexistence and began handing them to passers-by.\nDon’t let anyone divide you,” one read in Hindi.\nSpreading those simple words is an act of bravery in today’s India.\nMs. Verma and others like her are waging a lonely battle against a tide of hatred and bigotry increasingly normalized by India’s ruling Bharatiya Janata Party, or B.J.P.", "keywords": ["todays", "strife", "verma", "tea", "tolerance", "fight", "bigotry", "waging", "aging", "university", "activists", "tide", "words", "indias", "leaflet", "walked"], "url": "https://www.nytimes.com/2024/05/28/world/asia/india-activists.html", "imgURL": "https://static01.nyt.com/images/2024/05/12/world/00india-activists/00india-activists-facebookJumbo.jpg"}, {"news_number": 1, "title": "The enormous stakes of India’s election", "summary": "The 2024 Indian election is the largest in world history: Nearly 1 billion people are eligible to cast their ballots.\nYet India’s nonpartisan Election Commission has somehow managed to run consistently well-regarded contests for decades.\nInstead, they’re voting for the local members of his Bharatiya Janata Party (BJP) or its many rivals.\nThere’s every indication Modi’s crackdown on both democracy and minority rights will continue if the BJP triumphs in this election.\nThere’s a lot going on in the Indian election.", "keywords": ["modi", "bjp", "party", "stakes", "democracy", "majority", "enormous", "modis", "prime", "indias", "indian", "election"], "url": "https://www.vox.com/world-politics/351497/india-election-2024-explainer-narendra-modi-bjp", "imgURL": "https://platform.vox.com/wp-content/uploads/sites/2/2024/05/gettyimages-2153591529.jpg?quality=90&strip=all&crop=0,10.776130549589,100,78.447738900822"}, {"news_number": 2, "title": "Pak \"Violated\" Lahore Agreement Signed With India In 1999: Nawaz Sharif", "summary": "Former Pakistan Prime Minister Nawaz Sharif on Tuesday admitted that Islamabad had \"violated\" an agreement with India signed by him and ex-prime minister Atal Bihari Vajpayee in 1999, in an apparent reference to the Kargil misadventure by Gen Pervez Musharraf.\nAfter a historic summit here, Nawaz Sharif and Ata Bihari Vajpayee signed the Lahore Declaration on February 21, 1999.\nHe said all cases against him were false while the cases against Pakistan Tehreek-e-Insaf founder leader Imran Khan were true.\nHe asked Imran Khan to deny that he was not launched by the ISI.\nSharif also praised his younger brother Prime Minister Shehbaz Sharif for standing by his side through thick and thin.", "keywords": ["1999", "kargil", "imran", "pak", "talked", "violated", "gen", "pakistan", "minister", "khan", "prime", "sharif", "agreement", "vajpayee", "lahore", "signed", "nawaz", "india"], "url": "https://www.ndtv.com/world-news/pak-violated-lahore-agreement-signed-with-india-in-1999-nawaz-sharif-5765586", "imgURL": "https://c.ndtvimg.com/2024-02/vftlr57o_nawaz-sharif-afp_625x300_10_February_24.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 3, "title": "Is America giving Narendra Modi an easy ride?", "summary": "B ARRING A HUGE political upset, Narendra Modi looks likely to begin a third term as India’s prime minister soon after June 4th, when the results of the general election will be announced.\nMr Modi, seemingly unnerved by the low turnout, has ramped up inflammatory rhetoric towards India’s Muslim minority while on the campaign trail.\nAlthough voting itself has been generally unproblematic, most Western officials agree that Mr Modi has tilted the political pitch significantly by suppressing dissent and weakening democratic institutions.\nHow should they deal with Mr Modi, particularly if his Bharatiya Janata Party ( BJP ) is emboldened by a large mandate?\nRead more of our coverage of the Indian election and bookmark our results page.", "keywords": ["weakening", "easy", "modi", "america", "mr", "results", "minister", "western", "narendra", "weekly", "political", "giving", "indias", "ride", "election"], "url": "https://www.economist.com/asia/2024/05/27/is-america-giving-narendra-modi-an-easy-ride", "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240601_ASP501.jpg"}, {"news_number": 4, "title": "In India, hotter nights intensify impact of searing heat waves", "summary": "A new study warns that hotter nights and rising humidity levels are worsening heat stress on tens of millions of people, posing a growing health hazard.\n“The temperature difference from morning to night used to be about 12 degrees Celsius or more two decades ago.\nSunday, more than 30 cities recorded temperatures of over 45 degrees Celsius, mostly in northern, central and western India.\nPointing out that the sun is not the only source of heat in cities, experts cite many reasons for rising nighttime temperatures.\nExperts say even if global warming stops below 1.5 degrees Celsius, climate induced heatwaves are here to stay.", "keywords": ["degrees", "climate", "impact", "cities", "waves", "nights", "study", "temperatures", "hotter", "summer", "intensify", "celsius", "searing", "india", "heat"], "url": "https://www.voanews.com/a/in-india-hotter-nights-intensify-impact-of-searing-heat-waves-/7629605.html", "imgURL": "https://gdb.voanews.com/C7905037-8C73-4B91-BFCB-411FDFCADD66.jpg"}, {"news_number": 5, "title": "India election: Fighting for votes in 'the world's biggest data mine'", "summary": "Put simply, says Mr Joshi, this level of information can predict the vote - \"and these predictions usually never go wrong\".\nIn India, the problem is compounded because it's \"a data society that was planned and built by the government without any safeguards\", Mr Kodali says.\nGetty Images India has built the world's largest biometric ID database - the Aadhaar schemeMeanwhile, a data protection law passed by the government last year is yet to be implemented, experts say.\nAs Mr Joshi puts it, India entered the election year as \"the biggest possible data mine in the world right now\".\nThe thing is, no one is doing anything illegal, says Mr Joshi. \"", "keywords": ["party", "biggest", "mr", "worlds", "level", "joshi", "information", "votes", "data", "images", "apps", "political", "fighting", "india", "election"], "url": "https://www.bbc.com/news/articles/c3ggqx4lwp6o", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/890f/live/c2f993e0-19a1-11ef-8810-7ddce6503835.jpg"}, {"news_number": 6, "title": "India elections: PM Narendra Modi claims he has been chosen by God", "summary": "Indian prime minister Narendra Modi has said he believes he has been chosen by God, as the multi-stage Indian election nears its completion.\n“I am convinced that ‘Parmatma’ (God) sent me for a purpose.\nModi has built up a well-established cult of personality within his Hindu nationalist Bharatiya Janata Party (BJP), with many supporters unable to name other cabinet members or their local BJP candidate.\nAfter she passed away, upon reflecting on all my experiences, I was convinced that God had sent me,” he said.\nAsked by a TV anchor whether Modi was suffering from a “God complex”, BJP spokesperson Sanju Verma replied by extolling his energy.", "keywords": ["modi", "bjp", "verma", "party", "making", "claims", "chosen", "work", "narendra", "indian", "purpose", "god", "sent", "india", "elections"], "url": "https://www.theguardian.com/world/article/2024/may/27/india-elections-pm-narendra-modi-claims-he-has-been-chosen-by-god", "imgURL": "https://i.guim.co.uk/img/media/98b5c8da20dd796a697503ca08af2486689c5bc5/0_307_5293_3176/master/5293.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6b55e404aac3e4545ee084abd20b22bb"}, {"news_number": 7, "title": "In India, voters sweat their way toward the end of the election", "summary": "NEW DELHI — As India nears the end of the world’s largest election process, extreme heat may be keeping voters from showing up at the polls.\nMohammed Yusuf, 65, was already wiping sweat off his face as he walked up to the polling station about a quarter-mile from his home.\n“Luckily I live close.”The Election Commission of India said voter turnout in the Delhi capital region was a decade-low 57.67%, down from 60.5% in 2019.\nVoters lined up at a polling booth Saturday in New Delhi, where temperatures soared as high as 113 degrees Fahrenheit.\n“They know that agricultural candidates will do something about it, specifically invest in irrigation which mitigates high temperatures,” he said.", "keywords": ["election", "sweat", "station", "high", "turnout", "polling", "voter", "way", "temperatures", "delhi", "voters", "india", "end", "heat"], "url": "https://www.nbcnews.com/news/world/india-election-heat-wave-voter-turnout-rcna153871", "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2024-05/270524-india-voting-wc-0925-e2ac07.jpg"}, {"news_number": 8, "title": "A stone quarry collapses in India due to heavy rains, killing 13, 16 remain missing", "summary": "A stone quarry collapses in India due to heavy rains, killing 13, 16 remain missingA stone quarry collapses in India’s northeast due to heavy rains, killing 13.\nAnother 16 remain missing", "keywords": ["collapses", "quarry", "rains", "heavy", "13", "16", "killing", "remain", "stone", "northeast", "india", "missing"], "url": "https://abcnews.go.com/International/wireStory/stone-quarry-collapses-indias-northeast-due-heavy-rains-110600378", "imgURL": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg"}, {"news_number": 9, "title": "At least 17 are killed when a stone quarry collapses in India’s northeast. 12 others remain missing", "summary": "GUWAHATI, India (AP) — A stone quarry collapsed Tuesday in India’s northeast due to heavy rain triggered by a tropical storm, killing 17 quarry workers and leaving 12 missing, officials said.\nLast year, seven workers were killed in the state’s Mamit town when a stone quarry collapsed.\nIn 2022, 12 workers were killed in another similar collapse.\nIndia’s northeastern states are experiencing heavy rainfall after tropical storm Remal made landfall in Bangladesh on Monday.\nIndia’s Meteorological Department has warned that heavy rains may damage vulnerable structures and thatched houses and trigger landslides in the region.", "keywords": ["collapses", "quarry", "storm", "stones", "heavy", "17", "tropical", "landslides", "killed", "12", "remain", "workers", "states", "stone", "northeast", "indias", "missing"], "url": "https://apnews.com/article/india-stone-quarry-collapse-rains-5badbae4c2282027ac4a35bbde40db14", "imgURL": "https://dims.apnews.com/dims4/default/b633d5d/2147483647/strip/true/crop/6000x3375+0+312/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fad%2Fad%2F0ac6c68388889cb39fac5c1208cd%2Fc4429b3e1c93479e9c3841bb2ddb82b9"}, {"news_number": 10, "title": "Payal Kapadia: India celebrates historic win at Cannes Film Festival", "summary": "CNN —Filmmaker Payal Kapadia made history Saturday, as she became the first person from India to clinch the prestigious Grand Prix at the 77th Cannes Film Festival, the second highest prize after the Palme d’Or.\nIt is the first Indian movie in three decades to compete in Cannes’ main competition.\n“Please don’t wait another 30 years to have an Indian film,” she said to the audience.\n“Indian stars shining bright… These women have scripted history, and inspired the entire Indian film fraternity,” he wrote on the platform.\nIn 1947, filmmaker Chetan Anand took Cannes’ top prize for his film “Neecha Nagar,” becoming the only Indian to win the accolade.", "keywords": ["payal", "celebrates", "light", "historic", "cannes", "prize", "kapadia", "win", "film", "festivals", "indian", "country", "main", "festival", "india"], "url": "https://www.cnn.com/2024/05/27/style/payal-kapadia-india-cannes-grand-prix-intl-hnk/index.html", "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2154660758.jpg?c=16x9&q=w_800,c_fill"}, {"news_number": 11, "title": "Are you a robot?", "summary": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy.", "keywords": ["supports", "policy", "javascript", "sure", "review", "information", "loading", "happenplease", "service", "terms", "robot"], "url": "https://www.bloomberg.com/news/articles/2024-05-28/india-s-top-ev-ride-hailer-seeks-300-million-to-expand-car-fleet", "imgURL": ""}, {"news_number": 12, "title": "India MotoGP promoter cancels this year's race, eyes March 2025 date", "summary": "The Buddh International Circuit, located on the outskirts of capital Delhi, was due to stage the 14th round of the season on 23-25 September.\nAlthough the statement from Fairstreet didn’t explicitly talk about cancellation, it can be interpreted that the promoter is talking about moving this year’s race to March 2025.\n“The unsuitable weather conditions in September posed significant challenges for both riders and marshals, as observed last year.\nThe organisation had previously been adamant that the 2024 race will go ahead as planned and that any doubts about the race were primarily due to the ongoing general elections in the country.\nVR46 rider Marco Bezzecchi won the inaugural Indian Grand Prix last year on a 2022-spec Ducati.", "keywords": ["2024", "statement", "cancels", "motorsportcom", "eyes", "motogp", "race", "date", "fairstreet", "2025", "event", "prix", "promoter", "kazakhstan", "second", "india"], "url": "https://www.motorsport.com/motogp/news/india-motogp-promoter-cancels-this-years-race-eyes-march-2025-date/10616977/", "imgURL": "https://cdn-8.motorsport.com/images/amp/YMdaMaL2/s6/marco-bezzecchi-vr46-racing-te.jpg"}, {"news_number": 13, "title": "India to Stick to Policy Path Even If Modi Loses, Rajan Says", "summary": "(Bloomberg) -- India will likely maintain its economic policy trajectory whether Prime Minister Narendra Modi wins a third term in office or not, former central bank Governor Raghuram Rajan said.\nMost Read from Bloomberg“There is a lot of continuity built into Indian policy,” Rajan said in an interview Tuesday with Bloomberg TV’s David Ingles.\nFinancial markets are bracing for a possible selloff if the BJP loses support, concerned about a possible shift away from economic reforms.\nRajan said the infrastructure spending under the Modi government was necessary given the huge deficiencies in the country.\nMost Read from Bloomberg Businessweek©2024 Bloomberg L.P.", "keywords": ["path", "policy", "modi", "infrastructure", "possible", "economic", "stick", "rajan", "comes", "read", "loses", "bloomberg", "stuff", "india"], "url": "https://www.yahoo.com/news/india-stick-policy-path-even-043526198.html", "imgURL": "https://s.yimg.com/ny/api/res/1.2/NDayAeywPYn1X8BsmXW6tg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_politics_602/85c0a761d835bae272bcae39bcc670cb"}, {"news_number": 14, "title": "Watch: Smoke and flames at deadly India arcade fire", "summary": "At least 22 people have died in a “massive fire” at a games arcade in India, local officials say.\nFlames and a huge pall of smoke could be seen rising into the sky at the building in Rajkot, in the western state of Gujarat.\nThe fire is now under control and a search has been launched.\nThere are fears more victims may be trapped under the wreckage, including children.", "keywords": ["trapped", "watch", "seen", "victims", "search", "flames", "wreckage", "sky", "western", "state", "deadly", "sayflames", "smoke", "india", "arcade"], "url": "https://www.bbc.com/news/videos/c2550jxw87po", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/762e/live/6299e2f0-1ac0-11ef-a13a-0b8c563da930.jpg"}, {"news_number": 15, "title": "Indian PM Modi’s latest campaign message to supporters: ‘God has sent me’", "summary": "CNN —India’s Prime Minister Narendra Modi has a new message for supporters on the campaign trail: God has chosen him.\n“This is why I have dedicated myself to God.”Modi continued: “God doesn’t reveal his cards.\nThis, he added has “rallied his base who feel pride in such religiosity.”India is a deeply religious country.\n“(He is) the first prime minister, they say, to be unashamed about this faith,” Sinha said.\nIt ignited widespread anger among Muslim leaders and opposition politicians and calls for election authorities to investigate.", "keywords": ["modi", "bjp", "latest", "ram", "campaign", "supporters", "minister", "hindu", "message", "modis", "country", "god", "prime", "indias", "sent", "indian", "election"], "url": "https://www.cnn.com/2024/05/28/india/india-narendra-modi-chosen-by-god-intl-hnk/index.html", "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/2024-04-21t171632z-74092274-mt1asnews20240421229l-rtrmadp-3-ani.jpg?c=16x9&q=w_800,c_fill"}, {"news_number": 16, "title": "The Bitter Bargain that India’s 200 Million Muslims Face - The New York Times", "summary": "I don’t wear a skullcap, and in public I avoid wearing the loosefitting Pathani kurta and peppering my speech with Urdu words, all of which are identity markers for Indian Muslims.\nFor 10 years, Mr. Modi’s Hindu-chauvinist government has vilified the nation’s 200 million Muslims as dangerous undesirables.\nAs offensive as that was, it is sadly familiar to Indian Muslims like me who — after a decade of denigration, violence and murder — live in daily fear of being identified and attacked, forcing us into self-denial to protect ourselves.\nIslam came here around 1,300 years ago, and Indian Muslims descend from natives of this land who converted to Islam centuries ago.\nMany Indian Muslims fought against British colonization, and millions rejected the 1947 partition of the country into a predominantly Hindu India and a mostly Muslim Pakistan.", "keywords": ["bargain", "muslim", "india", "worlds", "million", "hindu", "islam", "indias", "200", "bitter", "country", "ago", "times", "muslims", "dont", "indian", "face", "york"], "url": "https://www.nytimes.com/2024/05/26/opinion/india-muslim-modi-election.html", "imgURL": "https://static01.nyt.com/images/2024/05/24/opinion/24ali/24ali-facebookJumbo.png"}, {"news_number": 17, "title": "Two Deadly Fires in Rapid Succession Expose India’s Gaps in Safety", "summary": "What remained of the two-story building on Sunday morning was its burned facade, a charred spiral staircase and oxygen cylinders covered in soot.\nHours earlier, in the western Indian city of Rajkot, an amusement park of trampolines and bowling lanes had turned to an inferno.\nAs after every such deadly episode, political leaders were quick with messages of condolence, announcements of arrests, creations of inquiries — and finger-pointing.\nBuilding safety compliance remains abysmal across India, the world’s most populous nation.\nGovernment audits after mass-casualty disasters unearth glaring shortcomings, with little follow-up.", "keywords": ["gaps", "disasters", "twostory", "charred", "rapid", "warned", "fires", "succession", "vacation", "western", "turned", "deadly", "unearth", "abysmal", "expose", "safety", "indias", "worlds"], "url": "https://www.nytimes.com/2024/05/26/world/asia/india-fire-death-infants-safety.html", "imgURL": "https://static01.nyt.com/images/2024/05/26/multimedia/26india-fires1-tjfm/26india-fires1-tjfm-facebookJumbo.jpg"}, {"news_number": 18, "title": "Fire at India children’s hospital kills six newborns", "summary": "CNN —At least six newborn babies died in a fire at a children’s hospital in the Indian capital of New Delhi on Saturday, local officials said.\nTwelve newborns were rescued from the hospital, but six died in the fire, Atul Garg, Delhi Fire Services chief told CNN.\nOne of the rescued babies is in a serious condition, and the five others are receiving medical attention, Garg said.\nThe rescued babies have not been identified as authorities have yet to find their birth records, Garg said.\nIn 2021, 10 newborn babies died in a hospital fire in the western Indian state of Maharashtra.", "keywords": ["died", "services", "records", "babies", "local", "kills", "hospital", "childrens", "rescued", "newborn", "indian", "india", "newborns", "garg"], "url": "https://www.cnn.com/2024/05/26/india/india-newborns-killed-hospital-fire-intl-hnk/index.html", "imgURL": "https://media.cnn.com/api/v1/images/stellar/prod/still-20656927-24484-still.jpg?c=16x9&q=w_800,c_fill"}, {"news_number": 19, "title": "A chicken recipe so good its origin is being fought in court", "summary": "A chicken recipe so good its origin is being fought in court7 hours ago By Tamara Hinson ShareGetty Images Butter chicken is one of the most popular curries around the world (Credit: Getty Images)A dish beloved around the world, butter chicken is now at the heart of a legal battle being waged by two of India's oldest restaurants.\nTo add insult to injury, its tagline included the words \"by the inventors of Butter Chicken\".\nWhose grandfather prepared that first portion of butter chicken is almost certainly impossible to prove, although Bagga believes it was probably a collaboration.\n\"Their case is about someone saying their grandfather invented butter chicken, but who knows which partner invented it?\"\nSure, some people might come because of the story, but they won't return if the butter chicken isn't good.\"", "keywords": ["fought", "gravy", "restaurant", "recipe", "daryaganj", "dish", "court", "jaggi", "moti", "good", "delhi", "mahal", "origin", "butter", "chicken"], "url": "https://www.bbc.com/travel/article/20240528-a-chicken-recipe-so-good-its-origin-is-being-fought-in-court", "imgURL": "https://ychef.files.bbci.co.uk/624x351/p0j0090y.jpg"}, {"news_number": 20, "title": "Bodies of 27 ‘burnt beyond recognition’ after a massive fire in Indian amusement park, relatives say", "summary": "Panicked visitors ran for safety but the narrow gates at the park restricted a quick escape, The Indian Express newspaper reported.\nPrayers for the injured.”Fires are common in India, where builders and residents often flout building laws and safety codes.\nActivists say builders frequently cut corners on safety to save money and have accused civic authorities of negligence and apathy.\nIn 2019, a fire caused by an electrical short circuit engulfed a building in the Indian capital and killed 43 people.\nIn 2022, a fire in a four-story commercial building in New Delhi killed at least 27.", "keywords": ["solanki", "told", "safety", "india", "officer", "wait", "singh", "say", "tests", "amusement", "burnt", "massive", "building", "park", "relatives", "27", "recognition", "bodies", "indian"], "url": "https://apnews.com/article/india-distraught-relatives-fire-amusement-park-fire-8662fcb08cf3e5c5d8230ce8fc1ed806", "imgURL": "https://dims.apnews.com/dims4/default/b2b095e/2147483647/strip/true/crop/5322x2994+0+277/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F68%2F48%2Fe9dc45321cfe347039b6913d9444%2F3cd05dea6a7d48e590e9f9c58d17c21c"}, {"news_number": 21, "title": "High Humidity Is Causing Heat Stress In India's 6 Major Cities", "summary": "Sharanjeet Kaur, a program officer at the Centre for Science and Environment, told NDTV that high temperature and humidity are crucial to understanding cities' heat stress.\n\"Usually, heatwaves occur between March and July, but nowadays, we are witnessing more humidity than heat, resulting in heat stress.\nThe CSE analysis shows that heat stress results from a deadly combination of air temperature, land surface temperature and relative humidity, which leads to acute thermal discomfort and heat stress in cities.\nWhen the relative humidity is combined with high heat, it adversely impacts human thermal comfort and health, Ms Kaur told NDTV.\nThey should be provided fluids or umbrellas to protect themselves, adding that the poor are more prone to suffer heat stress,\" she added.", "keywords": ["degrees", "stress", "temperature", "high", "increase", "cities", "zones", "humidity", "major", "increased", "land", "causing", "relative", "indias", "heat"], "url": "https://www.ndtv.com/india-news/heat-wave-crisis-has-worsened-in-big-indian-cities-expert-explains-why-5764183", "imgURL": "https://c.ndtvimg.com/2024-05/oulpqqd_heatwave-india_625x300_21_May_24.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 22, "title": "India elections 2024: Record high 744 political parties contesting", "summary": "Panorama of parties Number of parties contesting Indian elections is at its highest, but expected winners remain unchanged.\nNever before have so many parties contested for the Lok Sabha, the directly elected lower house of the Indian Parliament.\nThere was a steep increase in the number of contesting parties from 1989 onwards, when more than a 100 parties contested.\nSeats contested by select regional parties in 2024Multiple maps of Lok Sabha seats in India show the seats contested by some of the large regional parties in the 2024 elections.\nAnnual income of political parties in 2018-19Circles of varying size show the income of 228 political parties in the fiscal year 2018-19.", "keywords": ["record", "744", "2024", "number", "party", "high", "contested", "contesting", "candidates", "won", "political", "parties", "seats", "india", "election", "elections"], "url": "https://www.reuters.com/graphics/INDIA-ELECTION/POLITICAL-PARTIES/dwpkzrymrvm/", "imgURL": "https://www.reuters.com/graphics/INDIA-ELECTION/POLITICAL-PARTIES/dwpkzrymrvm/cdn/images/reuters-graphics.png"}, {"news_number": 23, "title": "National Spelling Bee reflects the economic success and cultural impact of immigrants from India", "summary": "Of the 34 since, 28 have been Indian American, including three straight years of Indian American co-champions and one year (2019) when eight champions were declared, seven of Indian ancestry.\nThe experiences of first-generation Indian Americans and their spelling bee champion children illustrate the economic success and cultural impact of the nation’s second-largest immigrant group.\nFILE - Ishika Varipilli, 11, from Spring, Texas, waits on stage during the Scripps National Spelling Bee, Wednesday, June 1, 2022, in Oxon Hill, Md.\nSince 1999, 28 of the last 34 Scripps National Spelling bee champions have been Indian American.\nThe experiences of first-generation Indian Americans and their spelling bee champion children illustrate the economic success and cultural impact of the nation’s second-largest immigrant group.", "keywords": ["champion", "bee", "impact", "economic", "scripps", "parents", "immigrants", "cultural", "reflects", "american", "indian", "children", "spelling", "success", "india", "national"], "url": "https://apnews.com/article/spelling-bee-indian-americans-immigration-b14ba87533dfcd8af813de568ee5958f", "imgURL": "https://dims.apnews.com/dims4/default/af496b2/2147483647/strip/true/crop/2857x1607+0+149/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2Fbd%2Ff36035f92a2b3de05ae58bca761b%2F9d47672141b34313bf9643a059fa19c8"}, {"news_number": 24, "title": "At least 27 reportedly dead in fire at amusement arcade in Guajarat, India", "summary": "India games arcade fire kills 27, officials sayWatch: The gaming arcade in Rajkot was engulfed in a \"massive fire\"At least 27 people have died in a “massive fire” at a games arcade in India, local officials say.\nFlames and a huge pall of smoke could be seen rising into the sky at the building in Rajkot, in the western state of Gujarat.\n\"The bodies are charred beyond recognition and hence their identification will be difficult,\" senior police officer Radhika Bharai told reporters after providing the updated death toll.\nEarlier, Rajkot Police Commissioner Raju Bhargava told BBC Gujarati 24 people had died.\nThe blaze broke out on Saturday afternoon when the arcade was packed with children and young people.", "keywords": ["guajarat", "amusement", "27", "reportedly", "died", "victims", "officials", "dead", "minister", "massive", "games", "told", "rajkot", "india", "arcade"], "url": "https://www.bbc.com/news/articles/cneemmm3njyo", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/e73e/live/0767de80-1ac2-11ef-baa7-25d483663b8e.jpg"}, {"news_number": 25, "title": "Cyclone Remal: At least 16 killed in Bangladesh and India", "summary": "At least 16 dead as cyclone hits Bangladesh and India1 day ago Hafsa Khalil , BBC News ShareKM Asad/Getty ImagesAt least 16 people have died after a cyclone crashed into coastal parts of India and southern Bangladesh.\nNearly a million people were evacuated as Cyclone Remal made landfall on Sunday evening.\nAhead of Cyclone Remal, nearly three million people in Bangladesh saw their electricity shut off to avoid accidents, ministry officials said.\nSave the Children said it had sent four emergency response teams to the country's affected areas, including a medical team, to support recovery.\nThe charity's country director Shumon Sengupta said the cyclone \"shows yet again how vulnerable Bangladesh is to extreme weather events\".", "keywords": ["west", "nearly", "16", "million", "killed", "including", "cyclone", "remal", "areas", "told", "india", "bangladesh"], "url": "https://www.bbc.com/news/articles/ckvv8q10vxvo", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/24d9/live/4f1867f0-1c47-11ef-ac61-e7bb0ab72f9c.jpg"}, {"news_number": 26, "title": "Free Food? Modi Makes Sure Every Indian Knows Whom to Thank for It.", "summary": "Durga Prasad, an 80-year-old farmer, was resting under the shade of a tree in front of his home when the party workers came.\nAn app on their smartphones could tell them in an instant who Mr. Prasad was, whom he might vote for — and why he should be grateful to India’s prime minister, Narendra Modi.\n“You get installments of 2,000 rupees, right?” asked a local official from Mr. Modi’s Bharatiya Janata Party, or B.J.P.\nMr. Prasad concurred.\nHe receives $72 a year through a farmers’ welfare program started and branded by Mr. Modi.", "keywords": ["modi", "asked", "tell", "party", "free", "welfare", "mr", "sure", "tree", "thank", "prasad", "vote", "food", "official", "workers", "makes", "indian", "knows"], "url": "https://www.nytimes.com/2024/05/26/world/asia/india-welfare-modi.html", "imgURL": "https://static01.nyt.com/images/2024/05/21/multimedia/00india-welfare-01-czpb/00india-welfare-01-czpb-facebookJumbo.jpg"}, {"news_number": 27, "title": "In Bangladesh and India, cyclone floods coastal villages, blows away thatched roofs and cuts power", "summary": "DHAKA, Bangladesh (AP) — A cyclone flooded coastal villages, blew away thatched roofs and left hundreds of thousands of people without power Monday in southern Bangladesh and eastern India.\nDozens of Bangladeshi villages were flooded after flood protection embankments either washed away or were damaged by the storm surge, TV stations reported.\nIn India’s West Bengal state, roofs on thatched houses were blown away while electric poles and trees were uprooted in some coastal districts.\nThe Meteorological Department in Dhaka said the winds were now 90 kph (56 mph) with gusts to 120 kph (75 mph).\nRemal was the first cyclone in the Bay of Bengal ahead of this year’s monsoon season, which runs from June to September.", "keywords": ["kph", "tv", "thousands", "away", "roofs", "storms", "cuts", "coastal", "winds", "villages", "power", "thatched", "floods", "cyclone", "blows", "india", "bangladesh"], "url": "https://www.pbs.org/newshour/world/in-bangladesh-and-india-cyclone-floods-coastal-villages-blows-away-thatched-roofs-and-cuts-power", "imgURL": "https://d3i6fh83elv35t.cloudfront.net/static/2024/05/2024-05-27T042401Z_271715042_RC2QY7AIYTZL_RTRMADP_3_ASIA-WEATHER-BANGLADESH-INDIA-1024x683.jpg"}, {"news_number": 28, "title": "Lok Sabha elections: LGBTQ Indians are more accepted than ever - but politics hasn't caught up", "summary": "Lok Sabha elections: LGBTQ Indians are more accepted than ever - but politics hasn't caught up2 days ago By Zoya Mateen , BBC News, Delhi ShareGetty Images Despite progress, LGBTQ Indians have not found meaningful political representationMadhu Bai says she is like a rainbow.\nShe dances and sings with other hijras, or trans women, at weddings and birth ceremonies - a common livelihood in India's transgender community.\nMadhu's short but successful political foray in India is a rarity in a field where the LGBTQ community is still heavily underrepresented.\nDespite this, Mr Gawande insists that LGBTQ rights are a current that Indian politics can no longer dismiss.\nBut she hopes others from the community seek political opportunities, so that queer people are no longer seen as oddities.", "keywords": ["elections", "banu", "caught", "accepted", "trans", "lgbtq", "madhu", "court", "rights", "lok", "sabha", "community", "indians", "political", "transgender", "politics"], "url": "https://www.bbc.com/news/world-asia-india-68933715", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/6B97/production/_133334572_6.png"}, {"news_number": 29, "title": "Cyclone Remal blows away thatched roofs, cuts power in Bangladesh and India", "summary": "A cyclone has flooded coastal villages, blown away thatched roofs and left hundreds of thousands of people without power in southern Bangladesh and eastern India, with at least nine deaths reported.\nDozens of villages in Bangladesh were flooded after flood protection embankments either washed away or were damaged by Cyclone Remal.\nIn India’s West Bengal state, roofs on thatched houses were blown away while electric poles and trees were uprooted in some coastal districts.\nThe Kolkata airport reopened after being shut on Sunday, and Bangladesh shut down the airport in the southeastern city of Chattogram and cancelled all domestic flights to and from Cox’s Bazar.\nRemal was the first cyclone in the Bay of Bengal ahead of this year’s monsoon season, which runs from June to September.", "keywords": ["thousands", "away", "roofs", "cuts", "weakened", "villages", "state", "power", "thatched", "cyclone", "remal", "blows", "india", "bangladesh", "shut"], "url": "https://www.aljazeera.com/gallery/2024/5/27/photos-cyclone-remal-blows-away-thatched-roofs-cuts-power-in-bangladesh-and-india", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/AFP__20240527__34U43GN__v1__Preview__BangladeshWeatherCyclone-1716801872.jpg?resize=1200%2C630"}, {"news_number": 30, "title": "Brazil, India and Mexico are taking on China’s exports", "summary": "A t last, it seemed time for a manufacturing take-off.\nLast year foreign direct investment into China fell to a 30-year low.\nWeak domestic demand for traditional products, such as cars, chemicals and steel, mean they are also flooding global markets.\nThe average price of Chinese manufactured exports fell by nearly 10% from 2022 to 2023.\nChina’s export volumes have surged to near-record levels.", "keywords": ["china", "fell", "chinas", "taking", "brazil", "india", "investment", "west", "markets", "weak", "volumes", "mexico", "global", "surged", "exports"], "url": "https://www.economist.com/finance-and-economics/2024/05/23/brazil-india-and-mexico-are-taking-on-chinas-exports", "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240525_FNP002.jpg"}, {"news_number": 31, "title": "What India’s clout in white-collar work means for the world", "summary": "I ndia HAS long been seen as the world’s “back office”.\nThe question is whether GCC s will themselves be superseded, too, as India creates some world-beating global companies of its own.\nBut GCC s are increasingly important, too.\nA fifth of Goldman Sachs’s staff are in India, as are a fifth of the world’s chip designers.\nNew GCC s are opening at a rate of roughly one a week.", "keywords": ["gcc", "companies", "india", "whitecollar", "world", "work", "s", "office", "increasingly", "fifth", "worth", "global", "indias", "means", "worlds", "clout"], "url": "https://www.economist.com/leaders/2024/05/23/what-indias-clout-in-white-collar-work-means-for-the-world", "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240525_LDP501.jpg"}, {"news_number": 32, "title": "Hundreds of thousands evacuate as a severe cyclone approaches Bangladesh and India", "summary": "NEW DELHI (AP) — Bangladesh evacuated nearly 800,000 people from vulnerable areas on Sunday as the country and neighboring India awaited the arrival of a severe cyclone that has formed over the Bay of Bengal.\nThe storm is expected to cross Bangladesh and India’s West Bengal coasts around midnight Sunday.\nThis is the first cyclone in the Bay of Bengal ahead of this year’s monsoon season, which runs from June to September.\nModerate to heavy rainfall is expected in most places over coastal districts in India’s West Bengal state.\nA storm surge about 1 meter (3.1 feet) high is expected to flood low-lying areas of coastal West Bengal and Bangladesh.", "keywords": ["mph", "storm", "evacuate", "thousands", "approaches", "expected", "west", "hundreds", "bengal", "coastal", "midnight", "cyclone", "severe", "region", "india", "bangladesh"], "url": "https://www.pbs.org/newshour/world/hundreds-of-thousands-evacuate-as-a-severe-cyclone-approaches-bangladesh-and-india", "imgURL": "https://d3i6fh83elv35t.cloudfront.net/static/2024/05/2024-05-26T140913Z_1756437324_RC2CY7ALZC7M_RTRMADP_3_ASIA-WEATHER-BANGLADESH-INDIA-1024x683.jpg"}, {"news_number": 33, "title": "An Indigenous Mexican rain dance and feeling the heat in India: photos of the day – Tuesday", "summary": "El Bosque, Mexico View of debris from houses destroyed by rising sea levels and coastal erosion associated with the climate crisis in the community of El Bosque in Tabasco state.\nSeveral houses are already submerged under the waters of the Gulf of Mexico, but some of the walls and cisterns stand out as proof that there used to be a fishing village where 700 people livedPhotograph: Yuri Cortéz/AFP/Getty Images", "keywords": ["photos", "bosque", "day", "mexican", "rain", "india", "view", "yuri", "waters", "feeling", "walls", "el", "mexico", "indigenous", "village", "dance", "used", "houses", "heat"], "url": "https://www.theguardian.com/news/gallery/2024/may/28/an-indigenous-mexican-rain-dance-and-feeling-the-heat-in-india-photos-of-the-day-tuesday", "imgURL": "https://i.guim.co.uk/img/media/093ae721275fd6b5b08fe5b911915cc9f34cc2e6/0_576_8640_5184/master/8640.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=55473acc061862eb485ffad717640dd7"}, {"news_number": 34, "title": "Are you a robot?", "summary": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy.", "keywords": ["supports", "policy", "javascript", "sure", "review", "information", "loading", "happenplease", "service", "terms", "robot"], "url": "https://www.bloomberg.com/news/articles/2024-05-26/india-s-markets-brace-for-selloff-if-modi-bjp-disappoints-at-elections", "imgURL": ""}, {"news_number": 35, "title": "Are you a robot?", "summary": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy.", "keywords": ["supports", "policy", "javascript", "sure", "review", "information", "loading", "happenplease", "service", "terms", "robot"], "url": "https://www.bloomberg.com/news/newsletters/2024-05-27/modi-s-nation-building-pitch-to-india-s-voters", "imgURL": ""}, {"news_number": 36, "title": "Cyclone Remal slams into India, Bangladesh: What we know", "summary": "At least nine people were killed and more than a million were evacuated as Cyclone Remal approached the coasts of eastern India and Bangladesh, which made landfall late on Sunday.\nWhere did Cyclone Remal make landfall?\nUpdate cyclone #Remal@IndiaCoastGuard is closely monitoring the landfall of cyclone #Remal with disaster response team, Ships, Hovercraft standby at short notice to respond to post-impact challenges.\nWhere is Cyclone Remal now?\nWhere is Cyclone Remal likely to move next?", "keywords": ["know", "storm", "west", "remal", "bengal", "landfall", "power", "cyclone", "slams", "mongla", "india", "bangladesh"], "url": "https://www.aljazeera.com/news/2024/5/27/cyclone-remal-slams-into-india-bangladesh-what-we-know", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/AP24147386132831-1716795317.jpg?resize=1920%2C1440"}, {"news_number": 37, "title": "Modi’s Middling Economy", "summary": "Another explanation is that Modi has managed the economy well, with India recently overtaking the United Kingdom to become the fifth-largest economy in the world, and soon surpassing stagnant Germany and Japan to become the third largest.\nThe government’s 2016 ban on high-value currency notes hurt small and midsized businesses, which were further damaged by Modi’s mismanagement of the pandemic.\nIn the ongoing election, the opposition has strived to highlight Indians’ economic anxiety.\nAn economy led by services exports would follow a very different path from the manufacturing-led-exports path the government desires.\nThere are multiple reasons for Modi’s high ratings among those who are not simply attracted by his Hindutva agenda.", "keywords": ["services", "modi", "jobs", "middling", "economic", "world", "indian", "modis", "indians", "prime", "indias", "economy", "india"], "url": "https://www.foreignaffairs.com/india/modis-middling-economy", "imgURL": "https://cdn-live.foreignaffairs.com/sites/default/files/styles/social_share/public/images/2024/05/27/2024-01-31T120456Z_1211970507_RC2XS5A2FM45_RTRMADP_3_INDIA-BUDGET_e.jpg?itok=xRKf5po3"}, {"news_number": 38, "title": "Google ties up with Foxconn to make Pixel phones in India", "summary": "Google to make Pixel phones and drones in IndiaThe firm will make the phones at a facility in Tamil Nadu stateTech giant Google will soon begin making its Pixel smartphones in India, sources aware of the development have told the BBC.\nGoogle is set to manufacture the phones at an existing Foxconn facility in the southern state of Tamil Nadu.\nThe firm is also set to independently manufacture drones in the state.\nIndia has emerged as a key destination for global firms looking to diversify supply lines outside China in the midst of geopolitical tensions with the West.", "keywords": ["firm", "facility", "set", "phones", "tamil", "west", "ties", "foxconn", "manufacture", "drones", "google", "india", "pixel"], "url": "https://www.bbc.com/news/articles/cq55z7ynjyro", "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/bba8/live/a8639380-199e-11ef-8810-7ddce6503835.jpg"}, {"news_number": 39, "title": "Rise of Harmeet Singh: After setbacks on and off the field and selectorial rejection to playing for USA against India in T20 World Cup", "summary": "He will be playing against India for his new adopted country USA in the T20 world cup.\nIt has been a great week as his USA defeated Bangladesh in a series and Harmeet played his part, slamming unbeaten matchwinning 13-ball 33 runs.\nHe is not the lone Indian in the USA World Cup squad.\nThe dressing room environment is nice and talent is there, hope we will have a good World Cup,” Harmeet says.\nFor Harmeet’s father, it will be a proud moment to see his son play in the World Cup.", "keywords": ["son", "harmeet", "cricket", "t20", "india", "mumbai", "rise", "singh", "playing", "usa", "selectorial", "world", "played", "play", "setbacks", "life", "rejection"], "url": "https://indianexpress.com/article/sports/cricket/harmeet-singh-t20-world-cup-2024-spot-fixing-usa-team-mlc-9357401/", "imgURL": "https://images.indianexpress.com/2024/05/Harmeet-Singh.jpg"}, {"news_number": 40, "title": "PM Modi Unique, Both An Insider And Outsider: Fareed Zakaria To NDTV", "summary": "Mr Zakaria said there has been a global backlash against liberalism.\nMr Zakaria said India can also provide a counterweight in terms of upholding a rules-based international order, which it has historically been in favour of.\nIndia has the potential to be a rule maker, rather than a rule taker in the new world order.\nIt can shape the agenda, it can make the rules but, in order to do that, it has to live by them,\" Mr Zakaria emphasised.\n\"Prime Minister Modi is almost unique in that he has been able to both be an insider and an outsider.", "keywords": ["modi", "china", "outsider", "fareed", "unique", "insider", "order", "ndtv", "mr", "journalist", "theres", "term", "world", "country", "zakaria", "india"], "url": "https://www.ndtv.com/india-news/tremendous-goodwill-market-for-india-fareed-zakaria-to-ndtv-5766097", "imgURL": "https://c.ndtvimg.com/2024-05/lqvdc9_fareed-zakaria-interview_625x300_28_May_24.jpg"}, {"news_number": 41, "title": "Fires in India cause two tragedies just hours apart", "summary": "NewsFeed Fires in India cause two tragedies just hours apartAt least seven newborn babies have been killed in a fire at a children’s hospital in India’s capital, hours after a blaze left dozens dead at a family entertainment venue in Gujarat’s Rajkot district.", "keywords": ["tragedies", "apart", "venue", "fires", "newsfeed", "killed", "seven", "left", "rajkot", "indias", "cause", "india", "hours", "newborn"], "url": "https://www.aljazeera.com/program/newsfeed/2024/5/26/fires-in-india-cause-two-tragedies-just-hours-apart", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/Mini-SV_India-fires-in-24-hrs_WIDE-THUMB-CLEAN-1716727257.jpg?resize=1920%2C1080&quality=80"}, {"news_number": 42, "title": "‘They stole our jobs and life’: Anger and desperation in India’s coal belt", "summary": "The blanket order applied to all the coal mines in the country and ensured that coal mining would be exclusively reserved for the public sector.\nHowever, the Coal Mines (Nationalisation) Act of 1973 was amended in 1993 to allow limited private-sector participation in coal mining.\nTo cut down on coal imports, the Modi government has been leasing out coal mines to private companies.\nHe claimed that political parties benefit from the illegal coal business — getting cuts of the illicit profits.\nBut Narendra Nath Chakraborty, district president of the TMC, claimed that “it is the BJP which encourages the illegal coal mining in Raniganj coalfield area”.", "keywords": ["al", "stole", "jobs", "west", "mining", "near", "coal", "belt", "indias", "land", "mines", "told", "desperation", "illegal", "life", "india", "anger"], "url": "https://www.aljazeera.com/features/2024/5/28/they-stole-our-jobs-and-life-anger-desperation-along-indias-coal-belt", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/0H1A0675-1715251817-1-1716894632.jpg?resize=1920%2C1440"}, {"news_number": 43, "title": "Is Modi Worried? India’s Long-Deflated Opposition Finds Some Momentum.", "summary": "Prime Minister Narendra Modi entered India’s general election projecting supreme confidence.\n“Ab ki baar, 400 paar” went his party’s slogan, meaning this time his side was gunning to surpass 400 seats in the lower house of Parliament, a staggering majority.\nBut as the seven-week voting period enters its final stretch, with results expected on June 4, India is witnessing something unusual from its powerful leader.\nAs Mr. Modi crisscrosses the country for rallies in 100-degree heat, he has often appeared on the defensive, and sometimes rattled.\nHe has resorted to stoking anti-Muslim sentiments to fend off attempts to split his Hindu support base, only to deny his own words later.", "keywords": ["sweatas", "modi", "partys", "unusual", "worried", "opposition", "momentum", "witnessing", "400", "finds", "longdeflated", "words", "indias", "voting", "india", "went"], "url": "https://www.nytimes.com/2024/05/23/world/asia/india-election-modi-opposition.html", "imgURL": "https://static01.nyt.com/images/2024/05/23/multimedia/23india-election-analysis-01-jcqf/23india-election-analysis-01-jcqf-facebookJumbo.jpg"}, {"news_number": 44, "title": "Adani plans push into Indian ecommerce and payments", "summary": "Try unlimited access Only ₹100 for 4 weeksThen ₹4,335 per month.\nComplete digital access to quality FT journalism on any device.\nCancel anytime during your trial.", "keywords": ["adani", "try", "digital", "journalism", "quality", "monthcomplete", "ecommerce", "trial", "ft", "payments", "plans", "unlimited", "push", "weeksthen", "indian", "access"], "url": "https://www.ft.com/content/4fe02936-cc61-4c86-8f34-f30bce973153", "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/ftlogo-v1%3Abrand-ft-logo-square-coloured?source=update-logos&format=svg"}, {"news_number": 45, "title": "Narendra Modi as India’s Head Coach: BCCI receives fake applications to replace Rahul Dravid", "summary": "However, according to The Indian Express, many are under fake names, including those pretending to be former cricketers and politicians.\nFake applicants used names like Narendra Modi, Amit Shah, Sachin Tendulkar and MS Dhoni to apply for the job.\nIn 2022, when the BCCI sought a new head coach, they got about 5,000 fake applications under celebrity names, the publication added.\nBut, this time, the BCCI used Google Forms.\nDoctor with gully cricket experienceA doctor with gully cricket experience claimed to have applied for the position and justified his credentials in a hilarious post.", "keywords": ["cricket", "coach", "narendra", "indias", "replace", "gully", "head", "receives", "dravid", "unplayable", "applications", "modi", "fake", "names", "rahul", "used", "applicants", "bcci", "google"], "url": "https://www.livemint.com/sports/cricket-news/narendra-modi-as-india-s-head-coach-bcci-receives-fake-applications-to-replace-rahul-dravid-11716873310533.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/28/1600x900/PTI03-05-2024-000197A-0_1716873494569_1716873531138.jpg"}, {"news_number": 46, "title": "‘Project Cheetah is a distraction that conservation in India can ill afford’", "summary": "If yes, will it be possible to sustain a free-ranging cheetah population in the long run?\nThere was even some talk of trying to clone the Asiatic cheetah, but Iran refused to supply the required biological material, he adds.\nThere is yet another issue related to the Cheetah project which has not received enough attention.\nThe same judgment also quashed the plan to introduce the African cheetahs, Chellam says.\nHe also disputes the claim being made that Project Cheetah is on the road to success.", "keywords": ["africa", "population", "distraction", "wild", "project", "african", "ill", "conservation", "cheetah", "chellam", "asiatic", "afford", "cheetahs", "india"], "url": "https://www.thehindu.com/sci-tech/energy-and-environment/project-cheetah-is-a-distraction-that-conservation-in-india-can-ill-afford/article68220697.ece", "imgURL": "https://th-i.thgim.com/public/incoming/pa1p8d/article68221932.ece/alternates/LANDSCAPE_1200/IMG_Cheetahs_released_in_2_1_BOBIOQ6N.jpg"}, {"news_number": 47, "title": "Indian peacekeeper Major Radhika Sen to receive prestigious 2023 UN military gender advocate of the year award", "summary": "NEW DELHI: Major Radhika Sen , an Indian woman peacekeeper, is set to receive a prestigious military gender advocate award from the United Nations .\n\"Major Sen served with the United Nations Organisation Stabilisation Mission in the Democratic Republic of the Congo (MONUSCO).\n\"Born in Himachal Pradesh in 1993, Major Sen joined the Indian Army eight years ago.\nShe completed her tenure in April 2024.Major Sen becomes the second Indian peacekeeper to receive this prestigious award.\nCurrently, 124 Indian women are deployed in various missions.", "keywords": ["peacekeeping", "women", "receive", "peace", "peacekeeper", "nations", "major", "prestigious", "gender", "radhika", "united", "sen", "indian", "military", "award"], "url": "https://timesofindia.indiatimes.com/india/indian-peacekeeper-major-radhika-sen-to-receive-prestigious-2023-un-military-gender-advocate-of-the-year-award/articleshow/110503586.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110503821,width-1070,height-580,imgsize-1178822,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 48, "title": "ICC T20 World Cup 2024: Can Rohit Sharma’s India win the World Cup?", "summary": "An experienced India side will look to leave last year’s heartache behind as they plot their way to T20 World Cup glory.\n“It [50-over World Cup] will be an inspiration because there were a lot of positives that they can take into the T20 World Cup as well,” he said.\nIndia won the inaugural edition of the T20 World Cup in 2007.\nKohli was the player of the tournament at the 2023 Cricket World Cup.\nAt 35 years of age, the T20 World Cup could mark his last attempt to add another trophy to a glittering career and Kohli is not one to miss too many chances.", "keywords": ["2024", "west", "t20", "sharmas", "win", "yadav", "world", "cup", "rohit", "50over", "icc", "final", "indias", "game", "india"], "url": "https://www.aljazeera.com/sports/2024/5/28/icc-t20-world-cup-2024-india-team-preview", "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/AP23302578353982-1716842095.jpg?resize=1920%2C1440"}, {"news_number": 49, "title": "'Narendra Modi', 'Sachin Tendulkar', 'Amit Shah' Apply For India Coach Job", "summary": "The deadline for submitting applications for Team India's head coach has passed, with the Board of Control for Cricket in India (BCCI) reportedly receiving more than 3000 applications.\nThough former India cricketer Gautam Gambhir reportedly leads the race, a few others with some famous names like Narendra Modi, Sachin Tendulkar, and Amit Shah have also applied for the role.\nWith the BCCI deciding to make the application for Team India's head coach public, many random people filled the form and submitted applications, using fake names of famous celebrities and political leaders.\nTeam India's current head coach Rahul Dravid will see his stint come to an end after the conclusion of the T20 World Cup 2024.\nPost the marquee event, the BCCI would hope to assign a new head coach with the Indian team.", "keywords": ["tendulkar", "applications", "team", "modi", "reportedly", "apply", "coach", "amit", "names", "shah", "head", "narendra", "indian", "sachin", "bcci", "indias", "india", "job"], "url": "https://sports.ndtv.com/cricket/narendra-modi-sachin-tendulkar-amit-shah-apply-for-india-coach-job-5761761", "imgURL": "https://c.ndtvimg.com/2024-05/2u1t4iio_rahul-dravid-bcci_625x300_28_May_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675"}, {"news_number": 50, "title": "T20 World Cup rewrite: India unpredictable, Pakistan not unpredictable, England likeable, Kiwis chokers", "summary": "The game and the teams need a fresh look as the T20 World Cup moves out of conventional cricketing boundaries.\nIn the one final they made, they did well to post the highest score of 172 in all T20 World Cup finals.\nPakistan: Not unpredictableBabar Azam and Mohammed Rizwan during a 2023 ODI World Cup game.\n(FILE) Babar Azam and Mohammed Rizwan during a 2023 ODI World Cup game.\nDavid Warner and Glenn Maxwell have a title, but haven’t set the T20 World Cup on fire.", "keywords": ["team", "unpredictable", "making", "pakistan", "t20", "odi", "teams", "win", "kiwis", "world", "rewrite", "cup", "lost", "england", "likeable", "game", "india"], "url": "https://indianexpress.com/article/sports/cricket/t20-world-cup-2024-adjectives-india-pakistan-england-kiwis-9357862/", "imgURL": "https://images.indianexpress.com/2024/05/T20-World-Cup-team-adjectives.jpg"}, {"news_number": 51, "title": "Telangana woman studying in US university killed by speeding car in Florida", "summary": "A 25-year-old student from Telangana's Yadadri Bhuvanagiri district was killed in a road accident in Florida, US.\nGuntipalli Sowmya, who had completed her master's from Florida Atlantic University, was hit by a speeding car while crossing the road on May 26.\nadvertisementShe went to the US two years ago to pursue her studies.\nSowmya's family has appealed to the government for assistance in bringing her body back to Telangana.\nKoteshwara Rao, a former CRPF jawan, shared that his daughter had recently celebrated her 25th birthday on May 11.", "keywords": ["pursue", "masters", "telangana", "woman", "car", "studies", "accident", "yadagaripalle", "killed", "according", "rao", "university", "studying", "road", "florida", "speeding"], "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-student-killed-us-florida-speeding-car-florida-atlantic-university-telangana-2544686-2024-05-28", "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202405/telangana-student-killed-in-florida-284818701-16x9_0.png?VersionId=ll680JIGw_Nzq0IzewHNLF_TrNosZHxv"}, {"news_number": 52, "title": "\"Desh Ke Liye\": Inside Details Of Jay Shah-Gautam Gambhir Conversation On India Coach Selection - Report", "summary": "The official deadline for application submission for the post of Indian cricket team coach selection is over.\nAfter this statement, the general consensus was that he was indicating towards an Indian coach for the Indian cricket team.\nNow, a report in Cricbuzz has claimed the inside details of the conversation between Jay Shah and Gautam Gambhir after the IPl 2024 final.\nAnd the conversation between Jay Shah and Gambhir is understood to be centred around this idea,\" the report said.\nThere is no confirmation from any side that Gautam Gambhir has formally applied for the coach's role.", "keywords": ["team", "selection", "inside", "jay", "cricket", "gambhir", "coach", "gautam", "shah", "ke", "details", "indian", "bcci", "liye", "shahgautam", "india", "ipl", "report"], "url": "https://sports.ndtv.com/cricket/desh-ke-liye-inside-details-of-jay-shah-gautam-gambhir-conversation-on-india-coach-selection-report-5764486", "imgURL": "https://c.ndtvimg.com/2024-05/m3vc4afg_gambhir-jay-shah_625x300_27_May_24.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675"}, {"news_number": 53, "title": "India, France to begin negotiations this week in mega Rs 50,000 crore 26 Rafale Marine jet deal", "summary": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelIn a significant development, contract negotiations between the governments of India and France in the over Rs 50,000 crore deal for 26 Rafale Marine fighter jets is scheduled to begin on May 30 with the arrival of a high-level French team New Delhi.The French side would meet with Indian Defence Ministry counterparts to begin official negotiations in the fighter jet deal for the Indian Navy under which aircraft would be operated from both aircraft carriers operated by the force, defence industry officials told ANI.The French team will include officials from their defence ministry and industry including original equipment manufacturers Dassault Aviation and Thales , the officials said.The Indian side would include members from the defence acquisition wing and the Indian Navy.Sources in the government said that they would try to complete negotiations with France and sign the agreement by the end of this financial year.France had submitted its response to India's tender for buying 26 Rafale Marine jets for the Indian Navy's aircraft carriers - INS Vikrant and INS Vikramaditya in December itself.The response to India's Letter of Acceptance had been submitted by France in New Delhi.The Indian side has carried out a detailed study of the French bid for the Indian deal including the commercial offer or price for the aircraft, along with other details of the contract, they said.India will now go in for tough negotiations in the deal with French government officials, as it is a government-to-government contract.The Navy Chief has directed his team to ensure that the timeframe required for the project is squeezed significantly to ensure early finalisation and induction of the planes in the inventory.", "keywords": ["jet", "team", "negotiations", "subscribe", "french", "defence", "deal", "officials", "aircraft", "week", "mega", "marine", "france", "indian", "rs", "india", "rafale"], "url": "https://m.economictimes.com/news/defence/india-france-to-begin-negotiations-this-week-in-mega-rs-50000-crore-26-rafale-marine-jet-deal/articleshow/110493857.cms", "imgURL": "https://img.etimg.com/thumb/msid-110499888,width-1200,height-630,imgsize-49958,overlay-etdefence/photo.jpg"}, {"news_number": 54, "title": "No MotoGP in India in 2024 as race shifted to 2025", "summary": "\"It was mutually decided to shift the race to March next year.\n\"All payments were being made in between and whatever is left will be paid by next month.\nSo that was not really a factor in shifting the race to next year.\nThe Uttar Pradesh government, previously a sponsor, has now transitioned into a co-promoter role, fostering optimism for the event's long-term future.The 2023 MotoGP round in India, which saw Marco Bezzecchi emerge victorious, marked the most significant motorsports event in the country since the last Formula 1 race in 2013.\nFormula 1's tenure in India was brief, lasting only three years due to financial and taxation issues.", "keywords": ["2024", "weather", "dorna", "tough", "motogp", "race", "uttar", "2025", "round", "told", "promoters", "shifted", "india"], "url": "https://timesofindia.indiatimes.com/sports/racing/top-stories/no-motogp-in-india-in-2024-as-race-shifted-to-2025/articleshow/110502581.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110502575,width-1070,height-580,imgsize-14768,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 55, "title": "A young Frenchman's nightmarish trip to India", "summary": "LETTER FROM NEW DELHIValentin Hénault, in a village with Dalit women, Uttar Pradesh (India), 2023.\n/ LE MONDEValentin Hénault arrived in India on August 10, 2023, planning to stay for two months.\nOn October 10, 2023, in Gorakhpur, a demonstration − \"the Ambedkar people's march\" − was held by peasant women demanding land for the Dalits.\nFollowing a few routine questions, the young man was let go.\nThey claimed that the young man had specified on his visa application a reference contact in Dhanbad and was therefore not allowed to leave Jharkhand.", "keywords": ["young", "village", "women", "frenchmans", "trip", "film", "hénault", "dalit", "nightmarish", "2023", "man", "india", "stay"], "url": "https://www.lemonde.fr/en/international/article/2024/05/28/a-young-frenchman-s-nightmarish-trip-to-india_6672861_4.html", "imgURL": "https://img.lemde.fr/2024/05/25/0/208/864/576/1440/960/60/0/2d1887c_1716608292125-photo-2024-05-24-14-06-45.jpg"}, {"news_number": 56, "title": "Chinese 'allegedly invaded' India in 1962: Mani Shankar Aiyar sparks fresh row", "summary": "NEW DELHI: Former Union minister and Congress leader Mani Shankar Aiyar on Tuesday triggered row when he said that the Chinese in 1962 \" allegedly invaded India\".\n\"In October 1962, the Chinese allegedly invaded India,\" he said at a book release event.Recalling the time he took exam for Indian Foreign Service, he said, \"On the day, Tawang fell, the Foreign Service exams began in London.\nAfter I passed the foreign service exam, and I had done very well.\nI was not able to raise money for my dinner, how will I raise money for the Chinese?\nThey are a respected nation.", "keywords": ["row", "foreign", "aiyar", "rejected", "sparks", "india", "fresh", "pakistan", "nation", "shankar", "bomb", "respected", "allegedly", "chinese", "money", "service", "mani", "invaded"], "url": "https://timesofindia.indiatimes.com/india/chinese-allegedly-invaded-india-in-1962-mani-shankar-aiyar-sparks-fresh-row/articleshow/110506217.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110506751,width-1070,height-580,imgsize-44916,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 57, "title": "Ukraine war keeps Air India on top of non-stop routes to US; can the Tata Group airline maintain pole position?", "summary": "The Tata Group took control of Air India in the last days of January 2022.\nAir India operated 33 non-stop flights per week to the US pre-COVID.\nOn the other side of COVID, Air India now operates 51 weekly non-stops to the United States.\nInterestingly, of all its routes to the US, Air India launched the ones to San Francisco the last, but today it has maximum capacity out of San Francisco.\nWill it proceed as planned and help Air India deploy the refurbished planes to the United States?", "keywords": ["keeps", "position", "ukraine", "francisco", "air", "tata", "pole", "maintain", "india", "san", "american", "weekly", "routes", "states", "united", "war", "nonstop"], "url": "https://www.livemint.com/companies/ukraine-war-air-india-non-stop-routes-to-us-american-delta-united-aviation-tata-group-b777s-11716799274426.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/27/1600x900/Air_india_1700183184005_1716800654296.JPG"}, {"news_number": 58, "title": "Ananya Panday Stars in Riches to Rags Drama Series ‘Call Me Bae’ at Prime Video India (EXCLUSIVE)", "summary": "Karan Johar, Apoorva Mehta and Somen Mishra as executive producers give a glitzy pedigree to “Call Me Bae,” a new Hindi-language drama series set to launch on Prime Video in September.\nThe eight-part Prime Video original series is a Dharmatic Entertainment production.\nHis Dharma Productions and Dharmatic Entertainment have various supply deals with Netflix and Prime Video.\nJohar’s companies have previously produced theatrical film “Yodha” and the upcoming Vicky Kaushal-starring comedy “Bad Newz” for Prime Video.\nwas part of a massive 69-title 2024 slate of new and returning series and original and licensed films, unveiled by Prime Video in India in March.", "keywords": ["bae", "johar", "video", "india", "series", "moitra", "original", "drama", "riches", "productions", "stars", "exclusive", "rags", "prime", "producers", "panday", "set"], "url": "https://variety.com/2024/global/news/ananya-panday-call-me-bae-prime-video-india-1236016991/", "imgURL": "https://variety.com/wp-content/uploads/2024/05/CallMeBae3x2cr-res.jpg?w=1000&h=563&crop=1"}, {"news_number": 59, "title": "India, France to begin contract negotiations for 26 Rafale-Marine jets this week", "summary": "NEW DELHI: India will kick off official contract negotiations with France this week for the mega acquisition of 26 Rafale-Marine fighters for over Rs 50,000 crore, with the Navy keen on inducting the supersonic jets for its two aircraft carriers as soon as possible due to the expanding Chinese threat in the Indian Ocean Region.A team of officials from the French government, fighter-manufacturer Dassault and weapon systems integrator Thales, among others, is arriving here on May 30 for the talks with the contract negotiation committee (CNC) constituted by the Indian defence ministry.This comes after the MoD and Navy evaluated the bid or letter of acceptance (LoA) submitted by France in December in response to India’s letter of request (LoR) for the acquisition of 22 single-seat jets and four twin-seat trainers, along with weapons, simulator, spares, crew training and logistics support.“It took time to examine the voluminous LoA with its offer, technical specifications, costs and other details.\nThe CNC is headed by an official from the MoD acquisitions wing and includes representatives from the Navy,” an official said.The aim is to conclude the techno-commercial negotiations and ink the government-to-government deal, after the requisite approval by the PM-led cabinet committee on security, within this financial year.The proposed deals for the 26 Rafale-Ms and three additional Scorpene submarines to be built at Mazagon Docks for around Rs 30,000 crore were granted acceptance of necessity by the Rajnath Singh-led Defence Acquisitions Council on July 13 last year, a day before the subsequent Modi-Macron summit in Paris.The Navy only has 40 of the 45 MiG-29K jets, inducted from Russia at a cost of $2 billion from 2009 onwards, to operate from the decks of its two over 40,000-tonne aircraft carriers, the older Russian-origin INS Vikramaditya and the new indigenous INS Vikrant.\nThe MiG-29Ks have also been dogged by poor serviceability and other problems over the years.With the indigenous twin-engine deck-based fighter (TEDBF) likely to take at least a decade to become operational, the Navy had pushed for the 26 Rafale-M jets as an interim measure.\nThe IAF has already inducted 36 Rafales under the Rs 59,000 crore deal inked with France in September 2016.China is now conducting trials of its third aircraft carrier, the over 80,000-tonne Fujian, after earlier inducting the 60,000-tonne Liaoning and the 66,000-tonne Shandong, and building more such warships.The Indian government, in contrast, is yet to even give the preliminary nod for the long-pending case for a third 45,000-tonne aircraft carrier, let alone a more potent 65,000-tonne one, which will take at least a decade to build.The US has 11 `super’ 90,000-100,000-tonne nuclear-powered carriers, each of which can carry 70-80 fighters and aircraft.\nSignificantly, the Fujian -- like the newest American carrier USS Gerald R Ford -- has an electromagnetic catapult system to also launch much heavier aircraft for surveillance, early-warning and electronic warfare.While the 10 US Nimitz-class carriers have steam-powered catapults, INS Vikramaditya and INS Vikrant as well as Liaoning and Shandong have only angled ski-jumps that allow fighters to take off under their own power.", "keywords": ["negotiations", "fighters", "rafalemarine", "26", "india", "navy", "aircraft", "contract", "carriers", "begin", "week", "indian", "official", "france", "rs", "ins", "jets"], "url": "https://timesofindia.indiatimes.com/india/india-france-to-begin-contract-negotiations-for-26-rafale-marine-jets-this-week/articleshow/110507112.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110507095,width-1070,height-580,imgsize-327420,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 60, "title": "India Needs Strong Leader, Global Conflicts Won't End Quickly: S Jaishankar", "summary": "The world is in a tense situation as ongoing conflicts are not likely to end so quickly and in this scenario, India needs a strong and powerful leader with standing and respect and a stable government, External Affairs Minister S Jaishankar said on Tuesday.\nInteracting with a selective group of media persons in Shimla, he said there are ongoing conflicts in Russia-Ukraine and Israel-Gaza-Iran and there are issues on the Indian borders too, adding a clear message should go that India has a strong leadership.\n\"The world is in a tense situation and the ongoing conflicts would not end so quickly and that's why India needs a stable government, a strong and powerful leader with networking, standing and respect,\" he said.\n\"I see four years of difficult times ahead and the electorates should wisely vote as similar conflicts could happen on our borders,\" he told the media persons.\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)", "keywords": ["quickly", "jaishankar", "border", "standing", "india", "leader", "minister", "world", "s", "tense", "conflicts", "strong", "global", "needs", "stable", "wont", "end", "ongoing"], "url": "https://www.ndtv.com/india-news/india-needs-strong-leader-global-conflicts-wont-end-quickly-s-jaishankar-5764445", "imgURL": "https://c.ndtvimg.com/2024-05/2q08a96g_s-jaishankar_625x300_23_May_24.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=738?ver-20240506.08"}, {"news_number": 61, "title": "BCCI receives surprise MS Dhoni proposal as India coach from Virat Kohli’s close connection amid Gambhir reports", "summary": "File photo of MS Dhoni (R) with Virat Kohli during T20 World Cup 2021(ANI)The Dronacharya awardee coach floated in legendary cricketer MS Dhoni's name.\nWhen he took over as captain, the Indian team was filled with big names and Dhoni managed things quite well.\nDhoni had worked with the Indian team as a mentor during their campaign in the 2021 T20 World Cup in the UAE.\nFormer India fast bowler Atul Wasan offered a different perspective on the role of a coach in T20 cricket.\nDravid's contract as India's head coach will end this year after the T20 World Cup.", "keywords": ["team", "virat", "kohlis", "cricket", "t20", "receives", "gambhir", "coach", "teams", "reports", "ms", "world", "surprise", "cup", "indian", "dhoni", "proposal", "india"], "url": "https://www.hindustantimes.com/cricket/bcci-jay-shah-receive-surprise-ms-dhoni-proposal-as-india-head-coach-from-virat-kohli-s-coach-amid-gambhir-reports-101716868099123.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/28/1600x900/Virat_Kohli_MS_Dhoni_1636427886192_1716868798628.jpg"}, {"news_number": 62, "title": "Gautam Gambhir As India Coach \"Done Deal, Announcement Soon\"? Report Claims 'High-Profile IPL Team Owner' Said This", "summary": "Is Gautam Gambhir the next Indian cricket team head coach?\nNow, it seems that Gambhir's name is being thought about as the next Indian cricket team coach.\nThe official deadline for application submission for the post of Indian cricket team coach selection is over.\nIt claimed that a \"very high-profile owner of an IPL franchise, who is very close to the BCCI top brass\" told the publication that former India star's appointment as Indian cricket team coach is a \"done deal and the announcement will come soon\".\nWe are focused on identifying individuals who possess a deep understanding of the Indian cricket structure and have risen through the ranks,\" Shah said.", "keywords": ["team", "understanding", "cricket", "deal", "gambhir", "coach", "gautam", "shah", "structure", "owner", "report", "indian", "highprofile", "told", "soon", "india", "ipl"], "url": "https://sports.ndtv.com/cricket/gautam-gambhir-as-india-coach-done-deal-announcement-soon-report-claims-high-profile-ipl-team-owner-said-this-5764853", "imgURL": "https://c.ndtvimg.com/2024-05/hkkt5ln_srk-gambhir_625x300_28_May_24.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675"}, {"news_number": 63, "title": "Weather tracker: Cyclone Remal lashes coast of Bangladesh and India", "summary": "During the early hours of Saturday morning, an area of low pressure over the east-central Bay of Bengal intensified, and has been named Cyclone Remal.\nCyclone Remal made landfall between Sagar Island in West Bengal, India, and Bangladesh’s Khepupara region late on Sunday as the India Meteorological Department (IMD) issued warnings for heavy rain, strong winds, storm surges, and rough seas.\nCumulative rainfall totals through the first half of this week could reach 200-300mm across the majority of Bangladesh, north-eastern states of India, and West Bengal.\nKolkata airport in West Bengal suspended all flight operations for 21 hours from Sunday, leading to the cancellation of almost 400 flights, affecting 63,000 passengers.\nEleven people have already died of suspected heat-related causes across western India and Pakistan late last week, with 486 suspected heatstroke cases in India on 22 May alone.", "keywords": ["tracker", "weather", "coast", "west", "pakistan", "high", "bengal", "imd", "temperatures", "lashes", "western", "power", "cyclone", "remal", "week", "india", "bangladesh"], "url": "https://www.theguardian.com/world/article/2024/may/27/weather-tracker-cyclone-remal-lashes-coast-of-bangladesh-and-india", "imgURL": "https://i.guim.co.uk/img/media/d1cd4c9014f4b2991ad51ff932835412c0af6122/0_227_4322_2593/master/4322.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1423cbf9fc891983e604e0ac899da02e"}, {"news_number": 64, "title": "Indian woman peacekeeper Major Radhika Sen to receive UN military gender advocate of the year award. Who is she?", "summary": "Indian woman peacekeeper Major Radhika Sen, who served with the UN mission in Congo, will be honoured with the prestigious military gender advocate award by UN Secretary-General Antonio Guterres on May 30 (Thursday), marking the International Day of UN Peacekeepers.\nMajor Radhika Sen(X/Sidhant Sibal)Who is Major Radhika Sen?\nMajor Radhika Sen joined the Indian Army eight years ago.\nSen is the second Indian peacekeeper to receive this prestigious award, following Major Suman Gawani, who served with the UN Mission in South Sudan (UNMISS) and was honoured with the United Nations military gender advocate of the year award in 2019.\nUN Secretary-General Antonio Guterres lauded Major Sen for her service and said she was a true leader and role model.", "keywords": ["receive", "peace", "woman", "mission", "peacekeeper", "nations", "major", "gender", "radhika", "united", "sen", "indian", "military", "award"], "url": "https://www.hindustantimes.com/india-news/indian-woman-peacekeeper-major-radhika-sen-to-receive-un-military-gender-advocate-of-the-year-award-who-is-she-101716902061633.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/28/1600x900/radhikasen_1716903511808_1716903522195.jpg"}, {"news_number": 65, "title": "India-Pak cricket fever spawns a travel bug few can afford", "summary": "NEW DELHI : Mohit Gupta, a wealthy individual in his mid-40s in Gurugram, is packing his bags to go watch the India-Pakistan cricket match in New York city.\nNever before has any international-level cricket tournament been played on American soil, home to a vast diaspora from the two Asian neighbours.\nDreamSetGo, another Mumbai-based sports travel company and an official partner for the International Cricket Council (ICC) T20 World Cup, has sold out its packages for the India-Pakistan clash.\nTo be sure, at those prices, global sports travel is still a luxury in India that few can afford.\nStill, Raghav Gupta, founder of Fanatic Sport, insists there is sufficient demand for the company’s packages tailored for the India-Pakistan cricket match in New York.", "keywords": ["olympics", "travel", "cricket", "indiapak", "spawns", "fever", "indiapakistan", "world", "bug", "match", "indians", "packages", "afford", "india", "york"], "url": "https://www.livemint.com/companies/indiapak-cricket-match-new-york-global-sports-travel-11716866710894.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/28/1600x900/ANI-20240223140-0_1710516722317_1716867169589.jpg"}, {"news_number": 66, "title": "Nawaz Sharif says Pakistan 'violated' agreement with India signed by him and Vajpayee in 1999", "summary": "NEW DELHI: Former Pakistan PM Nawaz Sharif on Tuesday said that Islamabad \"violated\" the agreement signed between him and his Indian counterpart Atal Bihari Vajpayee in 1999 which was followed by Kargil war .\n\"On May 28, 1998, Pakistan carried out five nuclear tests.\nAfter that Vajpayee Saheb came here and made an agreement with us.\nBut we violated that agreement...it was our fault,\" Sharif said.Following a historic summit held in New Delhion February 21, 1999, Sharif and Vajpayee signed the Lahore Declaration .\n\"President Bill Clinton had offered Pakistan USD 5 billion to stop it from carrying out nuclear tests but I refused.", "keywords": ["1999", "kargil", "signed", "imran", "nuclear", "violated", "pakistan", "sharif", "agreement", "islam", "tests", "vajpayee", "nawaz", "india"], "url": "https://timesofindia.indiatimes.com/india/nawaz-sharif-says-pakistan-violated-agreement-with-india-signed-by-him-and-vajpayee-in-1999/articleshow/110504082.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110504491,width-1070,height-580,imgsize-662471,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 67, "title": "'Desh ke liye karna hai': Gautam Gambhir, Jay Shah's conversation as BCCI's search for next India head coach almost over", "summary": "Unlock exclusive access to the latest news on India's general elections, only on the HT App.\nShah further clarified that BCCI is eager to sign an Indian as a head coach, given that the veteran player would be aware of the domestic structure.\nOn Tuesday, after the deadline date for submitting the application, a report in Cricbuzz hinted towards the crux of Shah and Gambhir's meeting.\nIt said both believe that 'desh ke liye karna hai (we must do it for the country).'\nA report earlier last week in Dainik Jagran added that Shah Rukh urged Gambhir to stay with KKR for 10 season while offering a blank cheque to him.", "keywords": ["karna", "shahs", "search", "jay", "head", "gambhir", "coach", "gautam", "shah", "role", "ke", "world", "win", "hai", "indian", "bcci", "liye", "india"], "url": "https://www.hindustantimes.com/cricket/desh-ke-liye-karna-hai-gautam-gambhir-jay-shah-conversation-bcci-search-for-next-india-head-coach-almost-over-101716899710851.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/28/1600x900/CRICKET-IND-IPL-T20-HYDERABAD-KOLKATA-100_1716834137601_1716900200586.jpg"}, {"news_number": 68, "title": "Modenik Lifestyle names LV Vaidyanathan, former CEO of P&G India, as executive chairman", "summary": "Innerwear maker Modenik Lifestyle Pvt Ltd, backed by Advent International, has announced the appointment of L.V.\nVaidyanathan, former chief executive and managing director at P&G India, as its executive chairman effective July.\nCEO at MNCs are moving to PE-backed firmsShantanu Khosla, board member, Modenik Lifestyle, noted the broader trend of multinational CEOs moving to private-equity-backed companies in India.\nAdvent International acquired a 60% stake in Dixcy Textiles in 2017, and bought the remaining 40% in 2019.\nIn December 2021, Advent merged Dixcy Textiles and Gokaldas Intimatewear to create Modenik Lifestyle, focused on intimate wear and casual clothing for men and women.", "keywords": ["lv", "textiles", "tewari", "names", "modenik", "executive", "dixcy", "pg", "vaidyanathan", "chairman", "ceo", "lifestyle", "advent", "india"], "url": "https://www.livemint.com/companies/news/modenik-lifestyle-names-lv-vaidyanathan-former-ceo-and-md-of-p-g-india-as-executive-chairman-11716880878741.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/28/1600x900/LV_Vaidyanathan_1716881164418_1716881164956.jpg"}, {"news_number": 69, "title": "Why elections in India, the world’s largest democracy, are crucial to watch", "summary": "Over the weekend, in an election campaign rally in northwest India, Modi referred to Muslims as “infiltrators.” His critics have called it hate speech.\nNearly 200 million Muslims call India their home, making up the third largest population of Muslims in the world.\nwith questions as to who is next on the list,” said Raqib Naik, a U.S.-based journalist and founder of India Hate Lab, a research group that documents hate speech and polarization.\nIn 2023, India Hate Lab documented 668 hate speech events targeting Muslims, 3/4th of them were in BJP ruled states and federally governed territories.\nAnd this has been deliberate and systematic,” said Naik of India Hate Labs.", "keywords": ["modi", "watch", "china", "freedom", "singh", "democracy", "largest", "crucial", "indian", "modis", "muslims", "hate", "indias", "india", "worlds", "elections"], "url": "https://www.pbs.org/newshour/world/why-elections-in-india-the-worlds-largest-democracy-are-crucial-to-watch", "imgURL": "https://d3i6fh83elv35t.cloudfront.net/static/2024/04/2024-04-22T142102Z_897427929_RC2YW6AWY7WF_RTRMADP_3_INDIA-ELECTION-RELIGION-MODI-1024x685.jpg"}, {"news_number": 70, "title": "Best massage chairs in India 2024: Top 6 picks for maximum relaxation at home or office", "summary": "Best massage chairs provide muscle relaxation, improve blood circulation, reduce stress and promote overall well-being.\nIn this article, we're going to check out six of the best massage chairs you can buy right now.\nPazidom Portable Massage Chair Tattoo Chair 4 Inch Thick Sponge Height Adjustable Massage Chair Light Weight Therapy Chair Foldable Spa Chair w/Face Cradle Carrying Bag, Load Capacity 250LBS, BlackConstructed with a sturdy metal frame, Pazidom Portable Massage Chair is lightweight yet robust, capable of supporting up to 250 lbs with a static capacity of 700 lbs.\nRoboTouch Leather Echo Plus Full Body Massage Chair (Black)The RoboTouch Leather Echo Plus Full Body Massage Chair in black is a luxurious and high-tech solution for comprehensive body massage.\nHere are 10 best recliners to choose fromWhat are the best massage chair brandsBeatXP and Lifelong stand out as reputable massage chair brands due to their commitment to quality, innovation, and user satisfaction.", "keywords": ["2024", "maximum", "relief", "best", "experience", "india", "features", "chairs", "leather", "office", "chair", "picks", "relaxation", "massage", "body"], "url": "https://www.hindustantimes.com/lifestyle/health/best-massage-chairs-top-6-picks-for-maximum-relaxation-at-home-or-office-101716883506052.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/28/1600x900/massage_chair_1716885551336_1716885565573.jpg"}, {"news_number": 71, "title": "Advantage BJP or Congress? What low voter turnout in Lok Sabha polls could mean", "summary": "Some suggest that low voter turnout could disadvantage the Bharatiya Janata Party, while others believe it might harm the Congress more.The BJP, along with other opposition parties and the Congress, both claimed that the low voter turnout would be harmful.\nIn 2014, the voter turnout percentage in Amethi was 52.38%, which was in favor of Rahul Gandhi.\nNow, in 2024, Amethi reported a voter turnout of 54.34%.\nA significant reason cited is the intense heat wave experienced during the 2024 elections.\nAdditionally, the 2024 Lok Sabha elections were scheduled 15 days earlier than the 2019 elections, which may have also contributed to the lower turnout.", "keywords": ["2024", "bjp", "low", "turnout", "advantage", "phase", "congress", "lok", "voter", "mean", "data", "sabha", "polls", "commission", "days", "voters", "election", "elections"], "url": "https://timesofindia.indiatimes.com/india/lok-sabha-polls-2024-awaiting-june-4-what-voter-turnout-across-phases-suggests-bjp-congress-nda-alliance-result-phase-7-amethi-india-bloc/articleshow/110496953.cms", "imgURL": "https://static.toiimg.com/thumb/msid-110497467,width-1070,height-580,imgsize-898376,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"}, {"news_number": 72, "title": "Raghuram Rajan on politics: ''My business is not kissing babies''", "summary": "He was referring to the cliched practice, especially in the US, of politicians kissing babies while on election campaign to appear amiable and caring.\nRaghuram Rajan is walking step by step along with Rahul Gandhi.\nHis meeting with Thackeray triggered speculation that he could contest the Lok Sabha elections from Mumbai.Rajan thinks Rahul Gandhi is not the man he is depicted as in popular discourse.\n\"Rahul Gandhi is often depicted as someone who does not have the capabilities to think and lead.\nif we need to grow rich before we grow old, we need to become developed, more or less, by 2047.", "keywords": ["rahul", "business", "babies", "rajan", "kissing", "way", "raghuram", "growing", "think", "grow", "need", "growth", "gandhi", "india", "politics"], "url": "https://m.economictimes.com/news/india/raghuram-rajan-on-politics-my-business-is-not-kissing-babies/articleshow/110502786.cms", "imgURL": "https://img.etimg.com/thumb/msid-110503042,width-1200,height-630,imgsize-513068,overlay-economictimes/photo.jpg"}, {"news_number": 73, "title": "Nawaz Sharif admits Pakistan violated peace agreement with India in 1999", "summary": "Pakistan's former Prime Minister Nawaz Sharif on Tuesday admitted that Islamabad had \"violated\" an agreement with India in 1999, in an apparent reference to the Kargil war.\nFormer Prime Minister of Pakistan Nawaz Sharif.\n(PTI)\"On May 28, 1998, Pakistan carried out five nuclear tests.\nThe agreement with India that Sharif talked about was the \"Lahore Declaration\" signed between him and then Indian prime minister Atal Bihari Vajpayee on February 21, 1999.\n\"President Bill Clinton had offered Pakistan USD 5 billion to stop it from carrying out nuclear tests but I refused.", "keywords": ["1999", "kargil", "imran", "peace", "violated", "nuclear", "pakistan", "minister", "khan", "sharif", "agreement", "tests", "prime", "nawaz", "admits", "india"], "url": "https://www.hindustantimes.com/world-news/nawaz-sharif-admits-pakistan-violated-peace-agreement-with-india-in-1999-101716913685618.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/28/1600x900/PTI02-16-2024-RPT266B-0_1709123669362_1716914109686.jpg"}, {"news_number": 74, "title": "Facebook users by country 2024", "summary": "Leading countries based on Facebook audience size as of April 2024 (in millions) [Graph].\n\"Leading countries based on Facebook audience size as of April 2024 (in millions).\"\nLeading countries based on Facebook audience size as of April 2024 (in millions) .\n\"Leading Countries Based on Facebook Audience Size as of April 2024 (in Millions).\"\nStatista , Statista Inc., 24 Apr 2024, https://www.statista.com/statistics/268136/top-15-countries-based-on-number-of-facebook-users/We Are Social & DataReportal & Meltwater, Leading countries based on Facebook audience size as of April 2024 (in millions) Statista, https://www.statista.com/statistics/268136/top-15-countries-based-on-number-of-facebook-users/ (last visited May 28, 2024)Leading countries based on Facebook audience size as of April 2024 (in millions) [Graph], We Are Social, & DataReportal, & Meltwater, April 24, 2024.", "keywords": ["2024", "millions", "leading", "countries", "size", "social", "users", "statista", "meltwater", "country", "statistics", "account", "facebook"], "url": "https://www.statista.com/statistics/268136/top-15-countries-based-on-number-of-facebook-users/", "imgURL": "https://cdn.statcdn.com/Statistic/265000/268136-blank-355.png"}, {"news_number": 75, "title": "TCS & IIT-Bombay to Build India’s First Quantum Diamond Microchip Imager", "summary": "By working together, we aim to transform various sectors, including electronics and healthcare, and propel India forward through groundbreaking technologies and products aligned with National Quantum Mission's Quantum Sensing and Metrology vertical.\"\nOur collaboration with IIT Bombay is perfectly aligned with the National Quantum Mission's Quantum Sensing and Metrology vertical.\nAn indigenous Quantum Diamond Microchip Imager that integrates quantum diamond microscopy with AI/ML-powered software imaging will help India leap ahead in the Quantum Revolution.\nThe Quantum Diamond Microchip Imager can image magnetic fields, enabling a non-invasive and non-destructive mapping of semiconductor chips, much like an MRI at a hospital.\nWith its advanced capabilities to identify chip defects such as current leakages and enable visualization of three-dimensional charge flow in multi-layer chips, Quantum Diamond Microchip Imager is a leap forward in semiconductor imaging.", "keywords": ["build", "microchip", "tcs", "imaging", "semiconductor", "chips", "platform", "quantum", "sensing", "iitbombay", "bombay", "indias", "imager", "diamond"], "url": "https://www.tcs.com/who-we-are/newsroom/press-release/tcs-iit-bombay-build-india-first-quantum-diamond-microchip-imager", "imgURL": "https://www.tcs.com/content/dam/global-tcs/en/images/who-we-are/Corporate/healthcare-research-diamond-microchip-imager-card.jpg"}, {"news_number": 76, "title": "India bucks trend: FPI investments flow in despite emerging mkt slowdown", "summary": "Dedicated India Funds see strong growth:India-dedicated funds, which focus solely on Indian equities, also saw significant inflows.\nGlobal emerging market funds show mixed picture:While India stands out as a bright spot, the report reveals a more mixed picture for global emerging market funds (GEM funds).\nAsia ex-Japan funds (funds that specifically focus on Asia excluding Japan) slightly reduced their allocation to India, going from 19.4% in March to 19.2% in April.\nIn short, while there's a minor decrease in investment towards India from some Asia ex-Japan funds, there's a counterbalancing increase from Emerging Market funds.\nThe table below provides a detailed breakdown of these net flows for April along with comparisons to previous months and years.", "keywords": ["net", "investments", "emerging", "bucks", "funds", "fpi", "despite", "million", "slowdown", "market", "investors", "trend", "flow", "etfs", "mkt", "flows", "sectors", "india"], "url": "https://www.business-standard.com/finance/personal-finance/india-bucks-trend-fpi-investments-flow-in-despite-emerging-mkt-slowdown-124052800031_1.html", "imgURL": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-05/06/thumb/featurecrop/400X400/1715015176-9564.jpg"}, {"news_number": 77, "title": "'Sachin Tendulkar', 'Narendra Modi' among 3000-plus applications received by BCCI for Team India head coach role: Report", "summary": "Indian cricket team coach Rahul Dravid (L) with captain Rohit Sharma before leaving for New York.\nAnd because they decided to do it via Google Forms, responses have been pouring in, to the extent that most of the applications received are unserious and not worth considering.\nHowever, when the application for the coach was declared open, the BCCI received more than 5000 applications – by mail – most of which were fake identities.\nDravid was pretty much certain to take over as India's head coach as he had previously served this role with India A and Under-19 success to plenty of success.\nNot the first time\"Last year too, the BCCI received such a response where imposters applied, and the story is similar this time.", "keywords": ["tendulkar", "team", "applications", "modi", "role", "india", "head", "coach", "narendra", "indian", "sachin", "bcci", "board", "indias", "received", "report"], "url": "https://www.hindustantimes.com/cricket/sachin-tendulkar-narendra-modi-among-3000-plus-applications-received-by-bcci-for-team-india-head-coach-role-report-101716882750443.html", "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/05/28/1600x900/PTI05-25-2024-000596B-0_1716882832978_1716882897150.jpg"}, {"news_number": 78, "title": "As Navy starts cost negotiations for Rafale M, India could learn from France", "summary": "This will include the vanilla cost (bare cost) of the aircraft, besides missiles and maintenance contracts.\nNew Delhi: The Indian Navy is set to formally start the cost negotiations with a French delegation on Thursday for the procurement of 26 Rafale Marine aircraft that will operate from its two aircraft carriers.\nTalking about the cost negotiations, sources say that the final cost of the aircraft will be based on what the Indian Navy negotiators focus on.\nAs per the Indian Navy plan, it will be acquiring 22 single seater fighters and another four twin seaters.\nIn August, ThePrint had reported that the Indian Navy was preparing to send bid papers to France but no joint acquisition was being planned.", "keywords": ["negotiations", "learn", "m", "cost", "starts", "navy", "aircraft", "contract", "iaf", "maintenance", "sources", "indian", "france", "french", "india", "rafale"], "url": "https://theprint.in/defence/as-navy-starts-cost-negotiations-for-rafale-m-india-could-learn-from-france/2105546/", "imgURL": "https://static.theprint.in/wp-content/uploads/2023/12/raffle1.jpg"}, {"news_number": 79, "title": "T20 World Cup: India is the strongest side even with injuries, says Morgan", "summary": "India's remarkable reservoir of talent and formidable depth within their squad makes them strong contenders to win the upcoming T20 World Cup, feels former England skipper Eoin Morgan.\nIndia have gone with almost the same squad as they had in the last edition of the T20 World Cup while adding the likes of young Yashasvi Jaiswal, Yuzvendra Chahal and Sanju Samson.\nIn the last edition of the T20 World Cup they were hammered by 10 wickets by eventual winners England in the semifinals in Adelaide.\nBut former England captain Michael Atherton pointed out that it ironical that the only time India won the T20 World Cup was before the IPL came into being.\nIndia were the first T20 World Cup winners in 2007.", "keywords": ["tournament", "morgan", "t20", "world", "cup", "won", "injuries", "squad", "think", "strongest", "indias", "india", "ipl"], "url": "https://www.thehindu.com/sport/cricket/t20-world-cup-india-is-the-strongest-side-even-with-injuries-says-morgan/article68224227.ece", "imgURL": "https://th-i.thgim.com/public/incoming/3hjw57/article68224236.ece/alternates/LANDSCAPE_1200/Cricket_England_Morgan_Retires_71801.jpg-12ab7.jpg"}, {"news_number": 80, "title": "Can India keep up with the ebbs and flows of power demand?", "summary": "At 3.42 pm on 22 May, Delhi’s demand for electricity from the power grid broke all records, hitting 8,000 megawatts (MW).\nTemperatures are a good predictor of power demand.\nPower demand peaked around early evening, dropped for a couple of hours, and then rose again, as households switched on ACs in the night.\nAccording to an analysis of demand patterns across the country by Grid India, which manages the national power grid: “Even within a day the demand variation pattern of each region is quite unique.\nSupply has to meet demand in a power grid, and has to rise or fall as that demand rises or falls.", "keywords": ["industrial", "ebbs", "course", "demand", "plants", "day", "power", "consumers", "energy", "flows", "india", "grid"], "url": "https://www.livemint.com/industry/energy/can-india-keep-up-with-the-ebbs-and-flows-of-power-demand-11716872174595.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/28/1600x900/ga8a32809a812af7dd72923f2d048d734eeffe0c6bb09ea2979aecb1513ab64c68a75eac710845c30a933344064378d7096c78ce93fcb0937e6df0ec0ac65bf9b_1280_1716874152056_1716874168775.jpg"}, {"news_number": 81, "title": "IIT Bombay, TCS To Develop India's 1st Quantum Diamond Microchip Imager. What It Does", "summary": "A Quantum Diamond microchip imager is an advanced sensing tool to test semiconductor chips.\nThe Indian Institute of Technology (IIT) Bombay on Tuesday announced a strategic partnership with IT services major Tata Consultancy Services (TCS) to develop India's first Quantum Diamond microchip imager -- an advanced sensing tool to test the quality of semiconductor chips.\n\"PQuest group at IIT Bombay is excited to collaborate with TCS on developing a quantum imaging platform for the nondestructive examination of chips, leveraging our extensive expertise in quantum sensing to drive innovation.\nAn indigenous Quantum Diamond microchip imager that integrates quantum diamond microscopy with AI/ML-powered software imaging will help India leap ahead in the quantum revolution.\nThe Quantum Diamond microchip imager uses the defects in a diamond's structure, known as Nitrogen-Vacancy (NV) centres, together with the other hardware and software for detecting and characterising anomalies in semiconductor chips.", "keywords": ["microchip", "does", "iit", "tcs", "semiconductor", "imaging", "quantum", "develop", "sensing", "bombay", "indias", "imager", "diamond"], "url": "https://www.ndtv.com/india-news/iit-bombay-tcs-to-develop-indias-1st-quantum-diamond-microchip-imager-what-it-does-5762434", "imgURL": "https://c.ndtvimg.com/2023-07/3v22u0qs_semiconductor-generic-semiconductor-manufacturing-istock_625x300_01_July_23.jpg"}, {"news_number": 82, "title": "Royal India: This penny stock gained 2474% in 3 years, gave positive returns in all months this year; should you invest?", "summary": "Penny stock Royal India Corporation has given stellar returns to its investors in the long term.\nHowever, it is important to note that the stock is currently trading under ESM: Stage 2 and GSM Stage 0.\nThis system assigns grades to corporations to alert investors about potential stock price manipulation.\nBrokerage viewAccording to domestic brokerage house ICICI Direct, Royal India Corporation demonstrates strong momentum, with its stock price consistently above short, medium, and long-term moving averages.\nThe constrained liquidity and reduced oversight result in increased volatility for small company stocks, heightening risks for investors.", "keywords": ["price", "company", "trading", "stock", "returns", "india", "positive", "royal", "gave", "stocks", "stage", "surveillance", "quarter", "crore", "invest", "penny", "months", "gained"], "url": "https://www.livemint.com/market/stock-market-news/royal-india-this-penny-stock-gained-2474-in-3-years-gave-positive-returns-in-all-months-this-year-should-you-invest-11716892816180.html", "imgURL": "https://www.livemint.com/lm-img/img/2024/05/28/1600x900/adam-smigielski-K5mPtONmpHM-unsplash_1700479308572_1716892982756.jpg"}, {"news_number": 83, "title": "Nawaz Sharif says Pakistan 'violated' agreement with India signed by him and Vajpayee in 1999", "summary": "Former Pakistan premier Nawaz Sharif on May 28 admitted that Islamabad had \"violated\" an agreement with India signed by him and ex-Prime Minister Atal Bihari Vajpayee in 1999, in an apparent reference to the Kargil intrusion by Gen Pervez Musharraf.\nAlso read | Vajpayee, Sharif spoke over phone in the midst of Kargil War, says bookMr. Sharif and Vajpayee signed the Lahore Declaration on February 21, 1999, after a historic summit.\nHe said all cases against him were false while the cases against Pakistan Tehreek-e-Insaf (PTI) founder leader Imran Khan were true.\nHe asked Imran Khan to deny that he was not launched by the ISI.\nMr. Sharif also praised his younger brother Prime Minister Shehbaz Sharif for standing by his side through thick and thin.", "keywords": ["1999", "kargil", "signed", "imran", "talked", "violated", "gen", "pakistan", "minister", "khan", "sharif", "agreement", "prime", "vajpayee", "nawaz", "india"], "url": "https://www.thehindu.com/news/international/nawaz-sharif-says-pakistan-violated-agreement-with-india-signed-by-him-and-vajpayee-in-1999/article68225728.ece", "imgURL": "https://th-i.thgim.com/public/incoming/5ig3nq/article68225732.ece/alternates/LANDSCAPE_1200/India_Obit_Vajpayee_06065.jpg-45f5c.jpg"}, {"news_number": 84, "title": "India: Delhi heat wave has residents struggling – DW – 05", "summary": "As Delhi experiences scorching heat, many people need to be treated for heat exhaustion and stroke.\nScorching temperatures in Delhi have forced authorities to issue a red alert for the sweeping heat wave that has disrupted routine activities in India's capital.\nDelivering food parcels on his two-wheeler in the blistering heat enveloping Delhi had taken its toll, and he fainted at his last stop.\nWe had to put him through rehydration therapy as he suffered a heat stroke,\" Ashutosh Singh, a doctor, told DW.\n\"Our hospital staff is being sensitized for quick pick-up of diagnosis and we are ready with rehydration therapy, depending on the severity of heat stroke patients,\" Sumit Ray, medical director of Holy Family Hospital, told DW.", "keywords": ["patients", "05", "scorching", "water", "wave", "stroke", "hospital", "dw", "temperatures", "struggling", "delhi", "told", "workers", "residents", "india", "heat"], "url": "https://www.dw.com/en/india-delhi-heat-wave-has-residents-struggling/a-69194300", "imgURL": "https://static.dw.com/image/69192232_6.jpg"}, {"news_number": 85, "title": "Asia markets gain at the start of data-heavy week as China industrial profits rise", "summary": "Aerial view of skyscrapers standing at the Lujiazui Financial District at sunrise on June 8, 2022 in Shanghai, China.\nAsia-Pacific markets rose Monday as industrial profits in China rose during the first four months of the year, according to official data.\nChina's industrial profits rose 4.3% year on year in the January to April period, data from the National Bureau of Statistics showed.\nMore economic data from China and India is also due later this week.\nAustralia will also announce its inflation data for April on Wednesday, with analysts from ING expecting a \"modest dip.\"", "keywords": ["start", "industrial", "china", "gain", "dataheavy", "rise", "index", "profits", "markets", "week", "data", "official", "asia", "rose", "india", "worlds"], "url": "https://www.cnbc.com/2024/05/27/asia-markets-australia-cpi-china-pmi-india-gdp.html", "imgURL": "https://image.cnbcfm.com/api/v1/image/107072692-1654688252554-gettyimages-1241165880-c592d761-4b3b-4adc-ad14-cc7f21348e39.jpeg?v=1688513890&w=1920&h=1080"}]