{
  "india": [
    {
      "news_number": 0,
      "title": "Global: Gender apartheid must be recognized as a crime under international law",
      "summary": "Gender apartheid must be recognized as a crime under international law in order to strengthen efforts to combat institutionalized regimes of systematic oppression and domination imposed on the grounds of gender, said Amnesty International today.\nWe are calling for the recognition of gender apartheid under international law to fill a major gap in our global legal framework.\nAgnès Callamard, Amnesty International’s Secretary General“Today we are joining the calls of courageous trailblazers, including women of Afghanistan, Iran and beyond, who have led the way in demanding recognition of gender apartheid in international law.\nThe closest approximation under the current international framework is persecution on the basis of gender, which international law, such as in the Rome Statute of the International Criminal Court, recognizes as a crime against humanity.\nAn international campaign for the recognition of gender apartheid in international law has drawn wide support from feminist activists and allies globally, including four women Nobel Peace Prize Laureates.",
      "url": "https://www.amnesty.org/en/latest/news/2024/06/gender-apartheid-must-be-recognized-international-law/",
      "imgURL": "https://www.amnesty.org/en/wp-content/uploads/2024/06/GettyImages-1376322183-crop.jpg"
    },
    {
      "news_number": 1,
      "title": "Brent Rutemiller, Former International Swimming Hall of Fame CEO, Dies",
      "summary": "After a three-year battle with cancer, former International Swimming Hall of Fame (ISHOF) CEO and a colleague of everyone in the swimming community Brent Rutemiller died in the early hours of Monday morning.\nRutemiller was diagnosed with plasma-cell leukemia in May 2021, which he battled into remission despite no known cure.\nRutemiller had a long career in swimming, from coaching stops across the country, more than 30 years in various roles with Swimming World, and five years as the CEO of the ISHOF in addition to serving as its President.\nRutemiller got his start with Swimming World Magazine in 1985 as the creator of Aquazoids, an educational animated series that has been printed in more than 150 countries.\nDuring his time as publisher, Rutemiller spearheaded Swimming World’s partnership with the ISHOF.",
      "url": "https://swimswam.com/brent-rutemiller-former-international-swimming-hall-of-fame-ceo-dies/",
      "imgURL": "https://swimswam.com/wp-content/uploads/2018/08/Lane-Line-stock-by-Mike-Lewis-DSC_4456.jpg?1718642635"
    },
    {
      "news_number": 2,
      "title": "Usoa Ostolaza wins overall title at Tour Féminin International des Pyrénées",
      "summary": "Image 1 of 2 Usoa Ostolazak (Laboral Kutxa-Fundación Euskadi) wins Tour Féminin International des Pyrénées (Image credit: LABORAL Kutxa-Euskadi Fundazioa ) Josie Talbot wins final stage 3 at Tour Féminin des Pyrénées (Image credit: Cofidis Women's Cycling Team)Josie Talbot (Cofidis) won stage 3 on the final day of racing at the Tour Féminin International des Pyrénées after a solo attack into Bosdarros.\nThe Australian won by 53 seconds over Lotte Claes (Arkéa-B&B Hotels Women).\nGiada Borghesi (BTC City Ljubljana Zhiraf Ambedo) led the chase group for third place after the 125.5km race from Nay into Bosdarros.\nAfter a dominant stage 2 performance on the previous day atop the Col d'Aubisque, Usoa Ostolaza (Laboral Kutxa-Fundación Euskadi) maintained her GC lead and secured the overall title at the Tour Féminin International des Pyrénées.\nI am happy with the steps the team is taking, and with the victory, we have all achieved,\" Ostolaza said.",
      "url": "https://www.cyclingnews.com/races/cic-tour-feminin-international-des-pyrenees-2024/stage-3/results/",
      "imgURL": "https://cdn.mos.cms.futurecdn.net/hcqS8QLnAqVbaLNodCbmCk-1200-80.jpg"
    },
    {
      "news_number": 3,
      "title": "ZGC International Innovation Center / MAD Architects",
      "summary": "Interior Design: MAD Architects, Beijing BIAD Decoration Engineering& Design Co., Ltd.Landscape Design: MAD Architects, Guangzhou S.P.I Design Co., Ltd.Floodlighting Consultant: TORYO International Lighting Design (Beijing) Center Co., Ltd.\nThe ZGC Forum is an international conference focused on innovation and technology held annually in the Zhongguancun area of Beijing's Haidian District.\nThe ZGC International Innovation Center, designed by Ma Yansong/MAD Architects, fosters a deep connection between humanity, the city, and the environment.\nThe ZGC International Innovation Center features two giant ETFE membrane skylights, allowing natural light to flood the venue, and enhancing the user's experience of space and light.\nThe ZGC International Innovation Center’s ventilation system is hidden under the concrete \"veins\" of the suspended ceiling and green roof, giving the building a clean and simple appearance.",
      "url": "https://www.archdaily.com/1017726/zgc-international-innovation-center-mad-architects",
      "imgURL": "https://images.adsttc.com/media/images/666c/8b66/03ec/376b/eac2/a00f/large_jpg/zgc-international-innovation-center-mad-architects_6.jpg?1718389619"
    },
    {
      "news_number": 4,
      "title": "Fisher Investments Selects Advent International and ADIA as Strategic Partners in Minority Common Stock Investment",
      "summary": "Fisher Investments' Founder Ken Fisher Maintains Majority Controlling InterestPLANO, Texas, June 16, 2024 /PRNewswire/ -- Fisher Investments (\"FI\") announced today that Advent International (\"Advent\") and a wholly owned subsidiary of the Abu Dhabi Investment Authority (\"ADIA\") have agreed to make a minority investment in Ken Fisher's namesake firm, Fisher Investments.\nKen Fisher, the Founder and Executive Chairman of FI, will sell personal holdings in FI to Advent-managed funds and ADIA.\nAbout Fisher InvestmentsFounded in 1979, Fisher Investments is an independent, fee-only investment adviser.\nFisher Investments and its subsidiaries manage over $275 billion across three principal businesses—Institutional, US Private Client, and Private Client International.\nMedia Contacts:For Fisher InvestmentsNaj SrinivasExecutive Vice President, Corporate Communications[email protected]For Advent InternationalLeslie ShribmanHead of Communications[email protected]For ADIAGarry NicksonADIA Corporate Communications & Public Affairs[email protected]SOURCE Fisher Investments",
      "url": "https://www.prnewswire.com/news-releases/fisher-investments-selects-advent-international-and-adia-as-strategic-partners-in-minority-common-stock-investment-302173665.html",
      "imgURL": "https://mma.prnewswire.com/media/1008718/Fisher_Investments_Logo.jpg?p=facebook"
    },
    {
      "news_number": 5,
      "title": "Sybrand Engelbrecht retires from international cricket",
      "summary": "Engelbrecht retired from all cricket in 2016 to focus on his career in financial and project management, and he began playing cricket recreationally in the Netherlands after moving there in 2021.\nBy 2023, he was in the Netherlands national squad, having been picked for the 2023 ODI World Cup in India.\nHe has retired now at 35, having played exactly half his international cricket - eight of his 12 ODIs and four of his 12 T20Is - in World Cups.\nHe finishes with 385 ODI runs at an average of 35.00, with two half-centuries, and 280 T20I runs at 31.11 and a strike rate of 132.70.\nHe was Netherlands' highest run-getter at this T20 World Cup, with 98 runs at 24.50 including 40 and 33 in close defeats to Full Members South Africa and Bangladesh.",
      "url": "https://www.espncricinfo.com/story/t20-world-cup-2024-netherlands-batter-sybrand-engelbrecht-retires-from-international-cricket-1439207",
      "imgURL": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/382700/382772.6.jpg"
    },
    {
      "news_number": 6,
      "title": "FBI and Tulsa police capture international fugitive at local bar",
      "summary": "Late Friday night, the FBI and Tulsa police detectives arrested an international murder suspect at a bar located at 21st Street and Garnett Road.\nVictor Antonio Martinez Hernandez was wanted for multiple crimes committed across the United States and El Salvador.\nHernandez fled El Salvador on murder charges where he traveled to Los Angeles.\nHe then traveled to Hartford County in Maryland where he was wanted for killing Rachel Morin, a mother of five.\nThe FBI began working with TPD on reports that Hernandez was in Tulsa, Oklahoma.",
      "url": "https://www.ktul.com/news/local/fbi-and-tulsa-police-capture-international-fugitive-at-local-bar",
      "imgURL": "https://ktul.com/resources/media/d67d1223-e393-4263-a45d-2df86ae63cac-large16x9_448505580_866204865542473_2230852330343949588_n.jpg"
    },
    {
      "news_number": 7,
      "title": "Russia's Putin to visit North Korea amid international concerns over their military cooperation",
      "summary": "Military, economic and other cooperation between North Korea and Russia have sharply increased since Kim visited the Russian Far East in September for a meeting with Putin, their first since 2019.\nLankov noted that while Russia could be reluctant to share its state-of-the-art military technologies with North Korea, it’s eager to receive munitions from Pyongyang.\nIn return, Shin said that North Korea had received more than 9,000 Russian containers likely filled with aid.\nMoscow’s ties with North Korea weakened after the 1991 Soviet collapse.\nAfter North Korea, the Kremlin said Putin will also visit Vietnam on Wednesday and Thursday.",
      "url": "https://www.ajc.com/news/nation-world/russias-putin-to-visit-north-korea-amid-international-concerns-over-their-military-cooperation/3Q7GOGXN75DPBEXANYQB426QD4/",
      "imgURL": "https://www.ajc.com/resizer/DlKe4gJvQC1j14mUznZXEOlsPlI=/1200x630/cloudfront-us-east-1.images.arcpublishing.com/ajc/TXTX3MGPNYCN3TVSJAA2262IYI.jpg"
    },
    {
      "news_number": 8,
      "title": "Donor's gift supports students' international research",
      "summary": "International fieldwork is essential for some doctoral students’ dissertation research, but for many, funding travel and expenses is a challenge.\nRecognizing the importance of extended, in-country research, Amit Bhatia ’01 created a fund to help close these gaps.\nThe Amit Bhatia ’01 Global Ph.D. Research Scholars program, administered through the Mario Einaudi Center for International Studies, part of Global Cornell, supports six to seven graduate students annually as they conduct up to a year of international fieldwork to finish their dissertations.\nThe opportunity is open to post-A exam doctoral candidates from all fields and disciplines for whom international fieldwork is critical to their dissertation research.\n“When I learned about the challenges graduate students have in securing funding for international research projects, I wanted to help.",
      "url": "https://news.cornell.edu/stories/2024/06/donors-gift-supports-students-international-research",
      "imgURL": "https://news.cornell.edu/sites/default/files/styles/story_thumbnail_lg/public/aybe_capital_25.4.24-7559_0.jpg?h=040a5e96&itok=KrPVsZMz"
    },
    {
      "news_number": 9,
      "title": "Davis College alumnus receives international research award",
      "summary": "A recent journal article on an alumnus’ doctoral research at the Davis College of Agriculture, Natural Resources and Design received international recognition.\nHis research focused on developing cross-laminated timber panels produced from low-grade Appalachian hardwood.\nHis winning article, “Cross-Laminated Timber Panels Produced from Low-Grade Yellow-Poplar Sorted by Structural Visual Grade,” examined how a low-grade timber that is not currently used in wood products can be used in construction.\nAzambuja recently attended the FPS International Convention in Knoxville, Tennessee, where he personally received the award.\nThe Davis College of Agriculture, Natural Resources and Design envisions a world sustainably fed, clothed and sheltered.",
      "url": "https://enews.wvu.edu/articles/2024/06/17/davis-college-alumnus-receives-international-research-award",
      "imgURL": "https://enews.wvu.edu/files/eacf0c51-4bf1-4a35-83e4-96f8a6d72b6d/1200x800?cb=f99621854cc5a5f7757047c881a9f120"
    },
    {
      "news_number": 10,
      "title": "Camas HS radio club makes contact with International Space Station",
      "summary": "Students from the Amateur Radio Club at Camas High School successful made contact with the International Space Station.",
      "url": "https://www.kptv.com/video/2024/06/17/camas-hs-radio-club-makes-contact-with-international-space-station/",
      "imgURL": "https://gray-kptv-prod.cdn.arcpublishing.com/resizer/v2/https%3A%2F%2Fdo0bihdskp9dy.cloudfront.net%2F06-17-2024%2Ft_ef5d44498feb4914a26a8523a04d7733_name_YT_THUMBNAIL___2024_06_17T062605_377.jpg?auth=656a75bbcd667e42db5f71cfc9966aff74a79b4c9faafeb3047ecc594680432c&width=1200&height=600&smart=true"
    },
    {
      "news_number": 11,
      "title": "Bolivia launches new international battle to get coca off blacklist",
      "summary": "As for the rest of the world, a United Nations convention classifies the coca leaf as a narcotic and imposes a blanket prohibition on drugs.\nSuccessive governments in Bolivia, the world's third-biggest producer of coca leaf and cocaine, have long tried to give the ancient leaf a new and improved reputation without success.\nThe health agency will also consider Bolivia's efforts to commercialize coca, determining the maximum amount of the cocaine alkaloid that coca products could contain on the world market.\n\"For us Yungueños (of the Yungas region), the coca leaf is health, food, clothing, and education.\n\"The decriminalization (of coca leaves) could benefit my yungueño people because our coca has the most nutrients and is the most sought after for industrialization,\" he added.",
      "url": "https://dailyprogress.com/life-entertainment/nation-world/food-drink/bolivia-launches-new-international-battle-to-get-coca-off-blacklist/video_9a4e3b73-94bb-52d0-9a76-f4a6a9a26a39.html",
      "imgURL": "https://bloximages.newyork1.vip.townnews.com/dailyprogress.com/content/tncms/assets/v3/editorial/9/a4/9a4e3b73-94bb-52d0-9a76-f4a6a9a26a39/66703b7e81e02.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize"
    },
    {
      "news_number": 12,
      "title": "Curry Brand signs Keisei Tominaga as first international athlete",
      "summary": "Under Armour’s Curry Brand has signed Japanese basketball guard Keisei Tominaga as its first international athlete.\nContract:Company pens multi-year partnership with 23-year-oldTominaga to wear Curry Brand footwear and apparel on the courtFormer Nebraska Cornhuskers player to also serve as brand ambassadorPair will work on community initiativesContext:Nicknamed the ‘Japanese Steph Curry’, Tominaga will help grow Curry Brand’s reach both in Japan and internationally.\nHe joins Stephen Curry, De’Aaron Fox and MiLaysia Fulwiley as Curry Brand athletes.\nFulwiley, who plays for the South Carolina Gamecocks in the Southeastern Conference (SEC), became the first collegiate athlete to sign with the brand.\nComment:“It is an incredible honour to join Curry Brand and be among its elite roster of athletes,” said Tominaga.",
      "url": "https://www.sportspromedia.com/news/curry-brand-keisei-tominaga-endorsement-deal-brand-ambassador/",
      "imgURL": "https://www.sportspromedia.com/wp-content/uploads/2024/06/News-story-template-21.jpg"
    },
    {
      "news_number": 13,
      "title": "Reasons Why Mar Vista Sold Honeywell International (HON)",
      "summary": "Mar Vista Investment Partners, LLC, an investment management company, released the “Mar Vista Focus strategy” first quarter 2024 investor letter.\nMar Vista Focus strategy highlighted stocks like Honeywell International Inc. (NASDAQ:HON), in the first quarter 2024 investor letter.\nHoneywell International Inc. (NASDAQ:HON) engages in aerospace technologies, building automation, energy and sustainable solutions, and industrial automation businesses.\nOn June 14, 2024, Honeywell International Inc. (NASDAQ:HON) stock closed at $208.53 per share with a market capitalization of $135.792 billion.\nMar Vista Focus strategy stated the following regarding Honeywell International Inc. (NASDAQ:HON) in its first quarter 2024 investor letter:\"After nearly 14 years of owning shares in Honeywell International Inc. (NASDAQ:HON), we decided to sell our investment during the quarter.",
      "url": "https://finance.yahoo.com/news/reasons-why-mar-vista-sold-115416629.html",
      "imgURL": "https://media.zenfs.com/en/insidermonkey.com/e575847e779a4382628518110e266f42"
    },
    {
      "news_number": 14,
      "title": "UF’s International Piano Festival brings musicians to campus for a week of lessons and performances",
      "summary": "The pianist, Evan Mitchell, performed for a crowd of hundreds at the UF School of Music June 9 as part of the International Piano Festival, hosted by the College of the Arts from June 8 to June 15.\nIt included full concerts, recitals, masterclasses and performances by UF faculty, high school and college students along with world-renowned pianists.\n“When you visualize how you want it to feel, that really helps.”The festival also allowed Collante to expand his mentorship network, he said.\nLarissa Samson, a 17-year-old UF music and English rising freshman, said the festival gave her an opportunity to prepare for her incoming freshman year in the program.\nConnecting students who have similar interests is another important aspect of the festival, Mitchell said.",
      "url": "https://www.alligator.org/article/2024/06/uf-international-piano-festival",
      "imgURL": "https://snworksceo.imgix.net/ufa/26d6f5e7-379d-4db5-affc-146ce3c9dfb6.sized-1000x1000.jpg?w=800&dpr=2&ar=16%3A9&fit=crop&crop=faces"
    },
    {
      "news_number": 15,
      "title": "Role of nuclear weapons grows as geopolitical relations deteriorate—new SIPRI Yearbook out now",
      "summary": "Key findings of SIPRI Yearbook 2024 are that the number and types of nuclear weapons in development have increased as states deepen their reliance on nuclear deterrence.\nClick here to download the sample chapter of SIPRI Yearbook 2024 on world nuclear forces.\nIt also completed the development of at least two types of land-attack cruise missile (LACM) designed to deliver nuclear weapons.\n‘We have not seen nuclear weapons playing such a prominent role in international relations since the cold war,’ said Wilfred Wan, Director of SIPRI’s Weapons of Mass Destruction Programme.\nFor editorsThe SIPRI Yearbook is a compendium of cutting-edge information and analysis on developments in armaments, disarmament and international security.",
      "url": "https://www.sipri.org/media/press-release/2024/role-nuclear-weapons-grows-geopolitical-relations-deteriorate-new-sipri-yearbook-out-now",
      "imgURL": "https://www.sipri.org/sites/default/files/styles/node/public/2024-06/yearbook_2024_inside-2.jpg?itok=v9wdiEg6"
    },
    {
      "news_number": 16,
      "title": "International travel: Don't forget your child's vaccinations, says pediatrician",
      "summary": "According to pediatrician Dr. Lauren Nguyen, researching what vaccines are needed and preparing well before your family's departure is crucial.\nMeet with your child's pediatrician to review travel plans, figure out what vaccines are required or recommended based on your travel destination and arrange to get any shots needed.\nMeasles outbreaks are occuring worldwide with greater frequency, and measles vaccine recommendations are different for babies versus older children.\nHowever, for infants \"that changes for international travel,\" Nguyen said.\n\"Children between 6 and 12 months of age should get a first dose of the measles vaccine prior to travel.\"",
      "url": "https://medicalxpress.com/news/2024-06-international-dont-child-vaccinations-pediatrician.html",
      "imgURL": "https://scx2.b-cdn.net/gfx/news/hires/2024/international-travel-d.jpg"
    },
    {
      "news_number": 17,
      "title": "Small plane crashes near runway at Albany International Airport in New York",
      "summary": "Local and federal officials in New York are investigating after a small plane crashed near the Albany International Airport mid Monday morning.\nA Colonie Police Department spokesperson confirmed to USA TODAY officers, assisted by additional police, fire and EMS crews, responded to the scene in Latham, located in east central New York.\nAccording to the Federal Aviation Administration, a twin-engine Piper PA-31 crashed near the end of the runway at the airport about 8:15 a.m. local time.\nPlane drops 400 feet, nearly hits ocean:FAA investigating after Southwest plane nearly crashes into water near HawaiiAlbany International Airport continues to operateAirport officials posted on Facebook the privately-owned aircraft crashed offsite just southeast of the airport's property.\nNatalie Neysa Alund is a senior reporter for USA TODAY.",
      "url": "https://www.usatoday.com/story/news/nation/2024/06/17/plane-crash-albany-new-york-airport/74122964007/",
      "imgURL": "https://www.usatoday.com/gcdn/presto/2021/07/12/USAT/5c2af41a-f004-4ecf-9cda-da1532540fde-NY-01.png?crop=4125,2320,x653,y422&width=3200&height=1800&format=pjpg&auto=webp"
    },
    {
      "news_number": 18,
      "title": "WESCO International Insiders Sold US$3.9m Of Shares Suggesting Hesitancy",
      "summary": "The fact that multiple WESCO International, Inc. ( ) insiders offloaded a considerable amount of shares over the past year could have raised some eyebrows amongst investors.\nIn the last year WESCO International insiders didn't buy any company stock.\nIf you like to buy stocks that insiders are buying, rather than selling, then you might just love this freeWESCO International Insiders Are Selling The StockThe last quarter saw substantial insider selling of WESCO International shares.\nI like to look at how many shares insiders own in a company, to help inform my view of how aligned they are with insiders.\nWESCO International insiders own 1.6% of the company, currently worth about US$134m based on the recent share price.",
      "url": "https://simplywall.st/stocks/us/capital-goods/nyse-wcc/wesco-international/news/wesco-international-insiders-sold-us39m-of-shares-suggesting",
      "imgURL": "https://images.simplywall.st/asset/industry/3081000-choice2-main-header/1585186749644"
    },
    {
      "news_number": 19,
      "title": "New Prairie Future Health Professionals Qualify for International Competition",
      "summary": "New Prairie is sending 14 students to the HOSA - Future Health Professionals International competition held in Houston, Texas.\nTo compete at this level, students must have placed in the Top 3 of their competitive event at the state competition held in April.\nGood luck Cougars!\nYou can follow New Prairie HOSA on Facebook at New Prairie HOSA and on Instagram at npusc_hosa.\nStudents and the event in which they are competing in are:Myes Aerts- Clinical SpecialityCeCe Walls- Community Emergency Response TeamJenna Kelly- Community Emergency Response TeamMadelyn Long-Interviewing SkillsGrace Varnak-Health Career PhotographyKaylee Hoggard-Pharmacy ScienceAlex Spencer-Job Seeking SkillsJoey Smith-Prepared SpeakingDimitri Loza-Medical TerminologyPayten Pozywala-Health Career PreparationEsther Schwartz-Healthy LivingChanning Foster-Health Career ExplorationRaegan Bicker-Prepared SpeakingNora Luther-Life Threatening Situations",
      "url": "https://laportecounty.life/article/new-prairie-future-health-professionals-qualify-for-international-competition/",
      "imgURL": "https://cdn.greatnews.life/wp-content/uploads/2024/06/New-Prairie-Future-Health-Professionals-Qualify-for-International-Competition.jpg"
    },
    {
      "news_number": 20,
      "title": "SNAC International hosts first in-person women’s summit",
      "summary": "WASHINGTON — SNAC International welcomed 40 professionals to its first in-person Women in Snacks (WinS) Summit, held June 12-13 in Washington, DC.\nSNAC International has largely fulfilled that mission through virtual webinars and in-person networking and workshops attached to its other major events, such as SNAXPO, SNX and the Executive Leadership Forum.\nAt the opening of the event, Christine Cochran, president and chief executive officer of SNAC International, noted that while much of the education associated with WinS had happened virtually until this point, rich relationships were beginning to form.\nWinS is just one of the programs that SNAC International hosts to promote individual, company and industry success.\nCochran pointed out that the organization’s commitment to individuals’ professional success differentiates SNAC International from other industry organizations.",
      "url": "https://www.bakingbusiness.com/articles/61730-snac-international-hosts-first-in-person-womens-summit",
      "imgURL": "https://www.bakingbusiness.com/ext/resources/2024/06/17/0617-WinS2.jpg?height=635&t=1718639450&width=1200"
    },
    {
      "news_number": 21,
      "title": "Massacres in DR Congo: Pope honors 'martyrs,' urges international community to act",
      "summary": "Calling for peace in Ukraine, the Holy Land, Myanmar, and “everywhere people suffer from war,” Pope Francis also called attention to the plight of the people in the eastern Democratic Republic of Congo.\n“Painful news continues to arrive of clashes and massacres” in this region, he told thousands of faithful gathered in St. Peter's Square June 16 after the Angelus prayer.\nTheir sacrifice is a seed that germinates and bears fruit and teaches us to bear witness to the Gospel with courage and consistency,” the pope emphasized.\nThe ADF, originally Ugandan rebels who are predominantly Muslim, have been established in eastern DRC since the mid-1990s, where they have killed thousands of civilians.\nIn recent weeks, they have multiplied attacks on villages, travelers, and health centers, most often plundering them.",
      "url": "https://international.la-croix.com/world/massacres-in-dr-congo-pope-honors-martyrs-urges-international-community-to-act",
      "imgURL": "https://admin.international.la-croix.com/assets/c9d5b510-ff4f-4d14-adfc-4202dcfc3b44?format=jpg&width=1200&height=600"
    },
    {
      "news_number": 22,
      "title": "Two dozen foreign dignitaries visit Kingston for international leadership program",
      "summary": "KINGSTON – Twenty-four visitors from 23 countries were in Kingston this past week as part of the US State Department’s International Visitor Leadership Program.\nThey met with Mayor Steve Noble and other city officials in a program created to strengthen US engagement with countries around the world and cultivate lasting relationships by connecting foreign leaders with their American counterparts.\nThey toured the Rondout Creek and Hudson River waterfront’s Weaving the Waterfront resiliency and adaptation projects, the Kingston Land Trust’s Mason Hill Land in Black Hands acquisition, the YMCA Farm Project and the Ulster County Resource Recovery compositing operation.\nMayor Noble also lead the group on a kayak tour on the Hudson River.\nThe international group also visited Washington, DC, New York City, Minneapolis-St. Paul, and New Orleans.",
      "url": "https://midhudsonnews.com/2024/06/17/two-dozen-foreign-dignitaries-visit-kingston-for-international-leadership-program/",
      "imgURL": "https://midhudsonnews.com/wp-content/uploads/2019/08/Kingston_NY_City_Hall_a.jpg"
    },
    {
      "news_number": 23,
      "title": "Waberer's International Nyrt (BST:3WB) Is Doing The Right Things To Multiply Its Share Price",
      "summary": "So when we looked at Waberer's International Nyrt (BST:3WB) and its trend of ROCE, we really liked what we saw.\nSo, Waberer's International Nyrt has an ROCE of 5.2%.\nIf you'd like to look at how Waberer's International Nyrt has performed in the past in other metrics, you can view this free graph of Waberer's International Nyrt's past earnings, revenue and cash flow.\nShareholders will be relieved that Waberer's International Nyrt has broken into profitability.\nStory continuesIf you'd like to know about the risks facing Waberer's International Nyrt, we've discovered 1 warning sign that you should be aware of.",
      "url": "https://finance.yahoo.com/news/waberers-international-nyrt-bst-3wb-065539504.html",
      "imgURL": "https://media.zenfs.com/en/simply_wall_st__316/829b7d39d26e65dfe1ca985161802c87"
    },
    {
      "news_number": 24,
      "title": "CGI marks final year as title sponsor of Rochester International Jazz Festival",
      "summary": "click to enlarge PHOTO BY JACKIE MCGRIFFMusician Danielle Ponder performs at the 2022 Rochester International Jazz Festival.\nclick to enlarge Max Schulte/WXXI NewsMarc Iacona, Rochester International Jazz Festival executive director, talks about the 27 free shows that will be held at Parcel 5 during the 2022 festival at an announcement at the Theater at Innovation Square on Tuesday, March 15, 2022.\nBefore CGI, Xerox did a decade-long run as title sponsor.While it has been a “wonderful” run, Bartosiewicz said, “we want to do other things.”“Am I glad that I did it?\nThe city of Rochester is the lead government sponsor, which translates to a $243,000 commitment.\nBartosiewicz declined to say what CGI paid as title sponsor.“It’s a lot of money,” he said, \"in a good way.",
      "url": "https://www.roccitymag.com/news-opinion/cgi-marks-final-year-as-title-sponsor-of-rochester-international-jazz-festival-17782505",
      "imgURL": "https://media2.roccitymag.com/rochester/imager/u/slideshow/17782515/jazz_fest_crowd.jpg"
    },
    {
      "news_number": 25,
      "title": "Are Mondelez International, Inc.'s (NASDAQ:MDLZ) Fundamentals Good Enough to Warrant Buying Given The Stock's Recent Weakness?",
      "summary": "It is hard to get excited after looking at Mondelez International's (NASDAQ:MDLZ) recent performance, when its stock has declined 8.9% over the past three months.\nMondelez International's Earnings Growth And 15% ROETo start with, Mondelez International's ROE looks acceptable.\nMondelez International's decent returns aren't reflected in Mondelez International'smediocre five year net income growth average of 3.5%.\nSo, there could be some other factors at play that could be impacting the company's growth.\nSummaryIn total, it does look like Mondelez International has some positive aspects to its business.",
      "url": "https://simplywall.st/stocks/us/food-beverage-tobacco/nasdaq-mdlz/mondelez-international/news/are-mondelez-international-incs-nasdaqmdlz-fundamentals-good",
      "imgURL": "https://images.simplywall.st/asset/industry/5122000-choice2-main-header/1585186547117"
    },
    {
      "news_number": 26,
      "title": "This website is unavailable in your location. – 102.3 KRMG",
      "summary": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.",
      "url": "https://www.krmg.com/news/local/international-murder-suspect-arrested-by-tulsa-police/2TPSSIPINRHPJJBLSR633AQP4U/",
      "imgURL": "https://www.krmg.com/pf/resources/images/sites/cmg-rd-20111/station-logo.png?d=847"
    },
    {
      "news_number": 27,
      "title": "Armenia: Violence during street protests must be investigated",
      "summary": "Reacting to reports of violent clashes between protesters and police in Armenia’s capital Yerevan, which resulted in numerous injuries and detentions, Natalia Nozadze, Amnesty International’s South Caucasus Researcher, said:“The level of violence during the latest street rally in Yerevan is deeply worrying.\nThe authorities responded to attempts to block access to the Parliament building by using stun grenades.\nOf these, 66 have since been discharged, while 32 remain hospitalized with injuries ranging from minor to moderate.\nThe violence also resulted in injuries to 17 police officers.\nThe Armenian Investigative Committee has opened a criminal case into “engaging in violent acts against law enforcement.” Suspects in this case have not yet been named.",
      "url": "https://www.amnesty.org/en/latest/news/2024/06/armenia-violence-during-street-protests-must-be-investigated/",
      "imgURL": "https://www.amnesty.org/en/wp-content/uploads/2024/06/300749-scaled.jpg"
    },
    {
      "news_number": 28,
      "title": "Oracle (ORCL) International Revenue Performance Explored",
      "summary": "Have you evaluated the performance of Oracle's (ORCL) international operations for the quarter ending May 2024?\nThe company's total revenue for the quarter amounted to $14.29 billion, marking an increase of 3.3% from the year-ago quarter.\nWe will next turn our attention to dissecting ORCL's international revenue to get a clearer picture of how significant its operations are outside its main base.\nExploring ORCL's International Revenue PatternsEurope, Middle East and Africa generated $3.54 billion in revenues for the company in the last quarter, constituting 24.8% of the total.\nTherefore, a vigilant watch on its international revenue movements can greatly aid in projecting the company's future direction.",
      "url": "https://finance.yahoo.com/news/oracle-orcl-international-revenue-performance-143700020.html",
      "imgURL": "https://media.zenfs.com/en/zacks.com/f76663cf05c3c2a957964d03b32d78c6"
    },
    {
      "news_number": 29,
      "title": "How Do Messi And Ronaldo’s International Careers Compare?",
      "summary": "Cloudy skies will become partly cloudy this afternoon.\nWinds WSW at 25 to 35 mph.\nWinds could occasionally gust over 40 mph..TonightPartly cloudy skies.\nSW winds at 20 to 30 mph, decreasing to 5 to 10 mph.\nWinds could occasionally gust over 40 mph.",
      "url": "https://www.kpvi.com/sports/how-do-messi-and-ronaldo-s-international-careers-compare/video_28841068-0e78-5dfc-a3f9-a70d0811f176.html",
      "imgURL": "https://bloximages.newyork1.vip.townnews.com/kpvi.com/content/tncms/assets/v3/editorial/2/88/28841068-0e78-5dfc-a3f9-a70d0811f176/66704882de886.image.jpg?crop=1280%2C672%2C0%2C23&resize=1200%2C630&order=crop%2Cresize"
    },
    {
      "news_number": 30,
      "title": "Supporting International CDKL5 Day",
      "summary": "Every June the CDKL5 community comes together to recognize CDKL5 disorder, and promote awareness efforts, research, collaboration, and fundraising.\nJune 17 is International CDKL5 Day, in memory of Glyn Boltwood, whose life and legacy was directly responsible for the medical and scientific community discovering CDKL5 Disorder in 2004.\nCDKL5 deficiency disorder – a Developmental and Epileptic Encephalopathy (DEE) - is a genetic disorder that causes seizures, developmental delay, and severe intellectual disability.\nCDKL5 deficiency disorder occurs more often in females than males, and males usually have more severe symptoms.\nCDKL5 deficiency disorder was once thought to be a variant of Rett syndrome but is now considered a separate disorder.",
      "url": "https://www.ucb.com/Our-company/magazine/detail/article/Supporting-International-CDKL5-Day",
      "imgURL": "https://www.ucb.com/sites/default/files/styles/large/public/2024-06/adobestock_207658006.jpeg?itok=Ryait53H"
    },
    {
      "news_number": 31,
      "title": "Allentown airport: 2 loaded guns seized over weekend",
      "summary": "Two loaded guns were confiscated at Lehigh Valley International Airport security checkpoints over the weekend.\nTSA officers notified local police, who then confiscated the firearms.\n“It’s disappointing to see people bring their loaded guns to our checkpoints,” Karen Keys-Turner, TSA’s federal security director for the airport, said in a news release.\nPenalties incur a fine of $3,000 to $13,190 for travelers holding a loaded firearm at a checkpoint, according to TSA.\nThe airport reported traffic of 85,243 people this May, which marks a 16% increase from May 2023.",
      "url": "https://www.mcall.com/2024/06/17/2-guns-seized-at-lehigh-valley-international-airport-over-weekend/",
      "imgURL": "https://www.mcall.com/wp-content/uploads/migration/2020/01/24/CXP4WW5QJFFATHT7AE7RLKVGJ4.jpg?w=1024&h=670"
    },
    {
      "news_number": 32,
      "title": "International Petroleum Corporation Announces Results of Normal Course Issuer Bid",
      "summary": "During the period of June 10 to 14, 2024, IPC repurchased a total of 328,000 IPC common shares on Nasdaq Stockholm.\nDuring the same period, IPC purchased a total of 77,350 IPC common shares on the TSX.\nAs at June 14, 2024, the total number of issued and outstanding IPC common shares is 124,377,015 with voting rights and IPC holds 752,000 common shares in treasury.\nForward-Looking StatementsThis press release contains statements and information which constitute \"forward-looking statements\" or \"forward-looking information\" (within the meaning of applicable securities legislation).\nAll statements other than statements of historical fact may be forward-looking statements.",
      "url": "https://finance.yahoo.com/news/international-petroleum-corporation-announces-results-090000826.html",
      "imgURL": "https://media.zenfs.com/en/globenewswire.com/847a16a5a30ba8b868a2b267e763b0a9"
    },
    {
      "news_number": 33,
      "title": "Almaden Files Request for Arbitration Against Mexico with International Centre for Settlement of Investment Disputes",
      "summary": "The Company’s international arbitration claim against Mexico will be prosecuted pursuant to the established and enforceable legal framework of the International Centre for Settlement of Investment Disputes (“ICSID”).\nWith this notice period now over, the Company has filed its Request for Arbitration with ICSID.\nAll statements, other than statements of historical fact, are forward-looking statements or information.\nThere can be no assurance that our forward-looking statements or information will prove to be accurate.\nAccordingly, readers should not place undue reliance on forward-looking statements or information.",
      "url": "https://finance.yahoo.com/news/almaden-files-request-arbitration-against-110000099.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/Kj.JS.ddmdF53EtJ_q0K1w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD05MjU-/https://media.zenfs.com/en/globenewswire.com/cb6c85be0db1a23c2e85f407d52f77aa"
    },
    {
      "news_number": 34,
      "title": "TSplus International Meeting in Mallorca: A Springboard for Innovation and Growth",
      "summary": "TSplusphoto of Palma de Mallorca from the seaPALMA DE MALLORCA, Spain, June 17, 2024 (GLOBE NEWSWIRE) -- TSplus, a global leader in remote access and security solutions, recently concluded its highly anticipated International Meeting in the picturesque setting of Palma de Mallorca.\nThis event brought together the best minds from across their global team to celebrate achievements, share insights, and chart a course for an exciting future.\nThe event highlighted TSplus' commitment to innovation, growth, and building a stronger, more connected community.\nA Year of Remarkable GrowthDominique Benoit, TSplus’ Business Development leader, shared exhilarating news: TSplus' worldwide turnover has seen impressive growth, demonstrating their continued upward trajectory.\nMarketing Strategies for Global RecognitionTSplus’ Marketing team is pushing the envelope with fresh strategies and updated materials.",
      "url": "https://finance.yahoo.com/news/tsplus-international-meeting-mallorca-springboard-102000839.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/NEBKJNqEeY_3bEYkN2I8pw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzY-/https://media.zenfs.com/en/globenewswire.com/1b44182857d607d135e9bee36b84f7a2"
    },
    {
      "news_number": 35,
      "title": "Whale Cloud and Ant International Forge Strategic Partnership to Expand e-Wallet and Super App Technologies",
      "summary": "In addition to product offerings, Whale Cloud and Ant International will cooperate to provide one-stop services, including technology and operations hosting, payment business planning consultation, business growth support, and business operations management.\n\"The synergy of insights, expansion capabilities, and technology innovation will accelerate financial inclusion on a global scale,\" said Yishi CHEN, Executive Vice President of Whale Cloud International.\n\"We are glad to embark on this strategic partnership with Whale Cloud,\" said Zhixian LI, Senior Director, Alipay+ Wallet Tech at Ant International.\nAt Whale Cloud, we're passionate about creating frictionless experiences for customers and empowering their digital ambitions.\nAbout Ant InternationalHeadquartered in Singapore, Ant International powers the future of global commerce with digital innovation for everyone and every business to thrive.",
      "url": "https://www.prnewswire.com/ae/news-releases/whale-cloud-and-ant-international-forge-strategic-partnership-to-expand-e-wallet-and-super-app-technologies-302163339.html",
      "imgURL": "https://mma.prnewswire.com/media/2426746/Photo.jpg?p=facebook"
    },
    {
      "news_number": 36,
      "title": "China: ‘Malicious’ conviction of #MeToo and labour activists shows Beijing’s growing fear of dissent",
      "summary": "Sophia Huang Xueqin said in court that she would appeal.\nSophia Huang Xueqin is a journalist who has been involved in several #MeToo campaigns to provide support and assistance to survivors of sexual assault and harassment.\nWang Jianbing has provided legal support for people with disabilities and workers with occupational diseases.\nSophie Huang Xueqin is believed to have been subjected to ill-treatment in detention, leading to the dramatic deterioration of her health.\nIn January 2023, Sophia Huang Xueqin and Wang Jianbing were transferred to Guangzhou City No 1 Detention Centre, awaiting trial at the court.",
      "url": "https://www.amnesty.org/en/latest/news/2024/06/china-malicious-conviction-of-metoo-and-labour-activists-shows-beijings-growing-fear-of-dissent/",
      "imgURL": "https://www.amnesty.org/en/wp-content/uploads/2024/06/284178-scaled.jpg"
    },
    {
      "news_number": 37,
      "title": "Cultivate inner peace and world harmony for International Yoga Day",
      "summary": "HONOLULU (HawaiiNewsNow) - The public is invited to celebrate the 6th annual International Yoga Day event hosted by the Gandhi International Institute For Peace (GIIP) this Friday.\nThe theme for this year’s International Yoga Day is “Yoga for Inner Peace & World Peace.” The event will feature yoga sessions, wellness discussions, and opportunities for participants to connect with fellow practitioners throughout the day.\nUnder Kumar’s leadership, GIIP initiated a House Bill into the Hawaii Legislature, HB 349, to recognize June 21 each year as International Yoga Day in Hawaii.\nAs a practitioner of Hinduism, Kumar believes yoga is a powerful tool for fostering peace within individuals and within communities.\nStay connected with the latest updates by following their Facebook Gandhi International Institute for Peace.",
      "url": "https://www.hawaiinewsnow.com/2024/06/17/cultivate-inner-peace-world-harmony-international-yoga-day/",
      "imgURL": "https://gray-khnl-prod.cdn.arcpublishing.com/resizer/v2/H5YIAXQGOBGHRPEPCEEXCSY5SM.jpg?auth=8d80a9019bfbc6f89ac6e61e2c3c84367f6bf0e1cfc34e521f4ef9eb7fe53eff&width=1200&height=600&smart=true"
    },
    {
      "news_number": 38,
      "title": "International artist creates rendition of recently-closed Columbus area pizzeria",
      "summary": "While Zamarelli’s Pizza Palace’s six-decade run came to an end after the eatery closed its doors earlier this year, the pizzeria has been memorialized by an international artist.\nHis Ishizu Pizza series is a collection of endearingly-sparse drawings of Ishizu Pizza, which revolves around depictions of a fictional pizza chain he invented.\nSo how, exactly, did the Scottish artist end up selecting a central Ohio pizza place to sketch?\nThrough another Ohio pizza place, of course.\nThey asked me to draw Zamerellies in my style,” Pennock said, adding the drawing was a commission by the Avon, Ohio-based Whitebox Pizza.",
      "url": "https://614now.com/2024/food-drink/international-artist-creates-rendition-of-recently-closed-columbus-area-pizzeria",
      "imgURL": "https://614now.com/wp-content/uploads/2024/06/IMG_3439.jpeg"
    },
    {
      "news_number": 39,
      "title": "Why ASM International NV (AMS:ASM) Could Be Worth Watching",
      "summary": "ASM International NV (AMS:ASM) received a lot of attention from a substantial price increase on the ENXTAM over the last few months.\nCheck out our latest analysis for ASM InternationalWhat's The Opportunity In ASM International?\nWhat does the future of ASM International look like?\nSo while earnings quality is important, it's equally important to consider the risks facing ASM International at this point in time.\nIn terms of investment risks, we've identified 1 warning sign with ASM International, and understanding this should be part of your investment process.",
      "url": "https://finance.yahoo.com/news/why-asm-international-nv-ams-052234486.html",
      "imgURL": "https://media.zenfs.com/en/simply_wall_st__316/c5201eeaa7905447e59995740351e3e5"
    },
    {
      "news_number": 40,
      "title": "Amsterdam-Based International Platform Publishes Kazakh University’s Scientific Journal",
      "summary": "The university has been publishing the Eurasian National University since 2017 in English, reported the university’s press service on June 11.\nAll articles of the scientific publication are also included in the Scopus international scientific database.\nThe journal contains materials on the results of scientific research in nuclear physics, high-energy physics, alternative and hydrogen energy, and others.\nThe publication of the Eurasian Journal of Physics and Functional Materials on the Elsevier platform opens up new prospects for the development of not only the journal, but also the entire scientific community of Kazakhstan.\nThis is recognition of the international level of quality of scientific research conducted at the Gumilyov Eurasian National University and in Kazakhstan,” said the Editor-in-Chief of the Eurasian Journal of Physics and Functional Materials Kairat Kuterbekov.",
      "url": "https://astanatimes.com/2024/06/amsterdam-based-international-platform-publishes-kazakh-universitys-scientific-journal/",
      "imgURL": "https://astanatimes.com/wp-content/uploads/2024/06/vo-vremya-covid-enu-potratil-bolee-165-mln-tenge-na-obshhezhitiya-bez-studentov-bizmedia.kz_.jpeg"
    }
  ],
  "health": [
    {
      "news_number": 0,
      "title": "Aryna Sabalenka to skip Paris Olympics to 'take care of health'",
      "summary": "World No.3 Aryna Sabalenka announced on Monday that she will not participate in the Paris Olympics, citing her need to prioritize health and readiness for the upcoming hard court season as the primary reasons for her withdrawal.\nadvertisementSpeaking at the Berlin Ladies Open, the 26-year-old elaborated on her decision to forgo the Olympics.\n\"Especially with all the struggles I've been struggling with the last months, I feel I have to take care of my health,\" Sabalenka explained.\n\"It's too much for the scheduling and I made the decision to take care of my health.\nAryna Sabalenka says she will not play the Olympics this year:“I’m not going to play Olympics because of all the rules from WTA with mandatory tournaments.",
      "url": "https://www.indiatoday.in/sports/other-sports/story/aryna-sabalenka-to-skip-paris-olympics-to-take-care-of-health-2554381-2024-06-17",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/aryna-sabalenka-281415841-16x9_0.jpg?VersionId=gKp7_CDkPkMYZmsodLRdf9Axtd06aGVI"
    },
    {
      "news_number": 1,
      "title": "Numerology and Wellness: Health Tips for June 2024",
      "summary": "Let’s explore the numerological parameters of June 2024 and how to use these energies to improve one’s health, well-being, and development.In numerology , the year 2024 is associated with the energy of the number 8 (2 + 0 + 2 + 4 = 8).\nIn numerology, the number 5 symbolises flexibility, travel, transition, and liberty.\nTo that end, this month is the perfect time to focus on self-care and nourish your body, mind, and soul.\nIt might be useful to take a dance class, start hiking or cycling, or go for exciting strolls in nature.\nJune 2024 is a perfect time to try something new and get out of your comfort zone, whether a hobby or an interest.",
      "url": "https://timesofindia.indiatimes.com/astrology/numerology-tarot/numerology-and-wellness-health-tips-for-june-2024/articleshow/110997228.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-110997268,width-1070,height-580,imgsize-43208,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 2,
      "title": "Human bird flu infection confirmed in India amid concern over avian flu outbreaks in U.S. farm animals",
      "summary": "The U.N. health agency confirmed that a suspected case, a 4-year-old child in the eastern state of West Bengal, was infected with the H9N2 avian flu virus.\nIndia's first human avian flu case was confirmed in 2019.\nThe cases in India involve a different bird flu virus than the one infecting animals and several people in the U.S., where it is the H5N1 strain spreading through herds.\nNasal swabs confirmed an influenza infection, which the WHO has now confirmed as influenza-A sub-type H9N2, the avian flu.\nIndia has witnessed several avian flu outbreaks since 2006, when the first case was detected.",
      "url": "https://www.cbsnews.com/news/bird-flu-human-case-india-h9n2-infection-amid-us-concern-h5n1-avian-influenza/",
      "imgURL": "https://assets1.cbsnewsstatic.com/hub/i/r/2024/06/12/365115da-04fa-4638-8867-e147d83de364/thumbnail/1200x630/b3c02c70e9116633b4e46a9da86e0156/india-bird-flu-1231528863.jpg?v=5842509bb796a146f9b20d3e8b03dac6"
    },
    {
      "news_number": 3,
      "title": "India-made TB diagnostics tech wins acclaim at World Health Assembly",
      "summary": "Developed by Goa-based Molbio, a point-of-care molecular diagnostics company, Truenat was first launched in 2017 and is a real-time quantitative micro-PCR system.\nIt is a portable, battery-operated machine that can be deployed at labs, health centres, and in the field.\nMr. Nararajan said TrueNat is used at over 7,000 primary health centres and community health centres under the National TB Elimination Programme and is also being used at roughly 1,500 private labs in the country.\nAt the Assembly, Union Health Secretary Apurva Chandra called upon The Global Fund to continue its support for the TB programme to strengthen the capacities of public health systems, according to a Press Information Bureau release.\nThe WHO reports over 10 million new cases of TB every year, and India alone accounts for 27% of the global TB burden.",
      "url": "https://www.thehindu.com/sci-tech/health/india-made-tb-diagnostics-tech-wins-acclaim-at-world-health-assembly/article68280749.ece",
      "imgURL": "https://th-i.thgim.com/public/sci-tech/health/7dt1g0/article68280758.ece/alternates/LANDSCAPE_1200/Molbio%20at%20World%20Health%20Assembly%20Geneva%20discussing%20Point%20of%20Care%20Diagnostics.jpeg"
    },
    {
      "news_number": 4,
      "title": "Tackling NCDs to Improve Child Health Outcomes in India",
      "summary": "Children and adolescents who have NCDs require access to quality health care, including trained professionals who can provide early detection and diagnosis of NCDs.\nQ: In what ways, aside from health, do NCDs affect children, families and communities in India?\nLUIGI D'AQUINO: NCDs impact children, families and communities in various ways, straining community resources and affecting overall well-being and productivity.\n© UNICEF/UN0662421/SoniQ: What is one thing you’re optimistic about regarding the future of health care in India?\nIndia’s vision of universal health coverage through primary health care by 2030 adds to my optimism.",
      "url": "https://www.unicefusa.org/stories/tackling-ncds-improve-child-health-outcomes-india",
      "imgURL": "https://www.unicefusa.org/sites/default/files/2024-05/UN0646407%20women%20in%20red%20dress%20at%20health%20care%20center_0.jpg"
    },
    {
      "news_number": 5,
      "title": "Gurgaon Startup Tap Health Transforms Healthcare Access in India",
      "summary": "Find out howAs per Rahul Maroli, Founder & CEO of Tap Health, “In regions like India, where over 80% of illnesses are diagnosed late, Tap Health fills a gap by providing free, precise, and dependable preliminary advice.\nA \"Made for India\" Health App\"Tap Health is 'Made for India,'\" explains Mr. Maroli.\n\"Our AI tailors’ recommendations to optimise each user's health based on their unique needs and preferences,\" explains Manit Kathuria, co-founder of Tap Health.\nWhile the basic version of chronic ailment management is free on Tap Health, the startup is also launching tailored chronic ailments management plans.\nAI-Driven Healthcare is Rapidly Becoming CommonTap Health represents a transformative force in Indian healthcare.",
      "url": "https://www.hindustantimes.com/brand-stories/gurgaon-startup-tap-health-transforms-healthcare-access-in-india-101718605696183.html",
      "imgURL": "https://www.hindustantimes.com/ht-img/img/2024/06/17/1600x900/HT_Start_up_1718605863983_1718605881417.jpg"
    },
    {
      "news_number": 6,
      "title": "India nursing students to spend two weeks on frontlines of N.B. health-care system",
      "summary": "Growing up in India, Jessal Gladvin watched his older sister navigate a rare condition and how his mother helped treat her.\nNow, in his third year of nursing at Manipal College of Nurses, Gladvin finds himself in Fredericton, N.B., ready to experience health care through the Canadian lens.\n“This gives us an opportunity to see if we really want to go to Canada,” he said.\n“Manipal and UNB have collaborated and actually gave us a really great opportunity to come to another country, experience how things work here.\n“Over here, it was much more calm and composed.”Butler says the partnership has been done ethically, not taking from India’s health-care system.",
      "url": "https://atlantic.ctvnews.ca/more/india-nursing-students-to-spend-two-weeks-on-frontlines-of-n-b-health-care-system-1.6929748",
      "imgURL": "https://www.ctvnews.ca/content/dam/ctvnews/en/images/2024/6/17/students-1-6929761-1718638072375.jpg"
    },
    {
      "news_number": 7,
      "title": "Heatwave in India had most impact on water resources, health, farming: WMO chief",
      "summary": "The mortality and economic costs of heatwaves have remained widely under-reported, Professor Celeste Saulo, Secretary-General, World Meteorological Organization (WMO) said recently.\n“Water-related hazards are the main reported cause of human casualties and economic losses in Asia.\nHowever, mortality and the economic cost of heatwaves is widely under-reported,” said Saulo, in an email interview with The Indian Express.\nThis year, India has been experiencing unprecedented heatwave conditions which commenced as early as March, which even affected areas outside the core heatwave zone, like Jammu and Kashmir, Himachal Pradesh(12 days), Kerala (5 days).\nThe maximum temperatures recorded in many areas across northwest and northern India not only broke all previous records but saw newer localities reporting 50 degrees Celsius on multiple occasions.",
      "url": "https://indianexpress.com/article/india/heatwave-in-india-had-most-impact-on-water-resources-health-farming-wmo-chief-9393613/",
      "imgURL": "https://images.indianexpress.com/2024/06/heat-3col_8546e2.jpg"
    },
    {
      "news_number": 8,
      "title": "How AI health care chatbots learn from the questions of an Indian women’s organization",
      "summary": "NEW YORK (AP) — Komal Vilas Thatkare says she doesn’t have anyone to ask about her most private health questions.\nThatkare asks the Myna Bolo chatbot questions and it offers answers.\nIt draws on a customized database of medical information about sexual health, but the chatbot’s potential success relies on test users like Thatkare to train it.\nFunders like the Gates Foundation, the Patrick J. McGovern Foundation and Data.org, are seeking to build up this “missing middle” in AI development, especially in areas like health and education.\nThe Myna Mahila Foundation recruited test users like Thatkare to write real questions they have.",
      "url": "https://apnews.com/article/ai-health-care-chatbot-india-6e820475e89dbc15ce1880695f698934",
      "imgURL": "https://dims.apnews.com/dims4/default/38be945/2147483647/strip/true/crop/7572x4259+0+394/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F66%2F62%2F25d22d31872fb1d38328bfcfa265%2F0d5002b039114305996d5de0c9b64ab8"
    },
    {
      "news_number": 9,
      "title": "How AI supports early disease detection in India",
      "summary": "Our newest collaboration with Apollo Radiology International in India is building on these AI advancements in healthcare and bringing them to communities across the country.\nLung cancer and breast cancer also require specialized screening and medical expertise to interpret scans.\nThere is no nationalized screening program for high-risk individuals to try to catch the disease early, when treatment is most effective.\nIndia also has more than three times the death rate from breast cancer, compared to the U.S.\nWe’re hopeful that AI can assist radiologists in interpreting mammograms to scale screening in India.",
      "url": "https://blog.google/technology/health/google-ai-india-early-disease-detection/",
      "imgURL": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/BBCSW_GH_v13_1.width-1300.jpg"
    },
    {
      "news_number": 10,
      "title": "Recap: India Health Conference 2024",
      "summary": "Recap: India Health Conference 2024The Scientific Congress on Challenges in Disease Management and Outcome brought together 175 participants and showcased 50 speakers, moderators and panelists in Mumbai on Feb. 9 - 10.\nOrganized by the India Gateway in collaboration with health partners in South Asia, this marked the fifth international conference of its kind, and strengthened the ongoing partnership between The Ohio State University and Nanavati Super Specialty Hospital.\nThe conference focused on critical areas of healthcare including maternal care and neonatal infections, evolving strategies in HIV and tuberculosis treatments, advancements in tropical disease vaccines, and the complexities of oncology and public health.\nAttending the conference from Ohio State were Abhay Satoskar, Wexner Medical Center, and Raghu Machiraju, College of Engineering, and from the College of Medicine, Murugesan Rajaram, Amit Singh and Kartik Venkatesh.\nThe conference fostered rich networking opportunities, sparking considerable interest in partnership opportunities with Ohio State and served as a catalyst for knowledge exchange with a shared commitment to addressing healthcare challenges and improving outcomes in the region.",
      "url": "https://oia.osu.edu/news/recap-india-health-conference-2024/",
      "imgURL": "https://oia.osu.edu/media/qgqp3vml/india_conf-group_2024.jpg"
    },
    {
      "news_number": 11,
      "title": "Japan's Olympus to develop R&D hub in India for medical equipment",
      "summary": "TOKYO -- Olympus will develop a research and development facility in India, the Japanese medical equipment maker said Wednesday, as it looks to make the facility a key base for developing products for emerging markets.\nThe Tokyo-based company said it will launch an innovation incubator in Hyderabad, in south-central India, as early as possible, with the goal of creating a full-fledged development center in the coming years.",
      "url": "https://asia.nikkei.com/Business/Health-Care/Japan-s-Olympus-to-develop-R-D-hub-in-India-for-medical-equipment",
      "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F0%2F2%2F4%2F1%2F47821420-3-eng-GB%2FOlympusIndia.jpg?width=1260&height=630&fit=cover&gravity=faces&source=nar-cms"
    },
    {
      "news_number": 12,
      "title": "India",
      "summary": "FHI 360 specifically DISCLAIMS any relationship for any purposes with LMRS and asks that you contact FHI 360 by reporting the incident to Mr. Sharad Malhotra at tel: 91-11-40487777 with details.\nFHI 360 has been working in India for almost two decades and is well recognized in the country today for its technical excellence, robust research and evidence-based integrated programming.\nOur portfolio in India includes diverse projects that span across technical assistance, research and implementation.\nOur diversified donor base includes the Bill & Melinda Gates Foundation, U.S. Agency for International Development, U.S. Centers for Diseases Control and Prevention and the U.K. Department for International Development (DFID).\nIn the decade ahead, FHI 360 will continue to lead in public health and human development in India, focusing on building evidence, systems and capacities to improve the lives of underserved populations.",
      "url": "https://www.fhi360.org/countries/india/",
      "imgURL": "https://www.fhi360.org/wp-content/uploads/2015/10/country-banner-india.jpg"
    },
    {
      "news_number": 13,
      "title": "8 health benefits of consuming Turmeric and Ginger together",
      "summary": "How to add Ginger and Turmeric to the daily dietGolden MilkSmoothiesCurries and Stir-FriesThe prospect of combining ginger and turmeric may seem like a match made in heaven, promising a mixture of anti-inflammatory and antioxidant goodness.\nTurmeric has powerful antioxidant properties that help protect cells from damage caused by free radicals, reducing the risk of chronic diseases.\nAdd honey and lemon for extra flavor.Whisk Turmeric and Ginger into homemade salad dressings or marinades for an added nutritional punch.Incorporate grated ginger and turmeric into soups and stews.\nGinger and turmeric are known for their immune-boosting properties, with ginger offering anti-inflammatory benefits and turmeric providing antioxidant support.\nPregnant or breastfeeding women should consult a doctor before use due to potential effects on pregnancy and infants.How to make Ginger Turmeric candiesGinger turmeric candies can be made by combining finely grated ginger and turmeric with honey or sugar in a saucepan over medium heat, stirring until the mixture thickens into a syrup-like consistency.",
      "url": "https://timesofindia.indiatimes.com/life-style/food-news/7-health-benefits-of-consuming-turmeric-and-ginger-together/articleshow/110594416.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-110594416,width-1070,height-580,imgsize-165256,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 14,
      "title": "Weekly Health Horoscope from June 16 to June 22, 2024",
      "summary": "Everyone around you wants you to pay attention to your mental and physical health.\nTake a whole-person attitude to health and happiness by taking care of your physical and mental health .\nNo matter what comes your way, taking care of your health will help you get through it.This week is all about taking care of your inner being when it comes to your well-being and health.\nRemember that being healthy and happy comes from the inside out.The health of your spirit is just as important as the health of your body, Pisces.\nTaking care of your spirit will make you feel more grounded and give you the energy to face any problems that come your way.",
      "url": "https://timesofindia.indiatimes.com/astrology/horoscope/weekly-health-horoscope-from-june-16-to-june-22-2024/articleshow/111012393.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111012706,width-1070,height-580,imgsize-66014,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 15,
      "title": "Embracing diversity: 10 essential LGBTQ+ mental health books for millennials",
      "summary": "Much to the uprising of the LGBTQ community, the Supreme Court of India, in 2023, rejected the same sex marriage act, however, the court did claim to grant several other rights to the LGBTQ community, including protection against discrimination, the right to choose a partner, the right to intimate association, and the right to adopt children.\nYet, on hearing and reading stories of the queer community we learn these rights are often, continually violated in India.The mental health of the LGBTQ community in India remains legally and emotionally wounded and stretched.\n: I love young adult fiction, I'm an honest enthusiast for those melt-in-your-mouth beach reads.\nMatters of sexuality are closely tied into our familial bonds, thus books speaking through that prism are always wondrous.\n: Last on this list of the many, many books you’ll find under this genre, this beauty by Emily M Danforth.",
      "url": "https://timesofindia.indiatimes.com/life-style/books/features/embracing-diversity-10-essential-lgbtq-mental-health-books-for-millennials/articleshow/111013342.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111013407,width-1070,height-580,imgsize-67512,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 16,
      "title": "Technical Difficulties",
      "summary": "We’re sorry, this site is currently experiencing technical difficulties.\nPlease try again in a few moments.\nException: request blocked",
      "url": "https://in.usembassy.gov/usaid-assistant-administrator-for-global-health-dr-atul-gawande-visits-india-to-advance-the-u-s-india-health-partnership/",
      "imgURL": ""
    },
    {
      "news_number": 17,
      "title": "​10 rules of Ikigai to boost mental health​",
      "summary": "What is Ikigai?\nIkigai is a Japanese concept that means \"a reason for being.\"\nIt represents the intersection of what you love, what you are good at, what the world needs, and what you can be paid for.\nEmbracing ikigai leads to a fulfilling, balanced life.",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/web-stories/10-rules-of-ikigai-to-boost-mental-health/photostory/111032307.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111032339,imgsize-302357,width-900,height-1200,resizemode-6/111032339.jpg"
    },
    {
      "news_number": 18,
      "title": "India’s First Homegrown CAR T-Cell Therapy",
      "summary": "February 7, 2024 , by Linda WangFollowing India's recent approval of NexCAR19, patients with cancer there will soon have access to an affordable CAR T-cell therapy.\nDuring their time at the NIH Clinical Center, this team shadowed leading experts in CAR T-cell therapy at NCI’s Center for Cancer Research.\nThey hoped that this “humanized” CAR T-cell therapy would escape immune system attack.\nWhen they returned to India, they successfully manufactured several versions of a humanized CAR T-cell therapy.\nA model for global team scienceDr. Karulkar noted during his presentation that, in the United States, an infusion of CAR T-cell therapy costs about $400,000.",
      "url": "https://www.cancer.gov/news-events/cancer-currents-blog/2024/nexcar19-car-t-cell-therapy-india-nci-collaboration",
      "imgURL": "https://www.cancer.gov/sites/g/files/xnrzdm211/files/styles/cgov_social_media/public/cgov_image/media_image/2024-02/pediatric-patient-India.jpg"
    },
    {
      "news_number": 19,
      "title": "NIEHS catalyzes research collaborations in India",
      "summary": "NIEHS Director Rick Woychik, Ph.D., and other institute leaders traveled to India in January to build collaborations with researchers there who are working to combat the health effects of environmental exposures, such as poor air quality.\n“Ambassador Garcetti is very interested in the work that we do at NIEHS, and addressing some of the challenges that they have with environmental exposures across India,” Woychik said.\n\"There is an increased recognition of the importance of environmental health research,” Nadadur said.\n“These leading Indian federal research and development agencies expressed interest for exchange of expertise and collaboration.”The Indian researchers are not seeking funding, only collaborative relationships on environmental health sciences studies.\nResearchers at NIEHS, and the wider National Institutes of Health community, that are interested in collaborating should contact Nadadur.",
      "url": "https://factor.niehs.nih.gov/2024/3/feature/3-feature-india-research-collab",
      "imgURL": "https://factor.niehs.nih.gov/sites/niehs-factor/files/2024/02/feature/india-research-collab-og.jpg"
    },
    {
      "news_number": 20,
      "title": "India: LIC denies reports it plans to acquire a health insurer",
      "summary": "State-controlled Life Insurance Corporation (LIC), India's biggest life insurer, has clarified that it currently does not have any official proposal to enter the health insurance sector.\nAs per existing regulations, life insurance companies are not permitted to offer health insurance policies, which are exclusively sold by general insurers or dedicated health insurance providers.\nIn a regulatory filing, LIC said, \"We hereby clarify that at present, no such formal proposal (for health insurance via private health insurer) has been initiated.\"\nHowever, the company added that it regularly assesses and explores various strategic opportunities, including inorganic growth options and strategic partnerships, as part of its normal business operations.",
      "url": "https://www.asiainsurancereview.com/News/ViewNewsLetterArticle/id/88523/Type/eDaily/India-LIC-denies-reports-it-plans-to-acquire-a-health-insurer",
      "imgURL": "https://www.asiainsurancereview.com/UploadedImages/ImageLibrary/Life%20and%20Health/large/Health%20Insurance.jpg"
    },
    {
      "news_number": 21,
      "title": "Rising Heat Index in Bengal escalates health issues, warn experts",
      "summary": "\"The sources of both air pollution and climate change are the same.\nFighting air pollution proves beneficial for mitigating climate change,\" he explained.\n\"International Collaboration and Future OutlookBangladesh Deputy High Commissioner in Kolkata, Andalib Elias, echoed Rudra's concerns, highlighting the disproportionate impact of climate change on Bangladesh.\n\"Our contribution to global greenhouse gas emissions is negligible, yet we bear the brunt of climate change the most.\nThis sentiment underlined the urgent need for sustainable practices and resilient economic activities to safeguard both human health and the environment in the face of climate change.",
      "url": "https://timesofindia.indiatimes.com/india/rising-heat-index-in-bengal-escalates-health-issues-warn-experts/articleshow/111005315.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111005308,width-1070,height-580,imgsize-1308206,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 22,
      "title": "New COVID variant KP.3 on loose, groundwater in Himachal town is carcinogenic agents, reasons why India is becoming a cancer hot spot, and more - Times of India",
      "summary": "Today’s highlights include the rise of the new COVID-19 variant , KP.3, now responsible for over 25% of cases in the US, surpassing the JN.1 variant.\nMeanwhile, a recent WHO report reveals India faced 1.41 million new cancer cases in 2022, leading to over 910,000 deaths.\nIn environmental health, researchers from IIT Mandi found cancer-causing agents in the groundwater of Himachal Pradesh's Baddi Barotiwala area.\nResearchers from IIT Mandi found cancer-causing agents in the groundwater , leading to numerous cases of cancer and renal diseases between 2013 and 2018.\nHowever, while working at your desk, you can practice simple exercises to improve your sexual health.",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/toi-health-news-morning-briefing-new-covid-variant-kp-3-on-loose-groundwater-in-himachal-town-is-carcinogenic-agents-reasons-why-india-is-becoming-a-cancer-hot-spot-and-more/articleshow/110999806.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-110999737,width-1070,height-580,imgsize-1080127,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 23,
      "title": "What to expect during and after Ultherapy treatment",
      "summary": "During Ultherapy TreatmentThe practitioner will mark the areas to be treated with a special pen.\nThe practitioner will use the Ultherapy device to deliver focused ultrasound energy beneath the skin's surface.\nThe treatment typically takes 30 to 90 minutes, depending on the size of the area being treated.\nImmediately after Ultherapy TreatmentWeeks and months after Ultherapy TreatmentLong-term expectationsUltherapy is a non-invasive cosmetic procedure that uses focused ultrasound energy to lift and tighten the skin on the face, neck, and décolletage.\nHere's a comprehensive guide on what to expect during and after an Ultherapy treatment .Before undergoing Ultherapy, you'll have a consultation with a qualified practitioner, like the ones at The Wellness Co , to discuss your goals, medical history, and any concerns you might have.",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/what-to-expect-during-and-after-ultherapy-treatment/articleshow/111033696.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111033662,width-1070,height-580,imgsize-825405,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 24,
      "title": "Catalyzing Clean Air in India",
      "summary": "ContextGlobally, air pollution is a silent killer.\nThe air pollution levels in India are among the highest in the world, posing a heavy threat to the country's health and economy.\n1.67 million deaths were attributable to air pollution in India in 2019, accounting for 17.8% of the total deaths in the country.\nLost output from premature deaths and morbidity attributable to air pollution accounted for economic losses of US$28.8 billion and $8 billion, respectively, in India in 2019.\nThe air pollution challenge in India is therefore inherently multi-sectoral and multi-jurisdictional, requiring an “airshed” approach.",
      "url": "https://www.worldbank.org/en/country/india/publication/catalyzing-clean-air-in-india",
      "imgURL": "https://www.worldbank.org/content/dam/photos/768x384/2021/sep/IMG_2677.jpeg"
    },
    {
      "news_number": 25,
      "title": "Why a New Study Dubbed India the ‘Cancer Capital of the World’",
      "summary": "Despite reporting more than a million new cases every year, India’s cancer rate has not yet surpassed countries like Denmark, Ireland, and Belgium, which record some of the highest cancer rates in the world.\nIn particular, the number of cancer cases is expected to rise at a rate that will surpass global averages—from 1.39 million in 2020 to 1.57 million by 2025.\nAmong women, the most common forms of cancer are breast cancer, cervix cancer, and ovarian cancer.\nAmong men, they are lung cancer, mouth cancer, and prostate cancer.\nWhile men generally report a 25% higher incidence of cancer than women globally, India bucks this trend with more women getting diagnosed with cancer, according to a study published in the Lancet Oncology.",
      "url": "https://time.com/6965528/india-cancer-capital-world-study/",
      "imgURL": "https://api.time.com/wp-content/uploads/2024/04/GettyImages-1179037807.jpg?quality=85&w=1024&h=628&crop=1"
    },
    {
      "news_number": 26,
      "title": "A Guide to Health Reform: Eight Practical Steps",
      "summary": "A Guide to Health Reform: Eight Practical Steps instructs readers, in clear language and general terms, about how to navigate the complex process of health system reform.\nIt is written for health reformers (including government policy makers, analysts, advisors, advocates and other stakeholders) in any country to use as they plan and implement health reform.\nThe Guide breaks down the health system reform process into eight steps.\nThe eight steps can be read (and applied) in a different order depending on the needs and circumstances of health reformers.\nA Guide to Health Reform: Eight Practical Steps here View and download the full guideCitationReich MR, Campos PA, Kalita A, Guyer AL, Yip W. A Guide to Health Reform: Eight Practical Steps.",
      "url": "https://www.hsph.harvard.edu/india-health-systems/guide-to-health-reform/",
      "imgURL": "https://www.hsph.harvard.edu/india-health-systems/wp-content/uploads/sites/2216/2023/08/Health-System-Control-Knobs-2023-white-rounded-300x300.png"
    },
    {
      "news_number": 27,
      "title": "JP Nadda takes charge of Health Ministry: Six challenges ahead in Modi 3.0",
      "summary": "BJP President JP Nadda has been given the job of steering the Health Ministry in Modi 3.0.\nJP Nadda takes charge as Minister of Health and Family Welfare.\nUnion Minister JP Nadda greets MoS Anupriya Patel after the latter took charge as MoS in the Ministry of Health and Family Welfare, in New Delhi.\nUnion Minister JP Nadda takes charge as Minister of Health and Family Welfare, in New Delhi, Tuesday, June 11, 2024.\nUnion Minister JP Nadda takes charge as Minister of Health and Family Welfare, in New Delhi.",
      "url": "https://www.indiatoday.in/health/story/j-p-nadda-takes-charge-of-health-ministry-six-challenges-ahead-modi-3-2552685-2024-06-13",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/india-today-spoke-to-experts-about-challenges-at-the-start-of-the-modi-30-era-and-what-could-be-don-131523159-16x9_0.jpg?VersionId=xWorI30.0vIgbvzyRyR1Ls9eJ.07Wlhs"
    },
    {
      "news_number": 28,
      "title": "First bird flu case in India this year, confirms WHO: Here’s what you need to know",
      "summary": "This is the second human case of H9N2 strain of bird flu reported from India — the first having been reported in 2019.\nAdvertisementTwo, a case of bird flu reported by Australia is thought to have been exposed to the virus in Kolkata in February this year.\nThe strain of virus in both cases, however, are different — H5N1 in the Australian case and H9N2 in the Indian case — indicating different sources of infection.\nThere has been an increased focus on bird flu this year after three dairy farm workers from the US were reported to have been infected with highly pathogenic avian influenza A (H5N1).\nWith most cases of bird flu being reported by people who handle poultry, it is important that animals and poultry are handled with care.",
      "url": "https://indianexpress.com/article/health-wellness/first-bird-flu-case-india-2024-all-you-need-to-know-9387525/",
      "imgURL": "https://images.indianexpress.com/2024/06/Bird-Flu-2.jpg"
    },
    {
      "news_number": 29,
      "title": "Heatwave Advisory: Health ministry releases advisory as India witnesses longest heatwave",
      "summary": "Health of elderly or sick people living alone should be monitored on a daily basis.\nHow yoga elevates overall well-beingOrange alert in DelhiHow to stay safe during intense heatwave?\nFollow these simple tips to stay cool and comfortable, the health ministry has warned.The list of precautions are:\"Heat wave to severe heat wave conditions are likely to continue over northern parts of India during next 4-5 days,\" the India Meteorological Department has said in a press release on Thursday.\n\"Use ORS, homemade drinks like lassi, torani (rice water), lemon water, buttermilk, etc.\nCheck on vulnerable individuals such as the elderly, children, and pets, ensuring they stay cool and hydrated.",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/remain-on-lower-floors-health-ministry-releases-advisory-as-india-witnesses-longest-heatwave/articleshow/110967261.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-110967173,width-1070,height-580,imgsize-630441,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 30,
      "title": "India and G20: Expectations from a Public Health Perspective",
      "summary": "All these elements were reflected in tangible ways in India’s leadership of the G20 health workstream.\nAdditionally, India aimed for the G20 to establish a role for integrative (traditional) medicine in global health systems, including Ayurvedic medicine.\nQ1: What were the key outcomes of the G20 Health Ministers’ Meeting?\nA1: The robust, 25-paragraph Outcome Document and Chair’s Summary issued following the G20 Health Ministers’ Meeting in August covered all of the Indian presidency’s priority areas, building on prior G20 work.\nThis close partnership moved front and center in discussions and workshops in the lead-up to the August G20 Health Ministerial.",
      "url": "https://www.csis.org/analysis/india-and-g20-expectations-public-health-perspective",
      "imgURL": "https://csis-website-prod.s3.amazonaws.com/s3fs-public/2023-09/GettyImages-2396044.jpg?VersionId=as9gskiB0tMbLBOcODvG3t0HhUJnHXYs"
    },
    {
      "news_number": 31,
      "title": "No formal proposal to enter health insurance: LIC",
      "summary": "NEW DELHI: The Life Insurance Corporation ( LIC ) on Friday clarified that there is currently no official proposal to venture into the health insurance sector .\nAs per existing regulations, life insurance companies are not permitted to offer health insurance policies, which are exclusively sold by general insurers or dedicated health insurance providers.In a regulatory filing, LIC said, \"We hereby clarify that at present, no such formal proposal (for health insurance via private health insurer) has been initiated.\n\"However, the company added that it regularly assesses and explores various strategic opportunities, including inorganic growth options and strategic partnerships, as part of its normal business operations.There is anticipation that composite licenses, allowing insurers to provide life, general, or health insurance under a single entity, may be introduced through amendments to the Insurance Act.\nCurrently, the Insurance Act , 1938, and the regulations set by the Insurance Regulatory Development Authority of India (Irdai) do not permit composite licensing .In February, a parliamentary panel , chaired by BJP leader Jayant Sinha, recommended the introduction of composite licensing for insurance companies to increase insurance penetration in India.\nThe panel suggested that the government make the necessary legislative amendments at the earliest.The report, which was presented in Parliament, highlighted the potential benefits of composite licensing, such as reduced costs and compliance hassles for insurers, as they can operate different insurance lines under one roof.",
      "url": "https://timesofindia.indiatimes.com/business/india-business/no-formal-proposal-to-enter-health-insurance-lic/articleshow/111002664.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111002698,width-1070,height-580,imgsize-1171889,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 32,
      "title": "Cerelac has high sugar content, fatty liver disease signs to know, why magnesium deficiency should not be ignore, energy drinks and heart health, and more - Times of India",
      "summary": "Indian variant of Cerelac has 2.7 grams of sugar, which crosses the WHO recommended limit for sugar intake.\nRegular consumption can strain the cardiovascular system, potentially leading to long-term heart health issues.\nWarning signs of fatty liver disease: Fatty liver disease , characterized by excess fat accumulation in liver cells, can lead to inflammation and liver damage.\nHere are 7 yoga poses inspired by animals that can help us tap into our inner strength, flexibility, and inner strength.\nHow okra water helps men : Okra water benefits men by aiding in blood sugar regulation, supporting prostate health, and enhancing digestion due to its high fiber content.",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/toi-health-news-morning-briefing-cerelac-has-high-sugar-content-fatty-liver-disease-signs-to-know-why-magnesium-deficiency-should-not-be-ignore-energy-drinks-and-heart-health-and-more/articleshow/111024454.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111024470,width-1070,height-580,imgsize-1080127,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 33,
      "title": "Air Pollution, Climate Change, and Health in India (Part II)",
      "summary": "We will also hear about how NIEHS as formed partnerships in India, with the goal of addressing these challenges and improving public health.\nLike many developing countries, India faces many adverse impacts from climate change and poor air quality, which present significant challenges for public health.\nPart 2: NIEHS PerspectiveJohn Balbus, M.D., directs the NIEHS – World Health Organization Collaborating Center for Environmental Health Sciences, and co-chairs working groups on Climate Change and Human Health at NIH and the U.S.\nHis background combines clinical medicine with expertise in epidemiology, toxicology, and risk sciences, particularly related to climate change and public health.\nThe fellowship included working with interagency colleagues to promote health systems and preparedness in India regarding urban air quality.",
      "url": "https://www.niehs.nih.gov/research/programs/geh/podcasts/2018/december21_airpollution_part2",
      "imgURL": "https://www.niehs.nih.gov/sites/default/files/research/programs/geh/podcasts/2018/december21_airpollution_part2/airpollution_og.jpg"
    },
    {
      "news_number": 34,
      "title": "A Rare ‘Flesh-Eating Bacteria’ in Japan Kills People Within 48 Hours, All You Need to Know About The Major Health Crisis",
      "summary": "HomeHealthA Rare ‘Flesh-Eating Bacteria’ in Japan Kills People Within 48 Hours, All You Need to Know About The Major Health CrisisA Rare ‘Flesh-Eating Bacteria’ in Japan Kills People Within 48 Hours, All You Need to Know About The Major Health CrisisA deadly disease caused by Group A Streptococcus (GAS) bacteria is reportedly spreading across Japan.\nHealth experts warn of its potential seriousness, as it can lead to conditions such as streptococcal toxic shock syndrome (STSS)A Rare 'Flesh-Eating Bacteria' in Japan Kills People Within 48 Hours, All You Need to Know About The Major Health CrisisCases of streptococcal toxic shock syndrome (STSS), a disease caused by a rare ‘flesh-eating bacteria’ that can kill people within 48 hours, are spreading in Japan, according to a report by Bloomberg.\n“Most of the deaths happen within 48 hours.\nThe rare flesh-eating bacteria is known as Group A Streptococcus (GAS).\nGroup A Streptococcus (GAS) bacteria, commonly known as streptococcus pyogenes, is a type of bacteria that can cause a variety of infections.",
      "url": "https://www.india.com/health/a-rare-flesh-eating-bacteria-in-japan-kills-people-within-48-hours-all-you-need-to-know-about-the-major-health-crisis-7018642/",
      "imgURL": "https://static.india.com/wp-content/uploads/2024/06/WhatsApp-Image-2024-06-16-at-12.08.23-PM.jpeg"
    },
    {
      "news_number": 35,
      "title": "India economic outlook, April 2024",
      "summary": "Decoding the growth seen in the third quarter of fiscal 2024Real GDP growth climbed to 8.4% YoY in third quarter of the current fiscal year.\nBy the expenditure-approach method, GDP growth in the third quarter was aided by a strong uptick in private investment spending, which grew by 10.6% YoY.\nOn the other hand, private consumption improved to 3.5% YoY from the third quarter of fiscal year 2024.\nThe index of industrial production of consumer durables and improved passenger and two-wheeler sales indicated a revival in private consumption over this period.\nRobust growth in manufacturing (11.6% YoY) and construction activities (9.5% YoY), along with a steady positive performance in services (7% YoY) kept economic activity strong.",
      "url": "https://www2.deloitte.com/us/en/insights/economy/asia-pacific/india-economic-outlook.html",
      "imgURL": "https://assets.deloitte.com/is/image/deloitte/IN187268_social:1200-x-627"
    },
    {
      "news_number": 36,
      "title": "Research Shows Value of Mental Health Training for Teachers in India",
      "summary": "Could offering just three days of child mental health training to primary school teachers in a rural area of India help improve teachers’ mental health literacy and address students’ mental health needs?\nThe findings were published in a short research article in the journal Child and Adolescent Mental Health.\n“Personally, I feel like there’s a lot of work to be done in the field of mental health and child mental health,” she says.\nA main difference between TeaLeaf and RESEED is that RESEED is a three-day training rather than a 10-day training, Ekhteraei says.\nAnother barrier was that some parents did not understand what RESEED was and had a stigma about mental health.",
      "url": "https://news.cuanschutz.edu/medicine/research-mental-health-training-teachers",
      "imgURL": "https://news.cuanschutz.edu/hubfs/SOM%20RESEED%20Hero%20Image%204.16.24.png#keepProtocol"
    },
    {
      "news_number": 37,
      "title": "Joe Biden: Joe Biden salutes Italian PM Meloni at G7 Summit: Is the POTUS suffering from mental decline? Is he mentally fitter than Donald Trump?",
      "summary": "By the time his tenure ends, he will be the oldest President to leave the White House at 81.\nThe White House should hear this loud and clear.\nMay 9: Trump claimed his son Barron was 17 when he’s actually 18.\nMay 14: Biden claimed inflation was 9% when he took the Presidency (it was actually 1.4% according to the Consumer Price Index).\nThe White House claimed that Biden didn’t need one and that he passes a “cognitive test every day” (as POTUS).",
      "url": "https://timesofindia.indiatimes.com/world/us/joe-biden-salute-giorgia-meloni-g7-summit-joe-biden-mental-faculty-health/articleshow/111000703.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111000703,width-1070,height-580,imgsize-130898,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 38,
      "title": "WHO confirms human case of bird flu in India",
      "summary": "The World Health Organization (WHO) on June 11 said a case of human infection with bird flu caused by the H9N2 virus was detected in a four-year-old child in India’s West Bengal.\nAlso Read | Does bird flu have the potential to turn into the next pandemic?\nInformation on the vaccination status and details of antiviral treatment were not available at the time of reporting, the WHO added.\nThis is the second human infection of H9N2 bird flu from India, with the first in 2019, the agency said.\nAn immediate response from the Indian health ministry was not available during late hours.",
      "url": "https://www.thehindu.com/sci-tech/health/who-confirms-human-case-of-bird-flu-in-india-four-year-old-infected-in-west-bengal/article68280110.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/1iw6ns/article68280117.ece/alternates/LANDSCAPE_1200/Bird_Flu_Agriculture_Explainer_95709.jpg"
    },
    {
      "news_number": 39,
      "title": "India: Bringing primary health care to remote populations in Chhattisgarh",
      "summary": "He had never sought medical attention for his swollen legs and breathlessness because he was simply too far away to visit a health care centre.\nIn Chhattisgarh, populations living in remote and rural areas are unable to travel the long distances to health clinics and had limited opportunities to address their diseases and health conditions.\nPrimary health care where people need it mostThe weekly Haat Bazaars of Chhattisgarh are a traditional form of barter system for the local population.\nA range of health services free of chargeMedical teams who operate the clinics include doctors, community health officers or mid-level health workers, pharmacists, nurses, and drivers.\nThis means greater equity in access, and firmly places primary health care as the foundation of a stronger health system overall.",
      "url": "https://www.who.int/news-room/feature-stories/detail/india--bringing-primary-health-care-to-remote-populations-in-chhattisgarh",
      "imgURL": "https://cdn.who.int/media/images/default-source/funding/maternal-health_india_exr.tmb-1200v.jpg?sfvrsn=79585828_1"
    },
    {
      "news_number": 40,
      "title": "Health & Family Welfare | The health makeover",
      "summary": "India’s healthcare system and parameters have improved in the past decade.\nHowever, if the country is ever to be at par with advanced healthcare systems such as the US, Japan or the UK, there has to be more financial investment.\nAccording to the medical journal Lancet, government spending on health has declined, hovering at a meagre 1.2 per cent of the GDP in the past few years.\nThe government, though, says its expenditure has increased, from 1.13 per cent in 2014-15 to 1.35 per cent of the GDP in 2019-20.\nThis is expected to hit 2.5 per cent by 2025, as per the National Health Policy, 2017.",
      "url": "https://www.indiatoday.in/magazine/cover-story/agenda-2024/story/20240624-health-family-welfare-the-health-makeover-2553485-2024-06-15",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/jp-nadda-154805677-16x9_0.jpg?VersionId=hhTxxvRH3CgsakQQVnwfyr2zc4USpCiY"
    },
    {
      "news_number": 41,
      "title": "Minister Nadda unveils 100-day healthcare agenda: Focus on expansion of coverage under AB PM-JAY",
      "summary": "Health minister JP Nadda chaired a meeting on Friday with senior officials to discuss the new government's 100-day agenda for the country's public healthcare sector.\nNadda reviewed ongoing projects and emphasized the expansion of health assurance coverage under the Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (AB PM-JAY) and the U-WIN portal, designed to digitize all routine immunizations.\nNadda expressed concern about the rising incidence of non-communicable diseases (NCDs) and highlighted the importance of awareness regarding healthy diets and lifestyles.\nHe also stressed the need for effective health emergency response management and targeted campaigns towards youth for tobacco control.\nHe emphasized creating awareness about NCDs and the harmful effects of tobacco in both scientific and simple language for better public understanding.",
      "url": "https://www.livemint.com/news/india/minister-nadda-unveils-100-day-healthcare-agenda-focus-on-expansion-of-coverage-under-ab-pmjay-11718375854538.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2024/06/14/1600x900/ANI-20240614202-0_1718378079143_1718378092130.jpg"
    },
    {
      "news_number": 42,
      "title": "How to keep your skin safe during a heatwave",
      "summary": "The extreme heat plus the excessive perspiration it causes make for a perfect storm of skin problems.\nOn the other hand, sweat, heat, and outside pollution can clog pores and cause breakouts of acne.\nTo lessen this, take a quick wash with lukewarm water after swimming to prevent depriving your skin of its natural oils.\nIt happens when sweat becomes trapped under the skin and appears as little red or white pimples.\nSun exposure can result in melasma, or brownish-black patches that grow on the skin.",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/how-to-keep-your-skin-safe-during-a-heatwave/articleshow/110928895.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-110928807,width-1070,height-580,imgsize-460749,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 43,
      "title": "Climate Change: Climate Change Effects on Heart Health: Study Reveals Alarming Risks",
      "summary": "Mumbai: Living in urban heat islands with more concrete than green cover could increase one's risk of developing cardiovascular disease (CVD) and dying, says a Harvard study.\nExposure to extreme heat and cold could adversely affect heart health of men over 65 and older women, it says.\nScreening over 2,000 studies (492 finally analysed) done between 1970 and 2023, Harvard researchers established a link between climate change-related environmental stressors and cardiovascular disease.\n“We have a high incidence of diabetes, hypertension and smoking that shouldn’t be overlooked,” he said.\nAlso, studies have shown that Indians are prone to get heart disease/heart attack at least a decade earlier than their western counterparts.",
      "url": "https://timesofindia.indiatimes.com/city/mumbai/climate-change-effects-on-heart-health-study-reveals-alarming-risks/articleshow/111008102.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    }
  ],
  "sports": [
    {
      "news_number": 0,
      "title": "How India vs Pakistan converted an American sports fan to cricket",
      "summary": "Harsh, an India fan from Toronto sitting near me, was running up and down the aisle celebrating each one with strangers.\nWhen they learned I was a reporter at my first cricket match, they became my teachers for the day.\nCricket is a religion.”If cricket is a religion then the T20 World Cup is a missionary.\nThe Athletic with Rushabh (Michael Dominski/The Athletic)Not every India fan lost hope, though.\nWhile many of the Pakistan fans look positively miserable, the result still doesn’t appear to generate rancour.",
      "url": "https://www.nytimes.com/athletic/5554005/2024/06/10/india-pakistan-cricket-world-cup-new-york-fans/",
      "imgURL": "https://cdn.theathletic.com/app/uploads/2024/06/10134632/INDIA-V-PAKISTAN-scaled.jpeg"
    },
    {
      "news_number": 1,
      "title": "Indian Sports Wrap, June 17: Diksha finishes T-6 in Rome for a third Top-10 in 2024",
      "summary": "While she has been consistently making a lot of cuts, Aditi is still seeking her first Top-10 of the season.\nMeanwhile, Delhi’s Neeru Pathak, who rewrote the girls 400m National record on Sunday, bettered junior international Rezoana Mallick Heena’s 200m meet record clocking 23.94s (old record 24.23).\n-Team SportstarCRICKETBengal Pro T20 League: Howrah Warriors beats Harbour Diamonds by 31 runsSk.\nSCORES At Eden Gardens: Men: Adamas Howrah Warriors 179/4 in 20 overs (Sk.\nAt Jadavpur University ground: Women: Sobisco Smashers Malda 104/7 in 20 overs (Hrishita Niladri Basu 44) bt Adamas Howrah Warriors 81/9 in 20 overs; Rashmi Medinipur Wizards 123/6 in 20 overs (Kashish Agarwal 69, Mita Paul 3/24) bt Lux Shyam Kolkata Tigers 95/8 in 20 overs (Debarati Guha 3/11).",
      "url": "https://sportstar.thehindu.com/other-sports/india-sports-news-results-scores-june-17-schedule-latest-updates-highlights/article68299306.ece",
      "imgURL": "https://ss-i.thgim.com/public/incoming/n6bnvn/article68299320.ece/alternates/LANDSCAPE_1200/1146192556.jpg"
    },
    {
      "news_number": 2,
      "title": "My DIY journey to build India's first All-Electric Sports Car",
      "summary": "Unlike creating another super exotic and very expensive car brand, my goal is to build the ecosystem and technology so that fellow Indians don't feel unsupported.\nThe VisionUnlike creating another super exotic and very expensive car brand, my goal is to build the ecosystem and technology so that fellow Indians don't feel unsupported.\nI want to make hardware and technology startups easier to establish in India.\nImagine the flood of hardware startups that could emerge because of that confidence.\nAs a legend once said, \"What a car guy wants is more car guys around him.\"",
      "url": "https://www.team-bhp.com/news/my-diy-journey-build-indias-first-all-electric-sports-car",
      "imgURL": "https://www.team-bhp.com/sites/default/files/styles/large/public/diy-electric-supercar.jpg"
    },
    {
      "news_number": 3,
      "title": "India TV Sports Wrap on June 17: Today's top 10 trending news stories",
      "summary": "Bangladesh beat Nepal by 21 runs to qualify for the Super Eight stage of the ICC Men's T20 World Cup 2024.\nSri Lanka beat Netherlands in T20 World CupSri Lanka defeated Netherlands by 83 runs in the 38th match of the ICC Men's T20 World Cup.\nTeam India reach Barbados for Super Eight stageTeam India have landed in Barbados for their Super Eight matches of the T20 World Cup.\nRomania to face Ukraine in Euro 2024Romania will lock horns with Ukraine in the Euro 2024 on Monday.\nNew Zealand to square off against Papua New Guinea in T20 World Cup",
      "url": "https://www.indiatvnews.com/sports/other/india-tv-sports-wrap-on-june-17-today-top-10-trending-news-stories-2024-06-17-937315",
      "imgURL": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/06/top-10-2-1718605574.jpg"
    },
    {
      "news_number": 4,
      "title": "The Indian games industry's storytelling trailblazers",
      "summary": "4 days ago By Bertin Huynh , BBC Asian Network ShareVisai Games Visai Games' Venba won a Bafta Games Award this yearIndia might not be the first country that springs to mind when someone mentions video games, but it's one of the fastest-growing markets in the world.\nThe country's three largest video game startups - Game 24X7, Dream11 and Mobile Premier League – all provide some kind of fantasy sport experience and are valued at over $1bn.\nHe wants video games to become an “interactive cultural export” but says he's found creating new intellectual property difficult.\nMala Sen, from developer Niku Games, says games like this and Detective Dotson are what “India needed”.\nCharu says video games and their interactivity allow people to “understand a concept on a very deep level.\"",
      "url": "https://www.bbc.com/news/articles/c8vv58ry8q2o",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/ddf9/live/4b083500-297b-11ef-9749-cd6cde939cc7.png"
    },
    {
      "news_number": 5,
      "title": "Sport in India: From cricket country to sports nation",
      "summary": "But the days when the Indian sports public focused solely on cricket or field hockey are over.\nHe was showered with medals and multi-million dollar awards in his home country.\nBut Neeraj Chopra can now travel even more comfortably: He received a lifetime free upgrade to business class from the airline Air India.\nSports expert Gautam Mehra knows that the young generation's self-confidence is growing: \"The feeling in India used to be that we didn't stand a chance in top international sport anyway.\nAnd young people are thinking: if they can do it, I can do it too.\"",
      "url": "https://www.ispo.com/en/sports-business/sport-india-cricket-country-sports-nation",
      "imgURL": "https://www.ispo.com/sites/default/files/styles/facebook/public/2024-02/yogendra-singh-DKcN3Lyuuro-unsplash.jpg?h=e77df50e&itok=feSm1gNR"
    },
    {
      "news_number": 6,
      "title": "T20 Cricket WCup USA India",
      "summary": "passed away June 6, with family by her side.\nService to celebrate thelife will be 1 p.m. Friday, June 14, at the Chapel of Fedeking Funeral Service, Oakvale, WV.\nBurial in Fairview Cemetery, Narrows, VA.",
      "url": "https://www.bdtonline.com/sports/national_sports/t20-cricket-wcup-usa-india/image_59dea672-9d25-5722-8fe0-c4a991b16f7d.html",
      "imgURL": "https://bloximages.chicago2.vip.townnews.com/bdtonline.com/content/tncms/assets/v3/editorial/5/9d/59dea672-9d25-5722-8fe0-c4a991b16f7d/666f030f37b5e.image.jpg?crop=1176%2C617%2C0%2C572&resize=1176%2C617&order=crop%2Cresize"
    },
    {
      "news_number": 7,
      "title": "Nitin Menon breaks Venkataraghavan's Indian record for being on-field umpire in most international matches",
      "summary": "(Photo by Matthew Lewis/Getty Images)MUMBAI: Nitin Menon , an ICC Elite panel umpire, has created history by officiating the most number of international matches as an on-field Indian umpire.\nMenon has officiated in 23 Tests, 58 ODIs and 45 T20Is (126 matches overall) as an on-field umpire.\nVenkataraghavan officiated in 73 Tests and 52 ODIs (125 matches) as an on-field umpire.\nMenon is India's only umpire in the ICC Elite Panel, where he was inducted in 2020.\nThe 40-year-old from Indore was the on-field umpire in the third Ashes Test at Headingley, Leeds last year.",
      "url": "https://timesofindia.indiatimes.com/sports/cricket/news/nitin-menon-breaks-venkataraghavans-indian-record-for-being-on-field-umpire-in-most-international-matches/articleshow/111048906.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111048886,width-1070,height-580,imgsize-34084,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 8,
      "title": "India Sports Sponsorship Report 2024",
      "summary": "This detailed report presents a thorough analysis of the evolving landscape, focusing on how sponsorships, endorsements, and media spends are influencing the future trajectory of sports in India.\n: Despite cricket’s dominance, the report uncovers how other sports like football, kabaddi, badminton, athletics, and more are carving their niche in the Indian sports industry.\nThe Athlete Endorsement Game : The report provides insights into the trends in athlete endorsements, and how sports stars are becoming powerful brand ambassadors.\n: The report provides insights into the trends in athlete endorsements, and how sports stars are becoming powerful brand ambassadors.\nMedia Spends in the Spotlight: The report delves into the role of TV and digital media in driving advertising expenses, and how OTT platforms are revolutionizing sports consumption.",
      "url": "https://www.groupm.com/india-sports-sponsorship-report-2024/",
      "imgURL": "https://d2ksis2z2ke2jq.cloudfront.net/uploads/2024/03/GroupM-Site_Small-India-Sports-Report.png"
    },
    {
      "news_number": 9,
      "title": "As a colossal match came to an oddball place, the free market howled",
      "summary": "Their ticket hopes for the latest India-vs.-Pakistan colossus had crumbled one way or another, and now they scrolled as the free market bubbled, beckoned and menaced.\nHow much would they pay for this World Cup match in T20, the newest, shortest and hottest version of the world’s second-biggest sport and South Asia’s runaway biggest sport?\nHe told of having snared tickets from a work contact, and he told of “2 million applications” for about 17,000 tickets.\n“There was little hesitation as the tickets were quite high,” Sharma would write in a text from inside the stadium.\nBack on Long Island, three impromptu travelers boarded the train and headed toward airports while bound for Nashville, Chicago and Toronto.",
      "url": "https://www.washingtonpost.com/sports/2024/06/09/india-pakistan-cricket-world-cup/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7HZJV3UEVC6RSBN7E7DZWRVW64.JPG&w=1440"
    },
    {
      "news_number": 10,
      "title": "\"Shivam Dube Not Bowling, So...\": World Cup Winner Wants India Star Dropped From T20 WC XI To Make Way For...",
      "summary": "Former India fast bowler Sreesanth has called for the inclusion of wicket-keeper batsman Sanju Samson in India's playing XI in the 2024 T20 World Cup.\nHowever, instead of replacing first-choice wicket-keeper Rishabh Pant, Sreesanth has suggested Samson being played as a pure batsman ahead of Shivam Dube.\n\"If Shivam Dube is not bowling, then Sanju (Samson) should be given an opportunity; we know he is good enough,\" said Sreesanth.\n3 in the IPL, Sreesanth suggested that he should be deployed as a finisher in the T20 World Cup.\nI don't see any score being that difficult for us to chase,\" said Sreesanth, a winner of the 2007 T20 World Cup and the 2011 Cricket World Cup.",
      "url": "https://sports.ndtv.com/t20-world-cup-2024/shivam-dube-not-bowling-so-world-cup-winner-wants-india-star-dropped-from-t20-wc-xi-to-make-way-for-5897544",
      "imgURL": "https://c.ndtvimg.com/2024-06/tke4ip3g_shivam-dube-afp_625x300_12_June_24.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675"
    },
    {
      "news_number": 11,
      "title": "Analysing the Indian sports broadcast market in 2024",
      "summary": "Yet it is mobile streaming that is proving the most disruptive force.\nCricket drives the marketUnsurprisingly, cricket is the main driving force behind the Indian sports broadcasting market.\nThe five-year deal is worth I₹5,963 crore (US$720 million) to the BCCI and cemented the Reliance-owned company’s position as a major broadcast player in Indian cricket.\nUltimately, the past 12 months have served as another reminder of why Indian broadcasters are prepared to part with such huge sums of money for cricket rights.\nWith the status quo unlikely to change in terms of cricket’s dominance, where could the next evolution in the Indian broadcast market come from?",
      "url": "https://www.sportspromedia.com/insights/features/india-sports-broadcast-market-2024-ipl-disney-reliance-pay-tv-mobile-streaming/",
      "imgURL": "https://www.sportspromedia.com/wp-content/uploads/2024/03/IPL-Rohit-Sharma-Shubman-Gill.jpg"
    },
    {
      "news_number": 12,
      "title": "Paris Olympic Games 2024: Who Is Bhajan Kaur? India's First Women Individual Recurve Archery Quota Winner From Haryana",
      "summary": "Kaur, who was seeded third at the event, was dominant in the run-up to and during the gold medal match, where she upstaged Iranian top seed Mobina Fallah 6-2 (28-26, 29-29, 29-26, 29-29).\nKaur’s individual quota win implies that India will also compete in the mixed team event at Paris 2024, with Kaur partnering Bommadevara.",
      "url": "https://www.outlookindia.com/sports/others/paris-olympic-games-2024-who-is-bhajan-kaur-indias-first-women-individual-recurve-archery-quota-winner-from-haryana",
      "imgURL": "https://media.assettype.com/outlookindia/2024-06/982a616c-6179-4296-99e9-a2165a6f9fbf/Bhajan_Kaur_Indian_archer_file_photo__Instagram_handle.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100"
    },
    {
      "news_number": 13,
      "title": "Indian Sports LIVE, June 17: Nagal achieves career-high ranking, set to play in Paris Olympics",
      "summary": "Open Extended ReactionsWelcome to ESPN India's daily blog, where we aim to bring you all the news from the dynamic world of Indian sports: from the wide variety of Olympic sports to franchise leagues.\nJune has plenty of sporting action taking place - which you can find listed out in ESPN India's sporting calendar.",
      "url": "https://www.espn.in/espn/story/_/id/40363127/indian-sports-live-june-17-2024-news-updates-scores-results-commentary",
      "imgURL": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0411%2Fr1317374_1296x729_16%2D9.jpg"
    },
    {
      "news_number": 14,
      "title": "USA vs. India: Start time, squads, where to watch 2024 T20 Cricket World Cup match",
      "summary": "Cricket in America:Why the 2024 T20 World Cup could be a 'milestone for the sport'While this year's tournament marks the U.S.'s debut in T20 cricket, India has previously won the T20 World Cup in 2007.\nHere's everything you need to know about India vs. USA at the 2024 ICC Men's T20 World Cup, including the start time, players and how to watch.\nWhen is India vs. USA?\nHow to get ICC T20 World Cup match ticketsTickets for the match between India and the U.S. are available on the official website of the T20 World Cup.\nETEpic Central in Grand Prairie at 9:30 a.m. CTUSA team for 2024 T20 World CupThe Playing XI for the U.S. includes:Aaron Jones (Captain)Andries GousCorey AndersonAli KhanHarmeet SinghJessy SinghNitish KumarSaurabh NethralvakarShadley Van SchalkwykSteven TaylorShayan JahangirIndia squad for 2024 T20 World CupIndia's squad includes:Rohit Sharma (captain)Hardik Pandya (vice captain)Virat KohliSuryakumar YadavRishabh PantShivam DubeRavindra JadejaAxar PatelKuldeep YadavArshdeep SinghJasprit BumrahMohd.",
      "url": "https://www.usatoday.com/story/sports/2024/06/11/india-vs-usa-t20-cricket/74039266007/",
      "imgURL": "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/06/06/USAT/74004857007-2155698882.jpg?crop=5119,2881,x0,y267&width=3200&height=1801&format=pjpg&auto=webp"
    },
    {
      "news_number": 15,
      "title": "Broadcast Innovation in India: How AI and Automated Production Helps Smaller Sports Grow",
      "summary": "Broadcast Innovation in India: How AI and Automated Production Helps Smaller Sports GrowSportVot's Siddhant Agarwal, Sportz Interactive's Arvind Iyengar share their thoughts and experiencesStory HighlightsIndia remains one of the more captivating markets worldwide for live sports production.\nWith a television-viewer base north of 900 million people, it’s also a region of a massive opportunity for sports broadcasters.\nSports Video Group recently hosted its first SVG India Summit on April 30 and we are proud to share recordings of the event sessions in the coming weeks.\nAt the SVG India Summit, leaders in Generative AI and automated production discuss how new tools and production services are making it easier to give a production with a small budget a big-time look and feel.\nThis conversation includes:Siddhant Agarwal, SportVot, FounderArvind Iyengar, Sportz Interactive, Chairman; Sportz Solutions Global, CEOThis session was hosted at the first SVG India Summit on April 30 in Mumbai and was moderated by Manoj Madhavan, Editor at Broadcast & Film Magazine.",
      "url": "https://www.sportsvideo.org/2024/05/17/broadcast-innovation-in-india-how-ai-and-automated-production-helps-smaller-sports-grow/",
      "imgURL": "https://www.sportsvideo.org/wp-content/uploads/2024/05/SVG-PLAY-Plugs-33.png"
    },
    {
      "news_number": 16,
      "title": "Bhajan Kaur wins gold to earn Paris quota",
      "summary": "KOLKATA: Unheralded Bhajan Kaur earned India an Olympic quota place in the women's recurve archery by winning gold in the final Olympic Qualifier tournament in Antalya, Turkey, on Sunday.\nHer teammate Ankita Bhakat too was eligible for the quota place when the Kolkata-born archer made the quarterfinals, but the single berth on offer in the event finally went to Kaur as she fared better than Bhakat.India, who missed out on team quota places in both men's and women's categories earlier in the competition, will thus make it to the mixed team event too in Paris as Dhiraj Bommadevara had already won a men's quota place.\nHowever, all eyes will be on the world rankings position after the World Cup Stage III event in Antalya, which will deter mine whether the Indian archers will manage to win team quota places.Deepika Kumari , however, crashed out, going down to Azerbaijan's Yaylagul Ramazanova 4-6 in the third round after leading 4-0.Ankita too earns placeAnkita Bhakat outplayed Gabrielle Monica Bidaure of Philippines 6-0 (26-23, 28-22, 28-23) to enter the quarterfinals on Sunday and grab an individual quota.\nIndia thus have secured individual quotas in both men's and women's sections.\nDhiraj Bommadevara had secured the men's individual quota.",
      "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/bhajan-kaur-wins-gold-to-earn-paris-quota/articleshow/111048823.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111048808,width-1070,height-580,imgsize-80198,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 17,
      "title": "Broadcast Innovation in India: As Live Sports Continues To Grow, Industry Leaders Discuss Opportunity in the Subcontinent",
      "summary": "Broadcast Innovation in India: As Live Sports Continues To Grow, Industry Leaders Discuss Opportunity in the SubcontinentLeaders from the sports-broadcast community in India share their thoughts on the businessStory HighlightsIndia remains one of the more captivating markets worldwide for live sports production.\nWith a television-viewer base north of 900 million people, it’s also a region of a massive opportunity for sports broadcasters.\nSports Video Group recently hosted its first SVG India Summit on April 30 and we are proud to share recordings of the event sessions in the coming weeks.\nWith sports-production professionals at leagues and channels across the country having more ways to produce content than ever, what’s new and exciting in the region?\nIn this exclusive panel discussion, leaders in the Indian sports-production community outline new solutions, new workflows, and how they prepare to meet new demands.",
      "url": "https://www.sportsvideo.org/2024/05/13/broadcast-innovation-in-india-as-live-sports-continues-to-grow-industry-leaders-discuss-opportunity-in-the-subcontinent/",
      "imgURL": "https://www.sportsvideo.org/wp-content/uploads/2024/05/SVG-PLAY-Plugs-31.png"
    },
    {
      "news_number": 18,
      "title": "T20 World Cup: Hardik Pandya, Rishabh Pant biggest positives for India, says Harbhajan Singh",
      "summary": "\"The biggest positive is that Hardik Pandya took the wicket.\n\"Along with him, Rishabh Pant played at number 3.\nBefore this World Cup, we were saying thatSanju Samson will play in the team because he has made big runs.\n\"To make Rishabh Pant play at number three is a big positive.\nLeft-Right combination is formed when Rishabh Pant plays at number three,\" Harbhajan said on Pant's promotion up the order.On June 20, India will take on Afghanistan in Barbados as part of their Super Eight campaign.",
      "url": "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/t20-world-cup-hardik-pandya-rishabh-pant-biggest-positives-for-india-says-harbhajan-singh/articleshow/111058681.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111058602,width-1070,height-580,imgsize-44500,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 19,
      "title": "Havas Play joins forces with SG Sports, Media, and Entertainment in India – adobo Magazine",
      "summary": "GURUGRAM, INDIA — Havas Play, Havas Media Network’s global brand dedicated to earning consumers’ attention and creating enduring business impact through meaningful experiences at the intersection of entertainment, sports, technology, and fandom, has entered a strategic partnership in India with SG Sports, Media and Entertainment (SGSE), an arm of the APL Apollo Group.\nSGSE, helmed by tennis icon Mahesh Bhupathi as Chief Executive Officer, is committed to elevating the Indian sports and entertainment landscape by creating world-class properties and unforgettable experiences.\nSGSE has teams representing it at some of India’s biggest sporting events, including Global Chess League (Alpine SG Pipers), Ultimate Table Tennis League (Ahmedabad SG Pipers), Super League Kerala (Kochi Pipers), Indian Supercross Racing League (SG Speed Racers), and Madhya Pradesh League (Jabalpur Lions) for which the inaugural season is expected to kick-off in June 2024.\nSponsorAs part of the strategic partnership, Havas Play will assist SGSE in executing premium entertainment and sports IPs spanning football, squash, hockey, chess, table tennis, and tennis.\nR. Venkatasubramanian and Mahesh BhupathiMahesh said, “We have always had a clear vision on building a comprehensive and sustainable sports and entertainment story and believe it is the right time to do this at scale in India.",
      "url": "https://www.adobomagazine.com/brand-business/havas-play-and-sg-sports-media-and-entertainment-forge-strategic-partnership-in-india/",
      "imgURL": "https://www.adobomagazine.com/wp-content/uploads/2024/06/Havas-Play-partnership-with-SGSE-hero.jpg"
    },
    {
      "news_number": 20,
      "title": "Archery: Bhajan Kaur wins gold, bags Olympic quota in women's individual recurve",
      "summary": "Bhajan Kaur has secured India's first women's individual recurve archery quota for the 2024 Paris Olympics, clinching gold at the final world qualifying tournament in Antalya on Sunday.\nIndia has now secured individual quotas in both the men's and women's categories.\nDhiraj Bommadevara had previously secured the men's individual quota during the Asian qualifying leg, and Bhajan Kaur has now secured the women's individual quota at the final world qualifying tournament.\nBHAJAN KAUR WON GOLD MEDAL AND ALSO SECURED WOMEN'S INDIVIDUAL QUOTABhajan Kaur defeated Mobina ð\u009f\u0087®ð\u009f\u0087· 6-2 in the final to clinch the gold medal.\nKaur's success in securing the quota also ensures India's representation in the mixed team event at the Paris Olympics, alongside Bommadevara, who had already secured a men's individual recurve quota.",
      "url": "https://www.indiatoday.in/sports/other-sports/story/bhajan-kaur-bags-olympic-quota-with-gold-at-paris-final-2553984-2024-06-16",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/bhajan-kaur-162447894-16x9_0.jpeg?VersionId=EiQXL9nqWiokYbSlFtPonyJ9OXgg045N"
    },
    {
      "news_number": 21,
      "title": "Saurabh Netravalkar: CSK, RCB, MI; IPL Franchises That Could Bid For India-Born USA Pacer at Mega Auction",
      "summary": "HomeSportsSaurabh Netravalkar: CSK, RCB, MI; IPL Franchises That Could Bid For India-Born USA Pacer at Mega AuctionSaurabh Netravalkar: CSK, RCB, MI; IPL Franchises That Could Bid For India-Born USA Pacer at Mega AuctionSaurabh Netravalkar in IPL 2025 Mega Auction: In Chepauk, the pitches are a little slow and that is where Netravalkar could come in handy.\nIMAGE CREDIT (Saurabh Netravalkar X PAGE)New York: Dreams do come true, and fantasies could become real – and all it needs is hardwork, belief and perseverance.\nSaurabh Netravalkar, the India-born USA pacer, has been living a dream.\nWith the IPL 2025 mega-auction coming up, franchises are bound to have their eyes on this left-arm pacer.\nCSK: In Chepauk, the pitches are a little slow and that is where Netravalkar could come in handy.",
      "url": "https://www.india.com/sports/saurabh-netravalkar-csk-rcb-mi-ipl-franchises-that-could-bid-for-india-born-usa-pacer-at-mega-auction-7019821/",
      "imgURL": "https://static.india.com/wp-content/uploads/2024/06/Saurabh-Netravalkar-3.jpg"
    },
    {
      "news_number": 22,
      "title": "Hardik Pandya, Rishabh Pant Biggest Takeaways For India In T20 World Cup 2024 Group Stage: Harbhajan Singh",
      "summary": "HomeSportsHardik Pandya, Rishabh Pant Biggest Takeaways For India In T20 World Cup 2024 Group Stage: Harbhajan SinghHardik Pandya, Rishabh Pant Biggest Takeaways For India In T20 World Cup 2024 Group Stage: Harbhajan SinghRishabh Pant made his India comeback in T20 World Cup 2024 after 14 months of injury layoff while Hardik Pandya had a horror IPL 2024 with Mumbai Indians.\nRishabh Pant and Hardik Pandya have been brilliant for India in the T20 World Cup 2024.\nIn the group stage, India won against Ireland, Pakistan and USA while their match against Canada was washed out.\nComing into the T20 World Cup, Pandya wasn’t in a great state of mind after constant booing from Mumbai Indians fans in the Indian Premier League.\nLeft-Right combination is formed when Rishabh Pant plays at number three,” Harbhajan said on Pant’s promotion up the order.",
      "url": "https://www.india.com/sports/hardik-pandya-rishabh-pant-biggest-takeaways-for-india-in-t20-world-cup-2024-group-stage-harbhajan-singh-7021517/",
      "imgURL": "https://static.india.com/wp-content/uploads/2024/06/MixCollage-17-Jun-2024-08-08-PM-1389.jpg"
    },
    {
      "news_number": 23,
      "title": "India TV Sports Wrap on June 16: Today's top 10 trending news stories",
      "summary": "Australia defeated Scotland by five wickets to help England qualify for the Super Eight stage of the ongoing ICC Men's T20 World Cup.\nEngland beat Namibia in ICC Men's T20 World CupEngland beat Namibia by 41 runs (DLS) to win their last match of the group stage.\nEngland qualify for Super Eight of ICC Men's T20 World CupAustralia's win over Scotland helped England qualify for the Super Eight stage of the ICC Men's T20 World Cup.\nNikolaas Davin becomes first player in World Cup to retire outNamibia's Davin retired out against England in the 34th match of the T20 World Cup.\nPakistan to face Ireland in Group A's final fixturePakistan will play Ireland in the final match of Group A of the ongoing ICC Men's T20 World Cup 2024.",
      "url": "https://www.indiatvnews.com/sports/other/india-tv-sports-wrap-on-june-16-today-top-10-trending-news-stories-2024-06-16-937166",
      "imgURL": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/06/top-ten-eng-2-1-1718513095.jpg"
    },
    {
      "news_number": 24,
      "title": "Indian sports highlights, June 10: News, updates, scores, results, commentary",
      "summary": "June has plenty of sporting action taking place - which you can find listed out in ESPN India's sporting calendar.\nSukhjeet Singh is a bright spark and the evergreen PR Sreejesh impressed in the latest Pro League leg.\nHere's ESPN's Anish Anand reviewing India's FIH Pro League European leg.\nA quiet day is on the cards after an action-packed day yesterday, but you can never tell when it comes to the wide world of Indian sports.\nIn addition, we'll have analysis of India's performance in the FIH Pro League as well as their preparations for the Paris Olympics.",
      "url": "https://www.espn.in/espn/story/_/id/40313053/indian-sports-live-june-10-2024-news-updates-scores-results-commentary",
      "imgURL": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0605%2Fr1341956_1296x729_16%2D9.jpg"
    },
    {
      "news_number": 25,
      "title": "Indian Sports Wrap, June 16: Aditi Ashok tied 14th on LPGA in Michigan",
      "summary": "GOLFAditi Ashok tied 14th on LPGA in MichiganIndian golfer Aditi Ashok picked three birdies in the last five holes, but still dropped to tied 14th from overnight tied 10th at the end of the third round of the Meijer LPGA Classic.\nRandhawa had won his first three matches to reach the quarters while Jeev Milkha Singh had lost in the second round.\nHitaashee shot 1-under 71, her second under par round, and totalled 4-under 212 for 54 holes at Laguna National Golf Resort Club.\nAfter completing the second round this morning, the final round, played with a shotgun start to ensure 54 holes, ended in fading light.\n“The biggest challenge for me was the second day, when I played 28 holes despite frequent stoppages.",
      "url": "https://sportstar.thehindu.com/other-sports/india-sports-news-results-scores-june-16-schedule-latest-updates-highlights/article68296044.ece",
      "imgURL": "https://ss-i.thgim.com/public/incoming/nm9u49/article68296045.ece/alternates/LANDSCAPE_1200/2157743540.jpg"
    },
    {
      "news_number": 26,
      "title": "India TV Sports Wrap on June 15: Today's top 10 trending news stories",
      "summary": "Today's Top 10 Trending Sports News StoriesICC Men's T20 World Cup 2024: South Africa survive major scare to pip Nepal in nail-biting finishSouth Africa defeated Nepal by one run in the 31st match of the ICC Men's T20 World Cup 2024.\nNew Zealand register history against debilitated Uganda; claim first win of ICC Men's T20 World Cup 2024The Blackcaps defeated Uganda by nine wickets to win their first match of the ICC Men's T20 World Cup 2024.\nIndia to face Canada in T20 World CupIndia will take on Canada in their last group-stage fixture on Saturday in Florida.\nUSA qualify for ICC Men's T20 World Cup 2026The USA have secured a berth in the ICC Men's T20 World Cup 2026.\nMujeeb Ur Rahman ruled out for remainder of T20 World Cup; Afghanistan announce replacement",
      "url": "https://www.indiatvnews.com/sports/other/india-tv-sports-wrap-on-june-15-today-top-10-trending-news-stories-2024-06-15-937040",
      "imgURL": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/06/sports-stories-11-1718427718.jpg"
    },
    {
      "news_number": 27,
      "title": "India men, women to vie for fifth position in Asian Team squash",
      "summary": "Results:Men:Women:NEW DELHI: The Indian men's and women's squash teams are set to compete for fifth place in the Asian Team Squash Championships , which are currently underway in Dalian, China.The women's team will face off against Iran, while the men's team will challenge South Korea in their respective classification matches on Sunday, according to PTI.In the previous round on Saturday, the Indian women's team emerged victorious against Singapore.\nSunita Patel and Rathika Suthanthira Seelan win in five games each in dramatic fashion, securing the team's spot in the fifth-place playoff.Similarly, the men's team triumphed over Iran to progress in their classification round.\nOm Semwal and Velavan Senthilkumar also won in five games each, showcasing their determination and skill on the court.India beat Iran 2-0 (Om Semwal beat Seyed Mohammadreza Ziyaekashani 11-4, 9-11, 11-6, 9-11, 11-6; Velavan Senthilkumar beat Sepher Etemadpour 11-5, 9-11, 11-6, 8-11, 11-9).India beat Singapore 2-0 (Sunita Patel beat Vicky Yue Ying Lai 11-8, 5-11, 9-11, 11-9, 11-9; Rathika Seelan beat Au Yeong Wai Yhann 12-14, 11-7, 11-8, 8-11, 11-9).",
      "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/india-men-women-to-vie-for-fifth-position-in-asian-team-squash/articleshow/111025964.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111025985,width-1070,height-580,imgsize-33342,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 28,
      "title": "Indian Sports Wrap, June 14: Aditi’s makes solid start with 68 at Meijer LPGA Classic",
      "summary": "-PTIPukhraj leads after second round in Vietnam MastersIndian golfer Pukhraj Singh Gill held the lead after carding a three-under 69 in the second round of the Asian Development Tour’s Nam A Bank Vietnam Masters here.\nThe cut fell at one-under and 52 players made the grade for the final round.\nJeev will take on Keith Horne in the second round, while Randhawa will play Malcolm Mackenzie, who beat 2006 Ryder Cup captain Ian Woosnam in the first round.\n-Kamesh SrinivasanFaisal Qamar wins AITA men’s ranking tennis tournamentFaisal Qamar, the champion of the AITA men’s tennis tournament in Faridabad.\nThe results (final): Faisal Qamar bt Jagmeet Singh 6-4, 5-7, 6-4.",
      "url": "https://sportstar.thehindu.com/other-sports/india-sports-news-results-scores-june-14-schedule-latest-updates-highlights/article68288374.ece",
      "imgURL": "https://ss-i.thgim.com/public/incoming/4a7kug/article68288402.ece/alternates/LANDSCAPE_1200/LPGA_Tour_Golf_01651.jpg"
    },
    {
      "news_number": 29,
      "title": "India and Canada game washed out in Florida",
      "summary": "The T20 World Cup's Florida-based matches continued to be blighted by bad weather as India's game with Canada was abandoned without a ball being bowled.\nAll three matches scheduled for Lauderhill have now fallen to the elements, with the ground suffering the effects of heavy rainfall over the last week.\nThe abandonment has no effect on the outcome of Group A, with India already qualified for the Super 8s and eliminated Canada's tournament now at an end.\nIndia's next match will be in the second stage on Thursday against Afghanistan, while Lauderhill is due to stage its final match, Pakistan against Ireland, on Sunday.",
      "url": "https://www.bbc.co.uk/sport/cricket/articles/c800wrqknp8o",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_sport/e5ab/live/4fedda60-2b2f-11ef-b5f9-690193808f36.jpg"
    },
    {
      "news_number": 30,
      "title": "Jindal Sports Hostel Athletes in Barbil Strike Remarkable Success at the Khelo India Zonal Women’s Wushu League",
      "summary": "Spread the loveJoda : Wushu athletes from the Jindal Sports Hostel in Barbil, a predominantly tribal region of Odisha, have achieved remarkable success by winning four gold medals and one bronze medal at the prestigious Khelo India Zonal Women’s Wushu League in Bagolkot, Karnataka, held from June 10th to 13th, 2024.\nThe hostel has been established and is run by the JSP Foundation, the social arm of Jindal Steel & Power (JSP), under the direct guidance and supervision of its Hon’ble Chairperson, Smt.\nThe winners who brought glory to Joda-Barbil and the JSP Foundation include Ms. Suman Patra (39kg Sub-Jr) – Gold Medalist, Ms. Swetarani Mahanta (48kg Jr) – Gold Medalist, Ms. Sabita Munda (56kg Jr) – Gold Medalist, Ms. Manju Munda (45kg Sr) – Gold Medalist, and Ms. Laxmi Munda (45kg Jr) – Bronze Medalist.\nThese remarkable achievements underscore the unwavering commitment of the JSP Foundation towards nurturing and empowering talented youth from disadvantaged communities.\nShallu Jindal ji, the JSP Foundation supports both athletic excellence and the holistic development of underprivileged youth in this tribal predominant area.",
      "url": "https://odishabarta.com/jindal-sports-hostel-athletes-in-barbil-strike-remarkable-success-at-the-khelo-india-zonal-womens-wushu-league/",
      "imgURL": "http://odishabarta.com/wp-content/uploads/2024/06/Wushu4.jpeg?v=1718604751"
    },
    {
      "news_number": 31,
      "title": "Youth Affairs & Sports | Channelling youth power",
      "summary": "India has an estimated 254 million of its population aged 15-24 years, the highest globally.\nThe ministry of sports and youth affairs, thus, plays a crucial role in harnessing this demographic’s potential for nation-building and economic growth through various schemes, events and organisations.\nThese include the National Service Scheme and the Mera Yuva Bharat (MY Bharat) programme, which aim to train youth in leadership skills and the spirit of volunteering.\nIt is crucial to take a holistic approach and involve all stakeholders to create a thriving sports ecosystem before India can aspire to host the Olympics.\nPublished By: Shyam Balasubramanian Published On: Jun 17, 2024Tune InMust Watch",
      "url": "https://www.indiatoday.in/magazine/cover-story/agenda-2024/story/20240624-youth-affairs-sports-channelling-youth-power-2553491-2024-06-17",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/youth-affairs--sports-160055440-16x9_0.jpg?VersionId=KDDGPOfEW40Ir4nTXGWmU02Kc7FKygqf"
    },
    {
      "news_number": 32,
      "title": "Indian Sports LIVE, June 16: News, updates, scores and results",
      "summary": "Open Extended ReactionsWelcome to ESPN India's daily blog, where we aim to bring you all the news from the dynamic world of Indian sports: from the wide variety of Olympic sports to franchise leagues.\nJune has plenty of sporting action taking place - which you can find listed out in ESPN India's sporting calendar.",
      "url": "https://www.espn.in/espn/story/_/id/40357092/indian-sports-live-june-16-2024-news-updates-scores-results-commentary",
      "imgURL": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0411%2Fr1317374_1296x729_16%2D9.jpg"
    },
    {
      "news_number": 33,
      "title": "SVG India Summit Draws 120 Industry Professionals To Star Sports in Mumbai",
      "summary": "SVG India Summit Draws 120 Industry Professionals To Star Sports in MumbaiStory HighlightsThe inaugural SVG India Summit was held on April 30 at the Star Sports headquarters in Mumbai, bringing together more than 120 sports-production professionals from across India for a day of panel discussions and networking focused on one of the world’s growing sports marketplaces.\n“And the entire Star Sports staff deserves a big thanks for making the event run super smoothly.”The event was sponsored by Tata Communications, Vizrt, Devlin Design Group, and Signiant.\n“Our world is changing, and nowhere is this pace of change more rapid or more visible than in India,” he said.\nSports in India is on the move, propelled by socio-economic, societal, lifestyle, and institutional forces.\nThis will correspond with increased discretionary spending, meaning higher spending on avenues of recreation and entertainment, which include sport.",
      "url": "https://www.sportsvideo.org/2024/04/30/svg-india-summit-draws-120-industry-professionals-to-star-sports-in-mumbai/",
      "imgURL": "https://www.sportsvideo.org/wp-content/uploads/2024/04/20240430_111257-929x535.jpg"
    },
    {
      "news_number": 34,
      "title": "India TV Sports Wrap on June 14: Today's top 10 trending news stories",
      "summary": "Follow us on Image Source : GETTY IMAGES AND AP India TV Sports Wrap.\nEngland have kept their hopes alive of qualifying for the Super Eight stage of the ongoing ICC Men's T20 World Cup after their convincing eight-wicket win over Oman.\nNew Zealand's T20 World Cup campaign comes to unfortunate endThe Blackcaps have been eliminated from the group stage after Afghanistan's win over Papua New Guinea.\nUSA to meet Ireland with Super Eight berth on the lineThe United States of America will take on Ireland in the 30th match of T20 World Cup.\nEngland register biggest win in Men's T20 World Cup historyEngland registered the biggest win in the Men's T20 World Cup history in terms of balls to spare when they defeated Oman in the 28th match.",
      "url": "https://www.indiatvnews.com/sports/other/india-tv-sports-wrap-on-june-14-today-top-10-trending-news-stories-2024-06-14-936866",
      "imgURL": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/06/sports-stories-10-1718341531.jpg"
    },
    {
      "news_number": 35,
      "title": "Indian sports, June 9: Puja Tomar makes UFC history, Nagal almost into Paris Olympics",
      "summary": "Hockey: India Women's FIH Pro League campaign ends with another lossThe Indian women's hockey team slumped to an eighth straight loss in the FIH Pro League, going down to Great Britain 2-3 after leading for most of the match.\nPuja Tomar becomes first Indian to win in UFCPuja Tomar scripted history as she became the first mixed martial arts fighter from India to win a bout at the Ultimate Fighting Championship (UFC.)\nI only thought I have to win and show the world that Indian fighters are not losers,\" Tomar told Sony Sport Network after her win.\nHockey: India vs Great BritainYou can follow the FIH Pro League match live right here, we will have all the updates rolling through the blog.\nHockey: Indian men and women's team lose to Germany in FIH Pro League.",
      "url": "https://www.espn.in/espn/story/_/id/40306012/indian-sports-live-june-9-2024-news-updates-scores-results-commentary",
      "imgURL": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F0411%2Fr1317374_1296x729_16%2D9.jpg"
    },
    {
      "news_number": 36,
      "title": "'We made mistakes in batting against India, USA', admits Babar Azam",
      "summary": "T20 World Cup 2024:|NEW DELHI: Pakistan captain Babar Azam expressed his regret over the errors committed by his team in their previous Group A encounters against India and the United States.\nDespite securing a consolatory three-wicket victory over Ireland in Lauderhill, the former champions were eliminated from the T20 World Cup .Babar himself played a crucial role in Pakistan's successful chase of 107 runs against Ireland, remaining unbeaten on 32.\nHowever, the pursuit was far from smooth, with Pakistan nearly squandering the opportunity to secure the win.\nBut in batting we made few mistakes in the matches against the USA and India.\nWhen you lose wickets, the pressure is on you,\" said Babar, as quoted by PTI, in the post-match presentation ceremony.",
      "url": "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/we-made-mistakes-in-batting-against-india-usa-admits-babar-azam/articleshow/111043124.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111043128,width-1070,height-580,imgsize-36594,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 37,
      "title": "Veteran sports journalist Harpal Singh Bedi passes away at age of 72",
      "summary": "Harpal Singh Bedi, the legend of our times, passed away this morning.\nA particularly sad day for first generation JNUites.Harpal Singh Bedi, the legend of our times, passed away this morning.My condolences to his family.\nI once wrote a piece about how he was mistaken for Bishan Singh Bedi and was interviewed by a TV channel.\nThe press box will not be the same without him,\" said Vijay Lokapally, the former senior editor of 'The Hindu'.\n\"Harpal Singh Bedi ji, the most cheerful among sports journalists, is no longer among us.",
      "url": "https://www.business-standard.com/sports/other-sports-news/veteran-sports-journalist-harpal-singh-bedi-passes-away-at-age-of-72-124061500195_1.html",
      "imgURL": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-06/15/thumb/fitandfill/400X400/1718452926-5759.jpg"
    },
    {
      "news_number": 38,
      "title": "USA vs India live score over Match 25 T20 16 20 updates",
      "summary": "On Anushka Sharma's \"We Love You\" Post On Father's Day, Virat Kohli Does This",
      "url": "https://sports.ndtv.com/t20-world-cup-2024/usa-vs-india-live-score-over-match-25-t20-16-20-updates-5876402",
      "imgURL": "https://edata.ndtv.com/twittergft/sport_automated_story/big_638538259891956953.png"
    },
    {
      "news_number": 39,
      "title": "Watch: When the DJ got Sunil Gavaskar and Wasim Akram grooving at T20 World Cup",
      "summary": "T20 WORLD CUP:|Watch VideoThe behind-the-scenes stories of any event often grab eyeballs and attention of those following it closely, and the global sporting events like the ongoing T20 World Cup in the US and the Caribbean islands are no different.In one such video shot by a fan from the stands at a stadium in the US -- possibly the Nassau County International Cricket Stadium in New York , legends Sunil Gavaskar and Wasim Akram could be seen grooving to the music played by the DJ at the venue.Former Pakistan captain Akram was doing a show for the tournament's host broadcasters, Star Sports, along with India's batting legend and ex-skipper Gavaskar close to the boundary ropes when the duo suddenly took a break and started dancing to the tunes of the DJ.The anchor of the show could be seen capturing the moment in a selfie, while the two legends continued to enjoy their moves.The ninth edition of the ICC Men's T20 World Cup began on June 2 and will concluded with the final on June 29 in Barbados.",
      "url": "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/watch-when-the-dj-got-sunil-gavaskar-and-wasim-akram-grooving-at-t20-world-cup/articleshow/111014016.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111014135,width-1070,height-580,imgsize-22128,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 40,
      "title": "Indian Sports Wrap, June 13: India’s Pukhraj Singh Gills leads after first round in Vietnam",
      "summary": "$25,000 ITF men, Wichita, USA Singles (first round): Quinn Vandecasteele (uSA) bt Ramkumar Ramanathan 7-5, 6-1.\n$15,000 ITF men, Koszalin, Poland Singles (pre-quarterfinals): Pawel Juszczak (Pol) bt Manas Dhamne 7-6(5), 3-6, 6-4.\n$15,000 ITF men, Hong Kong Singles (pre-quarterfinals): SD Prajwal Dev bt Daisuke Sumizawa (Jpn) 6-3, 6-4.\nDoubles (quarterfinals): SD Prajwal Dev & Adil Kalyanpur bt Daniil Golubev & Evgenii Tiurnev 6-1, 6-4; Ajeet Rai (Nzl) & Rishi Reddy bt Ryotaro Taguchi & Ryoto Tanuma 6-1, 6-7(6), [11-9].\n$15,000 ITF women, Santo Domingo, Dominican Republic Singles (first round): Christasha McNeil bt Saumya Vig 6-1, 6-1.",
      "url": "https://sportstar.thehindu.com/other-sports/india-sports-news-results-scores-june-13-schedule-latest-updates-highlights/article68284166.ece",
      "imgURL": "https://ss-i.thgim.com/public/incoming/wq1fmj/article68284172.ece/alternates/LANDSCAPE_1200/golf%20representative.jpg"
    },
    {
      "news_number": 41,
      "title": "Copa America 2024 Live Streaming: Teams, Schedule, Fixtures, How To Watch Lionel Messi, Vinicius Junior Live In India",
      "summary": "The top two sides from each group will progress to the quarter-final stage.\nThe knockouts also sees semis and the final.\nThe final will be played on July 14 (July 13 as per local time and date)",
      "url": "https://www.outlookindia.com/sports/football/copa-america-2024-live-streaming-teams-schedule-fixtures-how-to-watch-lionel-messi-vinicius-junior-live-in-india",
      "imgURL": "https://media.assettype.com/outlookindia/2024-06/2bf105a1-17a7-424f-a732-b60bc32ede37/Lionel_Messi_Argentina_National_Football_Team_AP_Photo_.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100"
    },
    {
      "news_number": 42,
      "title": "'The most complete fast bowler right now': Former India pacer compares Jasprit Bumrah to Wasim Akram",
      "summary": "NEW DELHI: Former cricketer Laxmipathy Balaji has compared current Indian fast bowler Jasprit Bumrah to the legendary Wasim Akram .\nBalaji believes Bumrah is Asia's next best pacer, second only to Akram.Balaji pointed out the similarities between Akram and Bumrah.\n\"Wasim bhai, the ultimate.They both have identical traits, they have changed the dynamics of fast bowling,\" Balaji said in an interview with Hindustan Times.\n\"In Balaji's eyes, Bumrah is presently the most complete fast bowler in the game.\n\"He is just the most complete fast bowler right now.",
      "url": "https://timesofindia.indiatimes.com/sports/cricket/icc-mens-t20-world-cup/the-most-complete-fast-bowler-right-now-former-india-pacer-compares-jasprit-bumrah-to-wasim-akram/articleshow/111013924.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111014198,width-1070,height-580,imgsize-41304,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 43,
      "title": "Watch: USA’s Saurabh Nethravalkar flaunts yoga skill, wins India hearts again",
      "summary": "In the video, the 32-year-old fast-bowler can be seen flexing his yoga skills in preparation for USA's 2024 T20 World Cup Super 8 fixture against South Africa.\nNetravalkar showed an equally brilliant performance in his yet another 2/18 spell against India, but that was just not enough for a USA win.\nT20 World Cup Coverage | Points Table | T20 World Cup 2024 Schedule | Player Stats\"Journey to Yoga continues.\n@satvic.yoga thank you for initiating me into the beautiful journey of yoga and the transformative book “Light On Yoga” by BKS Iyengar!\nð\u009f\u0099\u008câ\u009däï¸\u008f pic.twitter.com/tkquQhAVap — USA Cricket (@usacricket) June 14, 2024Thank you, @ESPNcricinfo for this piece!",
      "url": "https://www.indiatoday.in/sports/t20-world-cup-2024/story/saurabh-netravalkar-usa-yoga-skill-viral-video-2553938-2024-06-16",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202406/saurabh-netravalkar-161131192-16x9_0.png?VersionId=icfRFxauZhH1tVoKU2z0RBiI3CW7ZLW9"
    },
    {
      "news_number": 44,
      "title": "Canada cricketers miss out on marquee matchup with India due to wet ground conditions",
      "summary": "ET, was delayed due to wet ground conditions at Central Broward Park & Broward County Stadium in Lauderhill, Fla.\nIndia beat Canada by 128 runs when they met in one-day play at the 1998 Commonwealth Games in Kuala Lumpur.\nIndia won the T20 tournament in 2007, was runner-up in 2014 and made the semifinals in 2016 and 2022.\nIndia defeated Ireland by eight wickets, Pakistan by six runs and the U.S. by seven wickets.\nCanada T20 World Cup rosterSaad Bin Zafar (capt.)",
      "url": "https://www.cbc.ca/sports/cricket/canadian-cricket-icc-world-cup-june-15-india-1.7236308",
      "imgURL": "https://i.cbc.ca/1.7231639.1718131668!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/t20-cricket-wcup-pakistan-canada.jpg"
    },
    {
      "news_number": 45,
      "title": "India TV Sports Wrap on June 12: Today's top 10 trending news stories",
      "summary": "Australia have stormed into Super Eight stage of the ongoing ICC Men's T20 World Cup after hammering Namibia by nine wickets.\nMohammad Rizwan scores slowest half-century in Men's T20 World Cup historyRizwan consumed 52 balls to score his half-century against Canada - the slowest in T20 World Cups.\nIndia to face USA in T20 World CupIndia will lock horns with the USA in the 25th match of the ICC Men's T20 World Cup in New York.\nIndia get knocked out of FIFA World Cup QualifiersIndia suffered a 2-1 defeat at the hands of Qatar to get knocked out of the ongoing FIFA World Cup Qualifiers.\nSri Lanka vs Nepal T20 World Cup clash gets washed out",
      "url": "https://www.indiatvnews.com/sports/other/india-tv-sports-wrap-on-june-12-today-top-10-trending-news-stories-2024-06-12-936474",
      "imgURL": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/06/sports-stories-8-1718166942.jpg"
    }
  ],
  "finance": [
    {
      "news_number": 0,
      "title": "India’s Paras Healthcare set for IPO filing",
      "summary": "Paras Healthcare, a hospital chain headquartered in Gurugram, India, is expected to file draft papers for an initial public offering (IPO) by the end of this month, as per The Economic Times.\nWhen approached for a comment, Paras Healthcare declined to respond, reported the publication.\nThese shares were converted into equity in September 2018, resulting in a 24.68% stake for Creador in Paras Healthcare.\nFounded in 2006 by Dr Dharminder Nagar, Paras Healthcare operates eight multi-specialty hospitals with a total capacity of 2,100 beds across North and East India.\n\"India’s Paras Healthcare set for IPO filing\" was originally created and published by Hospital Management, a GlobalData owned brand.",
      "url": "https://finance.yahoo.com/news/india-paras-healthcare-set-ipo-143632190.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/IojJ320j5D_RR8T1LDX7jQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02ODM-/https://media.zenfs.com/en/hospital_management_177/d77e31dc777d4cac4f5375d2efc27a02"
    },
    {
      "news_number": 1,
      "title": "India pulls in tech giants for its AI ambitions",
      "summary": "Try unlimited accessOnly ₹100 for 4 weeksThen ₹4,335 per month.\nComplete digital access to quality FT journalism on any device.\nCancel anytime during your trial.",
      "url": "https://www.ft.com/content/414e912f-c50c-4bc8-b3a2-b9ac36c34ebb",
      "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/ftlogo-v1%3Abrand-ft-logo-square-coloured?source=update-logos&format=svg"
    },
    {
      "news_number": 2,
      "title": "Modi Opts for Policy Stability With Familiar Faces in Cabinet",
      "summary": "India’s Prime Minister Narendra Modi retained several cabinet ministers in key portfolios, including finance, signaling policy continuity in a new coalition government in charge of the world’s fastest-growing major economy.\nNirmala Sitharaman was reappointed India’s finance minister, a position she’s held since 2019, the government said Monday.\nHome Affairs Minister Amit Shah , External Affairs Minister Subrahmanyam Jaishankar , Commerce Minister Piyush Goyal and Transport Minister Nitin Gadkari all kept their posts.",
      "url": "https://www.bloomberg.com/news/articles/2024-06-10/india-reappoints-nirmala-sitharaman-as-finance-minister",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ijYQorEwjkzY/v0/1200x800.jpg"
    },
    {
      "news_number": 3,
      "title": "Blockbuster India IPO Plan Drives Hyundai Shares to Record High",
      "summary": "(Bloomberg) -- Plans for what may be one of India’s largest-ever initial public offerings boosted Hyundai Motor Co.’s stock to a record high.\nMost Read from BloombergThe Korean automaker is selling a 17.5% stake in Hyundai Motor India Ltd., according to its draft red herring prospectus.\nShares of Hyundai — which will collect all of the proceeds from the IPO of its local unit — rose 3.9% Monday in Seoul.\nShares of Maruti’s parent Suzuki Motor Corp. fell 3.6% in Tokyo, while Indian markets were closed for a holiday.\nSL Corp. jumped 5.5% while HL Mando Co. gained 5.3% and Kia Corp. rose 5.2%.",
      "url": "https://finance.yahoo.com/news/hyundai-motor-suppliers-shares-rise-021447311.html",
      "imgURL": "https://media.zenfs.com/en/bloomberg_markets_842/12b3d92635da4e725d7fb6096bb45c0a"
    },
    {
      "news_number": 4,
      "title": "Modi Control of New Cabinet Suggests He Can ‘Manage His Allies’",
      "summary": "Indian Prime Minister Narendra Modi is keeping some of his closest advisers in place across key government leadership posts, an indication that his party remains firmly in control of the new coalition government despite suffering a setback at the polls.\nThe continuity atop ministries such as finance, home and external affairs put to rest speculation that the recent electoral disappointment suffered by the ruling Bharatiya Janata Party — it failed to win an outright majority for the first time since 2014 — would force Modi to cede control of New Delhi’s top portfolios.\nOut of the 30 cabinet positions, 25 posts stayed with the BJP, while the rest went to allies.",
      "url": "https://www.bloomberg.com/news/articles/2024-06-11/nirmala-sitharaman-returns-as-india-s-finance-minister",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i56xqBT0X6kc/v0/1200x800.jpg"
    },
    {
      "news_number": 5,
      "title": "Hyundai plans to list India business unit in one of country’s biggest IPOs",
      "summary": "Try unlimited accessOnly ₹100 for 4 weeksThen ₹4,335 per month.\nComplete digital access to quality FT journalism on any device.\nCancel anytime during your trial.",
      "url": "https://www.ft.com/content/ee29c0c1-60ab-479f-b55c-67c6162263a2",
      "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/ftlogo-v1%3Abrand-ft-logo-square-coloured?source=update-logos&format=svg"
    },
    {
      "news_number": 6,
      "title": "Is WisdomTree India Earnings ETF (EPI) a Strong ETF Right Now?",
      "summary": "Before fees and expenses, this particular fund seeks to match the performance of the WisdomTree India Earnings Index.\nPerformance and RiskYear-to-date, the WisdomTree India Earnings ETF has added about 16.61% so far, and is up about 39.16% over the last 12 months (as of 06/17/2024).\nFranklin FTSE India ETF (FLIN) tracks FTSE INDIA CAPPED INDEX and the iShares MSCI India ETF (INDA) tracks MSCI India Total Return Index.\nFranklin FTSE India ETF has $1.29 billion in assets, iShares MSCI India ETF has $11.11 billion.\nClick to get this free reportWisdomTree India Earnings ETF (EPI): ETF Research ReportsiShares MSCI India ETF (INDA): ETF Research ReportsFranklin FTSE India ETF (FLIN): ETF Research ReportsTo read this article on Zacks.com click here.",
      "url": "https://finance.yahoo.com/news/wisdomtree-india-earnings-etf-epi-102006661.html",
      "imgURL": "https://media.zenfs.com/en/zacks.com/17a4db66bb13bdabcbf848550a6ea15a"
    },
    {
      "news_number": 7,
      "title": "Sitharaman Reappointed as India’s Finance Minister",
      "summary": "00:00I ruchi some continuity here and Amala back in the job as finance minister.\nThe market's concerns also whether how the new person will come in and, you know, handle the job going forward.\nIt also means that the the focus now for Finance Minister Nirmala Sitharaman actually going forward will be on the upcoming budget to where she will have to balance growth and also look at trimming the fiscal deficit.\nShe's the Minister of Corporate Affairs.\nSo the kind of changes that will be brought in, in her role as the corporate affairs minister is also something to be washed off for.",
      "url": "https://www.bloomberg.com/news/videos/2024-06-11/sitharaman-returns-as-india-s-finance-minister-video",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iNfef9Jqtwvw/v3/-1x-1.jpg"
    },
    {
      "news_number": 8,
      "title": "Hyundai files for Indian IPO",
      "summary": "Hyundai Motor Company said its Indian subsidiary had filed documents for an initial public offering (IPO) and to list its shares on the main stock exchange to expand its operations in the world’s third largest vehicle market.\nThe share price in Seoul jumped 5% on Monday on the news, before giving up some of the gains later in the day.\nHyundai Motor Group chairman and CEO Chung Euisun visited the company’s Indian operations in April where he outlined the medium and long term strategy which also included strengthening India’s role as a global production hub.\n\"Hyundai files for Indian IPO\" was originally created and published by Just Auto, a GlobalData owned brand.\nYou must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our site.",
      "url": "https://finance.yahoo.com/news/hyundai-files-indian-ipo-101314492.html",
      "imgURL": "https://media.zenfs.com/en/just_auto_187/e020f6fa8814ed98619fcde9953d9611"
    },
    {
      "news_number": 9,
      "title": "India’s BHEL secures two orders from Adani Power worth $837m",
      "summary": "Bharat Heavy Electricals Limited (BHEL) has received orders worth Rs70bn ($837m) from Adani Power for the construction of two thermal power plants in India.\nThe first of the two orders is for the 2x800MW Raipur supercritical thermal power plant in Chhattisgarh, awarded by Adani Power Limited.\nThe second order, from MTEUPPL, a subsidiary of Adani Power, is for the 2x800 MW Mirzapur supercritical thermal power plant in the state of Uttar Pradesh.\nBHEL's role extends to the manufacture and supply of key equipment, including steam generators, steam turbines and generators, which will be produced at the company's facilities in Trichy and Haridwar.\n\"India’s BHEL secures two orders from Adani Power worth $837m\" was originally created and published by Power Technology, a GlobalData owned brand.",
      "url": "https://finance.yahoo.com/news/india-bhel-secures-two-orders-083225747.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/XP.QhuTvPG7GjpH63qHGkg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/power_technology_866/89ee5aca0779726f2ca73510e969172a"
    },
    {
      "news_number": 10,
      "title": "Hyundai Motor shares hit record high as investors bet on India IPO",
      "summary": "2022 World Car Awards at the New York International Auto Show, in New York CityBy Heekyong YangSEOUL (Reuters) - Hyundai Motor Co's shares hit a record high as investors bet on the South Korean automaker's plan to list its India unit in Mumbai, which would help Hyundai Motor boost its presence in the world's third biggest auto market.\nShares of Hyundai Motor rose as much as 6.3% on Monday to 285,000 won ($206.47), and closed up 3.9%, a record high close which lifted its market capitalization to 58.3 trillion won.\nHyundai Motor's India unit last week sought regulatory approval for a listing in Mumbai, which could be the nation's biggest and will see the South Korean parent sell a stake of up to 17.5% in the company.\n\"With the India IPO, Hyundai Motor could better accelerate its plans for the India market, such as getting dibs on the electric vehicle (EV) market there ahead of their competitors by producing EVs in the country by adjusting its existing production site,\" Song added.\nThe South Korean parent will sell up to 142 million of the total 812 million shares, or 17.5%, in the IPO.",
      "url": "https://sg.finance.yahoo.com/news/hyundai-motor-shares-hit-record-082552250.html",
      "imgURL": "https://media.zenfs.com/en/reuters.com/a8768874b2e3079bc09aed6987012737"
    },
    {
      "news_number": 11,
      "title": "Hyundai Motor’s India Unit Plans IPO That Would Rival Record",
      "summary": "(Bloomberg) -- Hyundai Motor Co.’s Indian unit filed for an initial public offering that is expected to be one of the nation’s largest.\nMost Read from BloombergThe carmaker will offer 17.5%, or 142.2 million shares, of Hyundai Motor India Ltd., according to a draft red herring prospectus.\nThat would make it one of the biggest on record in India, rivaling Life Insurance Corp. of India’s 206 billion rupee ($2.5 billion) offering in 2022.\nHyundai Motor India is the country’s second-biggest automaker by sales, and almost 80% of its revenue from car sales is domestic, the draft prospectus said.\nHyundai Motor India reported revenue of 521.58 billion rupees in the nine months ended December, according to the filing.",
      "url": "https://finance.yahoo.com/news/hyundai-motor-sell-142-2-021013382.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/WhmeQ3_0r2rpznz.ma3Ymg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/af832fa0c40e5b6d882c7176a989b88f"
    },
    {
      "news_number": 12,
      "title": "Foreign banks bought nearly $1 billion of India bonds on Thursday, data shows",
      "summary": "By Dharamraj DhutiaMUMBAI (Reuters) - Foreign banks bought Indian government bonds worth 80.38 billion rupees ($962.2 million) on Thursday, the biggest single-session purchase since Feb. 1, data from Clearing Corp of India showed.\nOther recent economic data has also pointed to cooling inflation in the U.S., bolstering rate cut expectations \"that have driven the top four or five large foreign banks to add bonds,\" a trader with a foreign bank said.\nReuters could not ascertain which banks had bought bonds on Thursday.\nBrokerage DBS maintains its view that the Federal Reserve will cut rates by 50 basis points in 2024, with the futures markets also pricing in 50 bps of reductions before December-end.\nLocally, underlying sentiment continues to remain bullish as India is just weeks away index inclusion, starting June 28.",
      "url": "https://finance.yahoo.com/news/foreign-banks-bought-nearly-1-100901996.html",
      "imgURL": "https://media.zenfs.com/en/reuters.com/d0fd3d4732dfdbf4d98c88b530c7649c"
    },
    {
      "news_number": 13,
      "title": "Vodafone Offloads India's Indus Towers Stake To Trim $2.3B Debt",
      "summary": "Vodafone Offloads India's Indus Towers Stake To Trim $2.3B DebtVodafone Group Public Limited Company (NASDAQ:VOD) reportedly plans to sell its entire $2.3 billion stake in India’s Indus Towers through stock market block deals next week.\nVodafone currently owns 21.5% of mobile tower operator Indus Towers through various group entities.\nVodafone U.K., a subsidiary of Vodafone, and Three U.K., owned by CK Hutchison Holdings Limited, disclosed a joint venture to consolidate their 27 million customers under one network provider.\nInvestors can gain exposure to the VOD stock via First Trust NASDAQ Technology Dividend Index Fund (NASDAQ:TDIV) and Pacer Global Cash Cows Dividend ETF (NYSE:VWI).\nThis article Vodafone Offloads India's Indus Towers Stake To Trim $2.3B Debt originally appeared on Benzinga.com© 2024 Benzinga.com.",
      "url": "https://finance.yahoo.com/news/vodafone-offloads-indias-indus-towers-133905302.html",
      "imgURL": "https://media.zenfs.com/en/Benzinga/33e82787442e66a403f1479904fde55b"
    },
    {
      "news_number": 14,
      "title": "Factbox-IPO-bound Hyundai India and its rivals in the world's third-biggest car market",
      "summary": "India is the world's third-largest car market after China and the United States, and one where Hyundai fiercely competes with the likes of Maruti Suzuki and Tata Motors.\nMARUTI SUZUKIWith a market share of 42%, Maruti Suzuki is Hyundai's biggest rival in India and went public in 2003.\nTATA MOTORSTata Motors is India's third-biggest car maker by sales and made its market debut in 1955.\nTata's Nexon and Punch models are the country's most-sold SUVs and have contributed to its overall market share rising to 14%, just behind Hyundai.\nMAHINDRA & MAHINDRAMahindra & Mahindra is India's fourth-biggest car maker by sales and is part of Indian tech-to-tractors conglomerate Mahindra Group.",
      "url": "https://finance.yahoo.com/news/factbox-ipo-bound-hyundai-india-052235131.html",
      "imgURL": "https://media.zenfs.com/en/reuters.com/b596477f5f866535626913d4846551ce"
    },
    {
      "news_number": 15,
      "title": "Reliance's Jio Platforms clears hurdle in bid to launch satellite internet in India",
      "summary": "These allow Orbit Connect to operate satellites above India, but further approvals are needed by the country's department of telecoms to begin operations.\nInmarsat, another company hoping to provide high-speed satellite-based internet, has also gotten approval to operate satellites over India, IN-SPACe chairman Pawan Goenka told Reuters.\nAmazon plans to invest $10 billion in Kuiper, which was announced in 2019, the year SpaceX began deploying its first operational Starlink satellites.\nLast week, Sri Lanka gave Starlink preliminary approval to provide internet services there.\nIN-SPACe will also soon authorise private companies to operate ground stations, he said, which would enable satellite operators to download data as they pass over India.",
      "url": "https://finance.yahoo.com/news/reliances-jio-platforms-clears-hurdle-074604844.html",
      "imgURL": "https://media.zenfs.com/en/reuters-finance.com/ebb3dbdda98bb390c2ca4a10e0f26392"
    },
    {
      "news_number": 16,
      "title": "Hyundai deepens India bet, files for IPO that could be country's biggest",
      "summary": "The world's biggest car market after China and the U.S. is the company's third-biggest revenue generator globally.\nHyundai India also said it wants to ship more cars, \"strengthening\" its position as an export hub.\nHyundai, entered India 28 years ago, and has won over buyers with its affordable cars such as Santro and sports-utility vehicle Creta.\nWith the IPO, Hyundai aims to unlock value for the Indian business and also help the Korean automaker shed its valuation discount compared to global and Asian peers.\nIndia's burgeoning stock market overtook Hong Kong's earlier this year to become the world's fourth-largest, and is seeing soaring interest in large IPOs.",
      "url": "https://sg.finance.yahoo.com/news/hyundai-unit-files-ipo-india-025353694.html",
      "imgURL": "https://media.zenfs.com/en/reuters.com/88d24efe149c7068eb066dd3c69d0ff5"
    },
    {
      "news_number": 17,
      "title": "Modi 3.0 Budget 2024 Expectations: What are Finance Minister Nirmala Sitharaman's plans for taxpayers?",
      "summary": "In the Union Budget 2020, the Modi government introduced a new tax regime with lower slabs but without traditional deductions.\nChanges expected under the new tax regimeDespite offering lower tax rates, the new tax regime has not gained significant traction among taxpayers.\nCurrently, section 80C benefits are not available under the default (new) tax regime.\nBudget 2024 is anticipated to introduce reforms to the income tax structure in India, focusing on reducing taxes for lower income brackets to stimulate consumption.\nThe upcoming budget under Modi 3.0 aims to balance growth acceleration and inflation control while funding coalition commitments.",
      "url": "https://www.livemint.com/money/personal-finance/union-budget-2024-expectations-finance-minister-nirmala-sitharamans-plans-for-taxpayers-modi-3-0-income-tax-11718620077654.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2024/06/17/1600x900/ANI-20240517018-0_1715942241989_1718620247128.jpg"
    },
    {
      "news_number": 18,
      "title": "Finance minister to meet economists, farm bodies for pre-Budget talk",
      "summary": "NEW DELHI: As part of her pre-budget consultations with stakeholders, finance minister Nirmala Sitharaman will meet farmers' associations and agriculture economists on Friday and seek their suggestions on the policy landscape for the politically and economically crucial sector.\n\"Ideas and suggestions of stakeholders are thoroughly discussed before budget preparation.\nIt's a standard procedure and is followed for finalising the budget for all ministries/sectors,\" said an official.\nThis time, however, given complaints of farm and rural distress, the agriculture sector will be a crucial component of the budget and will also outline the Modi govt's strategy for the coming five years.Promises made in the interim budget may get a concrete shape with more specific allocation, sources said.Sitharaman had in her interim budget announced that the government will formulate a strategy to make the country self-reliant on edible oils by boosting domestic output of oilseeds, come out with a comprehensive programme to support dairy farmers, and set up five integrated aqua parks and launch new climate resilient scheme for blue economy 2.0 for fisheries development.“Making India self-reliant in oil seeds such as mustard, groundnut, sesame, soybean, and sunflower is expected to remain a focus area of the budget as India currently has to import a large quantity of edible oils to meet its domestic demand,\" said the source.\nDuring the 2022-23 marketing year (November-October), India imported nearly 165 lakh tonnes of cooking oils worth almost Rs 1.4 lakh crore.Multiple farmer welfare measures and promotion of private and public investment in “post-harvest activities” including aggregation, modern storage, efficient supply chains, processing, marketing and branding may also be other focus areas of the budget for the farm sector, said the sources.",
      "url": "https://timesofindia.indiatimes.com/india/finance-minister-to-meet-economists-farm-bodies-for-pre-budget-talk/articleshow/111045241.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111045362,width-1070,height-580,imgsize-1248958,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 19,
      "title": "India's non-banking financial sector grew by 10%; declined globally by 3 %",
      "summary": "« Back to recommendation storiesI don't want to see these stories becauseThey are not relevant to me They disrupt the reading flow Others",
      "url": "https://m.economictimes.com/industry/banking/finance/banking/indias-non-banking-financial-sector-grew-by-10-declined-globally-by-3-/articleshow/111055072.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-111055112,width-1200,height-630,imgsize-27102,overlay-economictimes/photo.jpg"
    },
    {
      "news_number": 20,
      "title": "‘Less BS, more jobs’: Indian billionaires face heat of new Modi era",
      "summary": "Try unlimited accessOnly ₹100 for 4 weeksThen ₹4,335 per month.\nComplete digital access to quality FT journalism on any device.\nCancel anytime during your trial.",
      "url": "https://www.ft.com/content/11355013-6a4a-4548-8a58-9339a3602a5e",
      "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/ftlogo-v1%3Abrand-ft-logo-square-coloured?source=update-logos&format=svg"
    },
    {
      "news_number": 21,
      "title": "India’s Top Traders Are Raking In Million-Dollar Salaries",
      "summary": "Ambitious Indian finance professionals have never had it so good.\nWhile their international compatriots are facing job cuts and curtailed bonuses, for them it’s boomtime.\nThe employment market is so strong that stories abound of ghosted employers, million-dollar trading jobs, and private bankers able to demand — and get — up to a 50% pay hike to move firms.",
      "url": "https://www.bloomberg.com/news/articles/2024-04-11/india-s-top-traders-are-raking-in-million-dollar-salaries-as-china-slows",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i5y3mphx7_Fs/v0/1200x700.jpg"
    },
    {
      "news_number": 22,
      "title": "US markets get an election preview from India and Mexico: Morning Brief",
      "summary": "Just south of the US border, Claudia Sheinbaum won a landslide election on Monday to become Mexico's first female president.\nMexican markets were roiled on concerns the ruling government would be able to push through constitutional amendments.\nHowever, as election results were tallied, the margin of victory narrowed, and Indian stocks plunged 7%, erasing $386 billion in market value.\nInvestors might be reminded of white-knuckling the 2016 election results in the US as news of Trump's win was digested.\nStory continuesFour years later, a soon-to-be President Biden won against Trump in the polls, and stocks surged over 10% that November.",
      "url": "https://finance.yahoo.com/news/us-markets-get-an-election-preview-from-india-and-mexico-morning-brief-100018165.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/tTOBCQtOtdanHuys7mIy1Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2024-06/c4759580-22b5-11ef-bbdd-3bad973befff"
    },
    {
      "news_number": 23,
      "title": "Can I take benefit of India-UAE DTAA?",
      "summary": "Two important changes that refer to the threshold of ₹15 lakh relate to (a) Indian citizens visiting India; and (b) Indian citizens not paying taxes anywhere across the world, respectively.\nIn your case, since you have obtained TRC from the UAE tax authorities, it is presumed that you are eligible to access India-UAE DTAA benefits.\nBecause of the Finance Act 2020 amendments, if you become a resident under the Indian tax law, you may apply the tie-breaker tests provided under the India-UAE DTAA to determine the treaty residence in your case.\nIn your case, if the tie breaks are in favour of the UAE, then you can apply the provisions of the India-UAE DTAA as if you are a tax resident of UAE, notwithstanding the amendments made vide Finance Act 2020.\nUnder the India-UAE DTAA, India has been allocated the right to tax capital gains arising from the sale of shares, whereas India does not have the right to tax capital gains arising from redemption of mutual funds.",
      "url": "https://www.livemint.com/money/personal-finance/can-i-take-benefit-of-india-uae-dtaa-11718616332606.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2024/06/17/1600x900/Tax_3_1717236671503_1718630871052.jpg"
    },
    {
      "news_number": 24,
      "title": "Finance Minister Nirmala Sitharaman to hold pre-budget meeting with industry leaders on June 20",
      "summary": "Follow us on Image Source : PTI Union Minister Nirmala SitharamanUnion Finance Minister Nirmala Sitharaman will hold representatives from the industry associations on June 20 evening as part of pre-budget consultations.\nThe meeting, slated to take place between 4 and 6 pm at North Block, will see industry associations such as the Federation of Indian Chambers of Commerce & Industry (FICCI), Confederation of Indian Industry (CII), Associated Chambers of Commerce and Industry of India (Assocham), and PHD Chamber of Commerce and Industry presenting their budget suggestions and recommendations.\nThe meeting is a part of the annual pre-budget consultations by the government which is aimed at taking feedback and suggestions from key stakeholders in the formation of the upcoming Union Budget.\nThe Union Budget is anticipated to be tabled in Parliament in the third week of July.\nAhead of the meeting with the Finance Minister, the industry associations will meet Revenue Secretary Sanjay Malhotra on June 18.",
      "url": "https://www.indiatvnews.com/news/india/finance-minister-nirmala-sitharaman-to-hold-pre-budget-meeting-with-industry-leaders-on-june-20-seek-suggestions-from-key-stakeholders-bjp-nda-updates-2024-06-17-937408",
      "imgURL": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2024/06/sitharaman-1718633354.jpg"
    },
    {
      "news_number": 25,
      "title": "Revival in FPI inflows likely to ease pressure on rupee",
      "summary": "Apart from this, weakness in other currencies such as EURO and Japanese yen also supported dollar demand, BoB says in its report.\nOngoing political uncertainty in Europe (European parliamentary elections and snap elections in France), has pulled EUR down by more than 1%.\n“The trend for the rupee will likely remain range-bound, but the undertone remains weak as it consolidates near its all-time low.\nA significant drop in the dollar below $103 would be necessary to trigger strong rupee buying above 83.00.\nUntil then, the rupee is expected to trade within the range of approximately 83.20-83.75,\" says Trivedi.",
      "url": "https://www.fortuneindia.com/investing/revival-in-fpi-inflows-likely-to-ease-pressure-on-rupee/117190",
      "imgURL": "https://media.assettype.com/fortuneindia/2021-09/19fbdb41-ced1-46db-9ae9-06aa099ed907/RBI_rupe.jpg?w=700"
    },
    {
      "news_number": 26,
      "title": "Investing in India from abroad: Navigating financial hurdles for NRIs",
      "summary": "Despite the many good reasons for investing in India, non-resident Indians (NRIs) face numerous hurdles that can dampen their enthusiasm.\nWhile mutual funds seem like an effortless option, getting started involves significant hassle and paperwork.\nFinding the right adviser helpsAs NRIs, investing in India can be challenging due to the complex financial landscape and regulations, but finding a reliable adviser can make a big difference.\nDos and Don'tsWhen investing in India, NRIs should follow some essential do's and don'ts.\nDiversify your portfolio by exploring options like mutual funds, index funds, and strategic ETFs.",
      "url": "https://www.livemint.com/money/personal-finance/investing-in-india-from-abroad-navigating-financial-hurdles-for-nris-11718099679721.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2024/06/12/1600x900/g81356e946f2e1edbd2f58cc3300a711edeb4ad58ca257d47d2442e71963c67623254c115f35e3cfe26d2912192e702f2fceeac913ccce24f873e38a3bb15ba69_1280_1718182065208_1718182081699.png"
    },
    {
      "news_number": 27,
      "title": "IFC to finance Brookfield’s 550-MW solar power project in Rajasthan, ET EnergyWorld",
      "summary": "AdvtAdvtJoin the community of 2M+ industry professionals Subscribe to our newsletter to get latest insights & analysis.\nDownload ETEnergyworld App Get Realtime updatesSave your favourite articles Scan to download AppNew Delhi: International Finance Corporation ( IFC ) has committed to part finance a 550 MW solar power project in Bikaner, Rajasthan being developed by Brookfield Asset Management with $105 million through long-term non-convertible debentures allocated to the project's special purpose vehicles, which are implementing the project.According to the official press release, following its commitment, Brookfield will provide solar power to commercial and industrial consumers across India at more competitive tariffs through long-term power purchase agreements (PPAs) and contribute to the nation’s decarbonization goals.“This is IFC’s first investment in Asia and the Pacific using an innovative hybrid offtake structure where the project sells the power generated to C&I consumers under long-term corporate PPAs and merchant markets via exchange,” it added.The release said that the project will be connected to the inter-state transmission system section of India’s green energy corridor.“Through our partnership with Brookfield, IFC aims to facilitate the broader uptake of clean energy by demonstrating the viability of large-scale renewable energy generation, and sale to pan-India corporate and industrial clients, through the interstate transmission system,” said Imad N Fakhoury, IFC's Regional Director for South Asia.Fakhoury added that the novel procurement options underscore the role of hybrid transactions in scaling up investments in renewables, increasing market competitiveness, and offsetting the energy sector’s carbon footprint — key to achieving India’s climate goals.“We are pleased to collaborate with IFC, sharing a common goal through this strategic partnership… We plan to continue to expand our renewable and energy transition footprint in India focusing on both state utility and C&I segments in the country.\nWith a portfolio of over 25 GW of renewable power assets in operation or in development across leading platforms in the country, we look forward to capitalizing on the scaled transition opportunities on offer in the country,” said Nawal Saini, managing director, renewable power and transition, Brookfield.Since 2010, IFC has invested $2.79 billion in multiple projects to strengthen the renewable energy and energy efficiency sectors in India.",
      "url": "https://energy.economictimes.indiatimes.com/news/renewable/ifc-to-finance-brookfields-550-mw-solar-power-project-in-rajasthan/111055287",
      "imgURL": "https://etimg.etb2bimg.com/thumb/msid-111055287,imgsize-467057,width-1200,height=765,overlay-etenergy/renewable/ifc-to-finance-brookfields-550-mw-solar-power-project-in-rajasthan.jpg"
    },
    {
      "news_number": 28,
      "title": "Mumbai retains top spot as India's most expensive city for expats: Mercer report",
      "summary": "Mumbai remains the most expensive Indian city for expatriates to live in, while Hong Kong tops the global ranks yet again, a survey by HR consultancy Mercer has found.\nDespite Mumbai's rise in rankings, the overall affordability of Indian cities remains a key advantage for multinational organisations or Indian companies looking to attract global talent, Sharma said.\nOn the contrary, the Indian rupee remained stable against the dollar, hence there is no significant dip in ranking for Indian cities, the report said.\nTransportation costs encompassing automobiles, auto parts and running costs are the highest in Mumbai followed by Bangalore.\nExpat housing costs in Kolkata saw the slowest rise of less than 2 percent among Indian cities.",
      "url": "https://www.moneycontrol.com/news/business/mumbai-retains-top-spot-as-indias-most-expensive-city-for-expats-mercer-report-12750208.html",
      "imgURL": "https://images.moneycontrol.com/static-mcnews/2024/06/20240607012038_bse_nse_stockmarket_nifty_sensex.jpg"
    },
    {
      "news_number": 29,
      "title": "France’s finance minister warns of financial crisis if far right wins election",
      "summary": "French Finance Minister Bruno Le Maire warned on Friday that the euro zone's second-biggest economy faced the risk of a financial crisis if either the far right or left won the coming parliamentary election because of their heavy spending plans.\nAsked whether the current political instability could lead to a financial crisis, Le Maire said: \"Yes.\"\nAt least two polls have put the left not far behind the RN, and ahead of Macron's centrist camp.\n\"It's either the far right or us,\" she said, urging left-wing voters to back the new alliance, dubbed the \"Popular Front,\" which gathers the Socialists, Greens, Communists, and hard-left Unbowed France (LFI) in an alliance.\nUnions and rights groups have called on people to take part in rallies against the far right at the weekend.",
      "url": "https://indianexpress.com/article/world/frances-finance-minister-warns-of-financial-crisis-if-far-right-wins-election-9393283/",
      "imgURL": "https://images.indianexpress.com/2024/06/Bruno-Le-Maire-Reuters.jpg"
    },
    {
      "news_number": 30,
      "title": "Cyber frauds: How are money mule scams impacting India's financial inclusion efforts?",
      "summary": "However, this technological progress has also led to a new threat: cyber fraud.\nIndia now ranks among the largest victims and perpetrators of cyber fraud worldwide.\nAlso Read: 6 ways to protect yourself from cyber fraud threatsIn a country where 60% of the population lives on less than $3 a day, any scale of cyber fraud poses life-changing consequences for the victims.\nCyber fraud manifests in several ways, but one insidious practice is money mule fraud.\nVictims lose money, digital platforms lose customers, regulators increase compliance, but everyone loses trust.",
      "url": "https://www.livemint.com/money/personal-finance/cyber-frauds-how-are-money-mule-scams-impacting-indias-financial-inclusion-efforts-phishing-fraud-credit-scores-11717737975001.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2024/06/07/1600x900/3-0-27757321-istockphoto-958867880-2048x2048-0_1679821178651_1717738461379.jpg"
    },
    {
      "news_number": 31,
      "title": "Deutsche Bank wins Best Structured Trade Finance, Best New Economy and Best NBFI Bank in APAC",
      "summary": "News April 25, 2024Deutsche Bank wins Best Structured Trade Finance, Best New Economy and Best NBFI Bank in APACThe bank’s ability to bring its Global Hausbank offering to clients won out at this year’s The Asset awards",
      "url": "https://www.db.com/news/detail/20240425-deutsche-bank-wins-best-structured-trade-finance-best-new-economy-and-best-nbfi-bank-in-apac?language_id=1",
      "imgURL": "https://www.db.com/contentAsset/image/a2fce753-ce7e-4ceb-892a-704e8a2538cd"
    },
    {
      "news_number": 32,
      "title": "IIFL Finance plans to sell shares worth Rs 84 cr in NSE via secondary mkt",
      "summary": "Non-banking financial company IIFL Finance plans to divest its equity stake in the National Stock Exchange (NSE).\nIt has received approval from NSE for the sale of equity shares worth Rs 84.7 crore through the secondary market, the financial services firm said in an exchange filing.\nAfter the divestment, IIFL Finance’s stake in NSE will fall to 0.146 per cent.\nThe stake sale comes within months of its acquisition of 0.18 per cent stake in the stock exchange for Rs 284.4 crore.\nIn April, IIFL Finance had bought a stake in NSE from FIH Mauritius Investments.",
      "url": "https://www.business-standard.com/markets/news/iifl-finance-plans-to-sell-shares-worth-rs-84-cr-in-nse-via-secondary-mkt-124061700658_1.html",
      "imgURL": "https://bsmedia.business-standard.com/_media/bs/img/article/2023-10/18/thumb/featurecrop/400X400/1697641159-094.jpg"
    },
    {
      "news_number": 33,
      "title": "Today’s Latest Business News, Finance and Share Market News at 5:30 pm on 17 June 2024",
      "summary": "Sarbartho Mukherjee, Senior Associate Economist, CareEdge Ratings, said that the outlook for food inflation has brightened due to anticipations of a normal monsoon, which is expected to bolster agricultural production.\nMoving on, Hyundai Motor’s Indian business has filed draft papers for India’s largest initial public offerings (IPOs) on Saturday.\nHyundai Motor’s Indian unit has applied for regulatory approval for a stock market listing in Mumbai, potentially marking the nation’s largest IPO.\nThe politician’s overall portfolio stood at Rs 4.56 crore as of June 14 and has gained 7.5% since June 04 when it stood at Rs 4.25 crore.\nAmong these hopeful groups are taxpayers also, who are particularly expecting relief from the Finance Minister in form of tax sops.",
      "url": "https://indianexpress.com/audio/expresso-business-update/todays-latest-business-news-finance-and-share-market-news-at-530-pm-on-17-june-2024/9396695/",
      "imgURL": "https://images.indianexpress.com/2021/09/Expresso-Business-Mobile-4.jpg"
    },
    {
      "news_number": 34,
      "title": "Alternative payment surge in APAC: India, China lead the way in alternative payment tools for e-commerce payments, says GlobalData",
      "summary": "With payment solutions such as mobile and digital wallets displacing traditional payment methods like cash and bank transfers, alternative payments have become the most popular payment tools for e-commerce payments in Asia-Pacific (APAC), stated a report by GlobalData.\nIn the region, China led the way in 2023 with alternative payments accounting for nearly two-thirds of the total e-commerce payments value in 2023.\nWith popularity in countries like China and India, alternative payments are gaining traction in other APAC markets as well.\nAccording to GlobalData’s 2023 Financial Services Consumer Survey, alternative payment solutions account for more than 65 per cent of the e-commerce transaction value in China.\nOther Asian markets like Indonesia, Hong Kong, Singapore, and the Philippines are also seeing high adoption of alternative payment solutions.",
      "url": "https://www.financialexpress.com/business/banking-finance-alternative-payment-surge-in-apac-india-china-lead-the-way-in-alternative-payment-tools-for-e-commerce-payments-says-globaldata-3526729/",
      "imgURL": "https://www.financialexpress.com/wp-content/uploads/2024/06/RBI-digital-payments.jpg"
    },
    {
      "news_number": 35,
      "title": "Mayer Brown advises Indian NBFC Shriram Finance Limited on drawdown of US$750 million notes under GMTN Program",
      "summary": "Mayer Brown represented Shriram Finance Limited, one of India's largest retail Non-Banking Financial Corporations (NBFC), on its successful Rule 144A / Regulation S offering of US$750 million 6.625% Senior Secured Notes due 2027 under its US$3.5 billion Global Medium Term Note Program (GMTN).\nMayer Brown also advised Shriram Finance Limited on its annual GMTN program update.\nThe Mayer Brown team was led by Corporate & Securities partner Thomas Kollar and included partner Phillip Hyde, associates Nicole Fulk and Anne Cai, and corporate finance officer Iris Gong (all Hong Kong).\nWith decades of experience in the Indian market, Mayer Brown's India group offers a deep understanding of the Indian market to assist clients with their complex cross-border corporate, financing, and legal matters.",
      "url": "https://www.mayerbrown.com/en/news/2024/01/mayer-brown-advises-indian-nbfc-shriram-finance-limited-on-drawdown-of-usdollars750-million-notes-under-gmtn-program",
      "imgURL": "https://www.mayerbrown.com/cdn-cgi/image/width=400,quality=90,format=jpeg/-/media/images/tile-images-for-insights-and-news/tile_bucket-300x400_20.jpg?rev=03ade08dcdb14f0db987e16c66306866"
    },
    {
      "news_number": 36,
      "title": "State Bank of India indicates further increase in corporate loan rates",
      "summary": "State Bank of India (SBI) – the country’s largest lender – which increased the marginal cost of funds based lending rates (MCLR) last week, said those lending rates are yet to peak and there could be another 10-15 basis points (bps) rise.\nRetail loans are linked to the external benchmark lending rate (EBLR), which is mostly linked to the Reserve Bank of India’s policy repo rate.\nThe central bank has kept the repo rate unchanged at 6.5 per cent since February 2023.\nGupta also said banks’ margins would be impacted when the Reserve Bank of India cuts the policy repo rate later in the financial year.\nThe lenders have to pass on policy rate changes immediately to the borrower, which may impact the margins immediately, he added.",
      "url": "https://www.business-standard.com/finance/news/state-bank-of-india-indicates-further-increase-in-corporate-loan-rates-124061700600_1.html",
      "imgURL": "https://bsmedia.business-standard.com/_media/bs/img/article/2023-05/19/thumb/featurecrop/400X400/1684499357-9314.jpg"
    }
  ],
  "politics": [
    {
      "news_number": 0,
      "title": "Why an ancient Greek tragedy has resonance in politics today — in India and beyond",
      "summary": "What could the earliest extant Greek tragedy have to say about the recent elections?\nThere is much lamentation and tearing of hair and repeated cries of woe for the dead warriors and their grieving families.\nHow could this possibly be a trope for the recent electoral victory and defeat of the contending parties?\nAnd yet the play, a commentator reminds us, was often recalled in contexts very different from the Greco-Persian conflict.\nA familiar Greek trope characterised the Persians as a nation where only one man was free.",
      "url": "https://indianexpress.com/article/opinion/columns/ancient-greek-tragedy-relevance-india-politics-9397705/",
      "imgURL": "https://images.indianexpress.com/2024/06/aeschylus.jpg"
    },
    {
      "news_number": 1,
      "title": "Consensus or division? How Modi will manage Indian coalition government",
      "summary": "As Narendra Modi traversed the country during recent months, campaigning for a third term in power, he repeated the same refrain.\nCoalition restraintsSince the shock election result, Modi’s public messages have emphasised the theme of consensus, and that the prime minister’s office should be “the people’s not Modi’s”.\nJust how this coalition arrangement impacts Modi’s ability to implement his agenda for a third term remains to be seen.\nHe said that over his next term, Modi would push for a manufacturing boost, as a means to encourage quality job creation which has been severely lacking in India.\nYet several of the BJP’s key coalition partners are overtly secular and several enjoy considerable support from Muslim voters.",
      "url": "https://www.theguardian.com/world/article/2024/jun/17/india-coalition-government-narendra-modi-analysis",
      "imgURL": "https://i.guim.co.uk/img/media/4f46b4bdaa4f241c14f569e5b98264cf2e651fb2/0_0_5264_3160/master/5264.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2374a378091d236504f129c61c3a8e7f"
    },
    {
      "news_number": 2,
      "title": "‘Vote against jail’: How two Modi critics won India election from prison",
      "summary": "But Rashid did something ever rarer: he contested and won from Delhi’s Tihar jail, which is approximately 850km (528 miles) away.\nSingh, like Rashid, contested from jail – in his case, a high-security prison in Assam, in the northeast corner of India.\nOn June 4, as the results of India’s election were announced, Singh won by 400,000 votes.\nShamshair Singh Warriach, a journalist and political analyst based in Punjab, ruled out that the vote was for “secessionism”.\nMore broadly, he argued, Rashid, Singh and Khalsa have not won in a vacuum.",
      "url": "https://www.aljazeera.com/news/2024/6/14/vote-against-jail-how-two-modi-critics-won-india-election-from-prison",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/AFP__20240606__34VG774__v1__HighRes__FilesIndiaKashmirVotePrisoners-1718286603.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 3,
      "title": "Kuwait fire: India brings back bodies of 45 workers",
      "summary": "India brings back bodies of 45 workers from Kuwait3 days ago By Meryl Sebastian , BBC News, Kochi ShareAFP Relatives mourn as coffins arrive from Kuwait on an Indian Air Force plane at KochiAn Indian Air Force flight has brought back the bodies of 45 workers who were killed in a fire in Kuwait.\nThe fire broke out on Wednesday at a residential building in Mangaf city where 176 Indian workers lived.\nKuwaiti authorities said 50 people were killed in the fire, including 45 from India and three from the Philippines.\nMr Singh said the Indian government had arranged a special Air Force flight to bring back the bodies.\nThe flight landed in Kerala's Kochi city on Friday morning where the bodies of workers from southern Indian states were given to authorities, and then continued to Delhi.",
      "url": "https://www.bbc.com/news/articles/cg330n9x614o",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/bcca/live/fecb29f0-2a37-11ef-a1fa-1b739acc6f54.jpg"
    },
    {
      "news_number": 4,
      "title": "Civility in politics? It’s really up to us, voters",
      "summary": "Once we get what uncivil political practice means, we’ll understand we need more than just nice netasCan civility return to India’s politics?\nBut ‘civility’ – Latin root ‘cives’ – asks much more of us than a namaste and a smile.\n‘Cives’ is Latin for city or public space.\nCivility is, therefore, deeply entwined with politics.\nSo, politics is uncivil when we, including our politicians, can’t engage with each other, just because we can’t agree on important stuff.",
      "url": "https://timesofindia.indiatimes.com/blogs/open-patent/civility-in-politics-its-really-up-to-us-voters/",
      "imgURL": "https://static.toiimg.com/imagenext/toiblogs/photo/blogs/wp-content/uploads/auth-et/5a74f27f-bade-4d3f-b7cf-fa87da228285"
    },
    {
      "news_number": 5,
      "title": "Vincenzo de Luca at Idea Exchange: ‘Modi, Meloni share the same vision about relationship between tradition and present challenges’",
      "summary": "Ambassador of Italy to India Vincenzo de Luca.\n(Express photo by Abhinav Saha) Ambassador of Italy to India Vincenzo de Luca.\n(Express photo by Abhinav Saha) Ambassador of Italy to India Vincenzo de Luca.\nAmbassador of Italy to India Vincenzo de Luca.\n(Express photo by Abhinav Saha) Ambassador of Italy to India Vincenzo de Luca.",
      "url": "https://indianexpress.com/article/idea-exchange/vincenzo-de-luca-at-idea-exchange-modi-and-meloni-share-the-same-vision-about-relationship-between-tradition-and-present-challenges-and-europe-and-india-9396445/",
      "imgURL": "https://images.indianexpress.com/2024/06/ASA-20240610-IE-Vincenzo-De-Luca-10.jpg"
    },
    {
      "news_number": 6,
      "title": "Civility in politics? It’s really up to us, voters",
      "summary": "Civility in politics?\nIt’s really up to us, votersSaubhik ChakrabartiTNN Updated: Jun 14, 2024, 22:05 IST ISTOnce we get what uncivil political practice means, we’ll understand we need more than just nice netasCan civility return to India’s politics?\nWhen we say or even write about ‘civility’, we usually mean one or more of the following: politeness, being respectful, being nice, speaking softly, not being overly argumentative.\nBut ‘civility’ — Latin root ‘cives’ — asks much more of us than a namaste and a smile.\nAs an analysis hosted by the Hannah Arendt Centre points out, “the practice of civility is the practice of being a citizen.” To be “civil”, is to go beyond your private self and be a “public person” — a person with rights.",
      "url": "https://timesofindia.indiatimes.com/civility-in-politics-its-really-up-to-us-voters/articleshow/111004229.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-111004578,width-1070,height-580,imgsize-65340,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 7,
      "title": "The enormous stakes of India’s election",
      "summary": "The 2024 Indian election is the largest in world history: Nearly 1 billion people are eligible to cast their ballots.\nYet India’s nonpartisan Election Commission has somehow managed to run consistently well-regarded contests for decades.\nInstead, they’re voting for the local members of his Bharatiya Janata Party (BJP) or its many rivals.\nThere’s every indication Modi’s crackdown on both democracy and minority rights will continue if the BJP triumphs in this election.\nThere’s a lot going on in the Indian election.",
      "url": "https://www.vox.com/world-politics/351497/india-election-2024-explainer-narendra-modi-bjp",
      "imgURL": "https://platform.vox.com/wp-content/uploads/sites/2/2024/05/gettyimages-2153591529.jpg?quality=90&strip=all&crop=0,10.776130549589,100,78.447738900822"
    },
    {
      "news_number": 8,
      "title": "Indians Are Finally Standing Up to Modi’s Politics of Hate - The New York Times",
      "summary": "For weeks, the announcement of India’s election results loomed as a moment of dread for millions of people who cherish the country’s commitment to secular democracy.\nMr. Modi has towered over India since first sweeping to power in 2014.\nHis government, which also included 50 members of Parliament from minor coalition partners, ran roughshod over the opposition.\nThe opposition I.N.D.I.A.\nalliance — formed by the once-dominant Indian National Congress and more than two dozen mostly regional parties — nearly equaled the B.J.P.",
      "url": "https://www.nytimes.com/2024/06/05/opinion/india-election-modi.html",
      "imgURL": "https://static01.nyt.com/images/2024/06/06/multimedia/05mody-NEW-bgml/05mody-NEW-bgml-facebookJumbo.jpg"
    },
    {
      "news_number": 9,
      "title": "Why caste still matters in Indian politics",
      "summary": "N arendra Modi , India’s prime minister, made several costly miscalculations in this year’s general election.\nHe underestimated the extent of economic angst, especially about under-employment and inflation.\nAnd he relied excessively on Hindu nationalism to mobilise voters from the nation’s religious majority.\nBut perhaps his most telling error was to mishandle what is still the most important fault line in Indian society: caste.\nMr Modi’s Bharatiya Janata Party ( BJP ) ran a campaign that sought to unite every tier of Hinduism’s centuries-old caste system, under which adherents are ranked by birth in a strict hierarchy, with Brahmins (the priestly caste) at the top and Dalits (formerly known as untouchables) at the bottom.",
      "url": "https://www.economist.com/asia/2024/06/13/why-caste-still-matters-in-indian-politics",
      "imgURL": "https://www.economist.com/img/b/1280/720/90/media-assets/image/20240615_ASD002.jpg"
    },
    {
      "news_number": 10,
      "title": "More than a strongman? In India, coalition politics will be Modi’s third-term test.",
      "summary": "Having taken his oath and appointed his Cabinet, Indian Prime Minister Narendra Modi embarked on his third term in office this week.\nThe coalition dynamics will test Mr. Modi’s political acumen as he navigates the diverse demands of his allies and party.\nThe leader, who is in his 70s, is only the second Indian prime minister to retain power for a third term.\nCan Mr. Modi lead a coalition?\nHowever, this new government requires Mr. Modi to cultivate a spirit of collaboration and negotiation.",
      "url": "https://www.csmonitor.com/World/Asia-South-Central/2024/0614/india-modi-coalition-bjp-election",
      "imgURL": "https://images.csmonitor.com/csm/2024/06/0614%20OINDIAGOV%20swearing%20in.jpg?alias=standard_900x600"
    },
    {
      "news_number": 11,
      "title": "Modi claims victory in India’s election but drop in support forces him to rely on coalition partners",
      "summary": "Highlights from India’s election results: Catch up on AP’s coverage as results were tallied.\nThat means Modi will need the support of other parties in his coalition — a stunning blow for the 73-year-old, who had hoped for a landslide victory.\nThe economic message from the results is that jobs matter.”The Congress party won 99 seats, improving its tally from 52 in the 2019 elections.\nThe opposition INDIA coalition won a total of 232 seats.\nThe opposition INDIA alliance attacked Modi over his Hindu nationalist politics, and campaigned on issues of joblessness, inflation and inequality.",
      "url": "https://apnews.com/article/india-election-results-2024-lok-sabha-modi-bjp-7893efecc83fa8225a611f174e6420ee",
      "imgURL": "https://dims.apnews.com/dims4/default/9709752/2147483647/strip/true/crop/7621x4287+0+397/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb7%2F17%2Ff380f544e3895f0ae77efbed3558%2F0d111225e8a94272b794f6f741580042"
    },
    {
      "news_number": 12,
      "title": "India calls for stronger protections for its overseas workers",
      "summary": "NEW DELHI -- Binu Nayar spent part of the past two decades talking to his brother, Murlidhar Nayar, by phone, listening to him describe the overcrowded living conditions he endured in Kuwait so he could remain employed and feed his family back home.\nMurlidhar was a senior supervisor for NBTC Group, a Kuwaiti construction company run by an Indian from the southern coastal state of Kerala.\nHe shared a two-bedroom flat with nine other workers.",
      "url": "https://asia.nikkei.com/Politics/India-calls-for-stronger-protections-for-its-overseas-workers",
      "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F4%2F5%2F6%2F4%2F47844654-3-eng-GB%2FCropped-17185931352024-06-15T122253Z_228470563_RC2LB8AU6VWS_RTRMADP_3_KUWAIT-FIRE-INDIA.JPG?width=1260&height=630&fit=cover&gravity=faces&source=nar-cms"
    },
    {
      "news_number": 13,
      "title": "Will India’s powerful Modi change his ways after the election setback?",
      "summary": "NEW DELHI — In 2016, Narendra Modi faced his first crisis as Indian prime minister.\nWhile both Naidu and Kumar clashed with Modi in the past — Kumar famously compared Modi to Hitler during a falling-out in 2013 — neither has the ambition to challenge Modi in national politics today.\nBut if the Indian opposition believes the two state leaders will check Modi’s power, they may be mistaken, analysts say.\nIn speeches since the election, Modi has made adjustments in tone, if not in substance.\nAdvertisementThe business sector seemed to agree and on the day the election results were announced showing Modi had lost his parliamentary majority, the stock market tumbled.",
      "url": "https://www.washingtonpost.com/world/2024/06/16/india-modi-coalition-leadership-change/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6YC4C5VCBPSVFK5GS34WN5YAO4.jpg&w=1440"
    },
    {
      "news_number": 14,
      "title": "A Major Political Scandal in India Tests World's Largest Democracy : State of the World from NPR : NPR",
      "summary": "A Major Political Scandal in India Tests World's Largest Democracy : State of the World from NPR In India, the world's largest democracy, Prime Minister Narendra Modi recently won a third term in office.\nWhile he is clearly popular, during his time in power there has also been brutal repression of dissent.\nWe examine a major scandal that unfolded in the run-up to the previous election, five years ago, and examine what it means for the health of Indian democracy.\nState of the World from NPR How the Planet's Biggest Democracy Deals with a Major Scandal How the Planet's Biggest Democracy Deals with a Major Scandal Listen · 16:55 16:55 Enlarge this image toggle caption Satish Bate/Hindustan Times via Getty Images Satish Bate/Hindustan Times via Getty Images In India, the world's largest democracy, Prime Minister Narendra Modi recently won a third term in office.\nWe examine a major scandal that unfolded in the run-up to the previous election, five years ago, and examine what it means for the health of Indian democracy.",
      "url": "https://www.npr.org/2024/06/14/1196982238/how-the-planets-biggest-democracy-deals-with-a-major-scandal",
      "imgURL": "https://media.npr.org/assets/img/2024/06/14/gettyimages-970961668-edit_wide-fc5eea28fa0273112a87940379aeed29a74b54ef.jpg?s=1400&c=100&f=jpeg"
    },
    {
      "news_number": 15,
      "title": "Israel must gear up for the evolving political landscape in India - opinion",
      "summary": "The composition of Modi’s new government, heavily dependent on political allies, may bring about changes in India’s foreign policy dynamics, particularly regarding its relationship with Israel.\nSome of these allies might prioritize different aspects of international relations based on their national political (vote-bank) agenda or attempt to bring their political agendas to the forefront.\nIndia's Prime Minister Narendra Modi addresses his supporters during the launch of Gandhi Ashram redevelopment project in Ahmedabad, India, March 12, 2024.\nThe need to address the concerns of the Muslim community within India might lead Modi’s government to adopt a more cautious foreign policy.\nNina Slama is an expert on India’s foreign policy from Reichman University.",
      "url": "https://www.jpost.com/opinion/article-806320",
      "imgURL": "https://images.jpost.com/image/upload/f_auto,fl_lossy/c_fill,g_faces:center,h_407,w_690/603907"
    },
    {
      "news_number": 16,
      "title": "AI deepfakes of politicians in India pose threat to other elections",
      "summary": "AI deepfakes of politicians in India, including ones that have died, are spreading online, posing a threat to other elections.\nNBC News' Janis Mackey Frayer has more on how the deepfake trend could affect elections in the U.S.June 5, 2024",
      "url": "https://www.nbcnews.com/now/video/ai-deepfakes-of-politicians-in-india-pose-threat-to-other-elections-212280901517",
      "imgURL": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/mpx/2704722219/2024_06/1717554313008_now_topstory_ai_deepfake_elections_240604_1920x1080-vba5fw.jpg"
    },
    {
      "news_number": 17,
      "title": "The Aftermath of India’s 2024 Elections",
      "summary": "Their discussion touches on the political opposition’s gains, the state of Hindutva, and how the results will affect India’s global relationships.\nThe last five years, notwithstanding the period of COVID, the BJP really did not see any serious domestic competition for power.\nSo give us your sense of what to expect with regards to India’s relationship with its immediate strategic environments.\nAnd so let’s imagine we’re in September of this year and the pre-polls going into the state elections are looking bad for the BJP.\nBut I think in the broader South Asia region and looking to your beat, really the Central Asian region, I think India’s focus goals remain intact.",
      "url": "https://newlinesinstitute.org/political-systems/the-aftermath-of-indias-2024-elections/",
      "imgURL": "https://newlinesinstitute.org/wp-content/uploads/GettyImages-2147791033-1920x1280.jpg"
    },
    {
      "news_number": 18,
      "title": "After India’s Surprising Elections, What’s Next for Modi’s Foreign Policy?",
      "summary": "While the stunning results will have immediate consequences for Modi’s domestic agenda, foreign and national security policies are not top priorities for India’s new parliament.\nWhere Does India’ Foreign Policy Go from Here?\nIndia’s elections are never fought primarily over foreign policy, but their outcomes do have consequences.\nIndia’s elections affect its policymaking process, the ideology and worldview of its ruling government and the fate of its statesmen.\nHowever, if normal parliamentary order returns it could complicate some of Modi’s foreign and national security policy projects by, at the very least, exposing them to heated public debate.",
      "url": "https://www.usip.org/publications/2024/06/after-indias-surprising-elections-whats-next-modis-foreign-policy",
      "imgURL": "https://www.usip.org/sites/default/files/styles/image_with_caption/public/2024-06/20240611_india-party-power-5_nyt_ac.jpg?itok=FQEv8kNo"
    },
    {
      "news_number": 19,
      "title": "Opposition Must Renew Fight Against Modi-Shah Regime's Politics of Hate: Indian Diaspora Outfits",
      "summary": "Other forms of vigilantism continue.”>They urged opposition parties and civil society organisations to be vigilant against the excesses of the ruling establishment.\nAdvertisementDespite this however, vote counting revealed a rejection of hate and the BJP lost its overall majority, leaving it dependent on its NDA allies to form a government.\nThe BJP also lost at least 20 seats where Modi had delivered openly Islamophobic election speeches.\nThe BJP and its publicists are now, in a blatant distortion of facts claiming that the opposition successes were due to a Muslim vote bank, in other words it was a communalised vote.\nIndian Muslims felt compelled to vote against the BJP because of the BJP’s vicious and violent Islamophobia and not for any religious reasons.",
      "url": "https://m.thewire.in/article/rights/opposition-must-renew-fight-against-modi-shah-regimes-politics-of-hate-indian-diaspora-outfits",
      "imgURL": "https://mcmscache.epapr.in/post_images/website_350/post_43001261/full.jpg"
    },
    {
      "news_number": 20,
      "title": "Modi Just Learned Hype Can Only Carry You So Far",
      "summary": "India is unpredictable.\nThis is an incontrovertible fact that Indians themselves seem to have forgotten over the past decade.\nEver since Prime Minister Narendra Modi stormed into office with an unexpected and unprecedented outright legislative majority in 2014, many have assumed the country’s politics had changed forever.\nThe age of coalitions was over; India seemed to be heading inexorably toward one-party dominance.\nTo stock traders and pro-government pundits, the country’s trajectory seemed so clear: It was destined to see steady 8% growth, happy voters, and a prime minister going from strength to strength at home and abroad.",
      "url": "https://www.bloomberg.com/opinion/articles/2024-06-04/modi-learns-the-limits-of-hype-in-india-s-election",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/inPZVs8haFCQ/v1/1200x800.jpg"
    },
    {
      "news_number": 21,
      "title": "India election results 2024: 3 lessons from Modi’s shocking setback",
      "summary": "Why did Indian voters deal a devastating blow to a prime minister who, by all measures, they mostly seem to like?\nPrior to the election, there was a sense that Indian voters either didn’t much care about the assault on liberal democracy or mostly agreed with it.\nVoters seemingly punished Modi’s party for turning a blind eye to Pawar’s offenses against the public trust.\nRahul Gandhi, India's opposition leader, speaks during a news conference at the Indian National Congress headquarters during election results night in New Delhi, India, on Tuesday, June 4, 2024.\nIndian voters, like those in Brazil and Poland before them, have dealt a major blow to their homegrown authoritarian faction.",
      "url": "https://www.vox.com/politics/354424/india-election-results-2024-modi-congress-economy-democracy-liberalism",
      "imgURL": "https://platform.vox.com/wp-content/uploads/sites/2/2024/06/gettyimages-2155440988.jpg?quality=90&strip=all&crop=0,13.246073298429,100,73.507853403141"
    },
    {
      "news_number": 22,
      "title": "India’s Modi faces ‘unprecedented’ alliance test after election results",
      "summary": "The BJP still emerged as India’s largest party, with 240 seats, but that number falls well short of the 272 needed for a majority.\nModi was “unanimously elected as the leader of the NDA” at the meeting of the NDA, the BJP said in a statement on X.\n“Modi has only been known to work as a leader with absolutely centralised power.”“The ‘Modi phenomenon’ is based on a particular form of governance.\nHim having to compromise with allies is not either a Modi we know, or a Modi he has sold,” Sircar added.\nWith the election result, “Brand Modi” has suffered a setback, said Rasheed Kidwai, a political analyst.",
      "url": "https://www.aljazeera.com/news/2024/6/5/new-test-for-modi-after-india-election-surprise-can-he-work-with-others",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/2024-06-04T155750Z_334922837_RC2F48ADT12K_RTRMADP_3_INDIA-ELECTION-MODI-1717591731.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 23,
      "title": "Train of thought: India voters dissect Modi’s politics during long journey",
      "summary": "The 2,900km (1,800-mile) journey from capital New Delhi to Kanyakumari in the south is one of the longest train rides in India, passing through cities, villages, scrub forests and deep ravines.\nChaudhary, a locomotive driver travelling to the southern city of Madurai for work, believes Modi has improved the country.\nSubhan, a 74-year-old former railway employee who is Muslim, was travelling to the city of Bhopal in central India.\nYet, for Prasad, Modi has achieved something important.\nKumar, a 32-year-old telecom engineer from the southern Indian city of Tiruchirappalli, is scathing of the Modi government.",
      "url": "https://www.aljazeera.com/gallery/2024/5/21/photos-on-one-of-indias-longest-train-rides-ongoing-election-divides-passengers",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/05/AP24135282890560-1716272061.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 24,
      "title": "India election results: Big wins, losses and surprises",
      "summary": "The opposition INDIA alliance, led by the Indian National Congress party, won 232 seats.\nThe Congress won only one seat, the Bahujan Samaj Party (BSP) won 10 and the Samajwadi Party (SP) got five.\nThe BJP won 33 seats, while its allies secured three seats in UP.\nThe Congress alone won 13 seats, while the BJP won nine.\nThe JD(S) won in two constituencies and the Congress won 10 seats.",
      "url": "https://www.aljazeera.com/news/2024/6/4/india-election-results-big-wins-losses-and-surprises",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/AP24156459275183-1717506024.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 25,
      "title": "Modi’s election setback surprises Indian Americans in the DMV",
      "summary": "The first thing Syed Ashraf did when he awoke at 5:45 a.m. last Tuesday in his Ashburn, Va. home was look up the Indian election results.\nAs Modi and the BJP’s setback became clear, reaction from Indian Americans in the DMV ran the gamut: shock, delight, hope, worry, resignation.\nHe noted how Indian stocks plunged as election results rolled out.\nAdvertisementBy Tuesday evening, he said, he was satisfied with the results: Modi secured a third term, and that is enough.\nThe Sikh community has not been happy either.”For Singh, 54, the election results represent a pushback against Modi’s Hindu nationalist agenda.",
      "url": "https://www.washingtonpost.com/dc-md-va/2024/06/11/indian-americans-india-elections-reaction/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/UDN7YFXIZRMP6CZFZ2IPGNRFQI.jpg&w=1440"
    },
    {
      "news_number": 26,
      "title": "Modi’s BJP loses majority in India election shock, needs allies for gov’t",
      "summary": "But as India’s election authorities counted 640 million votes within a day on Tuesday, after a six-week-long election, the BJP fell well short of its performances from 2014 and 2019.\nBy contrast, the opposition INDIA alliance, led by the Congress party, won 232 seats, significantly higher than exit polls had predicted.\nThe BJP with its allies, in a coalition known as the National Democratic Alliance (NDA), won 293 seats.\nBoth the parties have also previously been in alliance with the Congress party.\nThe regional Samajwadi Party, a part of the opposition INDIA alliance, won 37 seats, while the Congress won six others.",
      "url": "https://www.aljazeera.com/news/2024/6/4/modis-bjp-loses-majority-in-india-election-shock-needs-allies-for",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/06/AFP__20240604__34UY89J__v1__HighRes__IndiaVote-1717507212.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 27,
      "title": "Why India’s Political Reset Isn’t a Growth Killer",
      "summary": "The spike in volatility in Indian markets this week portends the triumph of politics over economics after a 10-year hiatus.\nNarendra Modi met leaders of the parties that make up his National Democratic Alliance Wednesday.\nFor the first time since he became chief minister of the western state of Gujarat in 2001 — or prime minister in 2014 — he needs allies to stake his claim on power.",
      "url": "https://www.bloomberg.com/opinion/articles/2024-06-06/india-s-political-reset-won-t-kill-growth",
      "imgURL": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iCypMo7G6ef0/v1/1200x800.jpg"
    },
    {
      "news_number": 28,
      "title": "Modi won the Indian election. So why does it seem like he lost?",
      "summary": "And heading into this year’s six-week-long staggered election, he was widely expected to further consolidate his hold over Indian politics.\nAnd that has real consequences: He’ll likely face new constraints on his increasingly authoritarian leadership thanks to a renewed opposition coalition — and possibly from within his own coalition, too.\nAfter 10 years, Modi will face some constraints on his ruleOverall, the BJP lost 63 of the seats it previously held in the Lok Sabha.\nThat’s just come back to the fore.”Furthermore, because there is now a fulsome opposition party, “the parliament will once again become a site for vigorous debate and contestation,” Varshney said.\nBut the opposition coalition is untested, and could become fractious over time, too, Vaishnav said.",
      "url": "https://www.vox.com/world-politics/354352/modi-india-election-gandhi-bjp-uttar-pradesh-inauguration-hindutva",
      "imgURL": "https://platform.vox.com/wp-content/uploads/sites/2/2024/06/gettyimages-2155431384.jpg?quality=90&strip=all&crop=0,8.5129954023753,100,82.974009195249"
    },
    {
      "news_number": 29,
      "title": "The end of India’s politics of necessity | Faisal Devji",
      "summary": "Since Indian independence, the country’s politics have been marked by a struggle between a politics of self-interest and a politics driven by a disinterested vision of the good society.\nFor Faisal Devji the 2024 election results mark a return to the latter, after the dominance of the former under BJP rule.\nThe philosopher Hannah Arendt described any politics dedicated only to securing access to food, shelter, employment or other bodily needs as an animal politics.\nIf it was not to degenerate into a quest to maximise material interests, she argued, politics had to offer a disinterested vision of the good society.\nAnything else, such as the rule of self-interest resulting in a beggar thy neighbour politics, produces socia",
      "url": "https://iai.tv/articles/the-end-of-indias-politics-of-necessity-auid-2855",
      "imgURL": "https://iai.tv/favicon.ico"
    },
    {
      "news_number": 30,
      "title": "A political scandal raises questions about Modi and India's democracy : Up First : NPR",
      "summary": "The Sunday Story: An Indian Political ScandalEnlarge this image toggle caption Screenshot by NPR/Mojo Story/Rafiq Maqbool/AP Screenshot by NPR/Mojo Story/Rafiq Maqbool/APStarting in 2018, sixteen people were arrested in India for allegedly plotting to assassinate Prime Minister Narendra Modi.\nThey included professors, a poet, trade unionists and members of an improv acting troupe.\nThe evidence against them, discovered on their electronic devices, appears damning: minutes of terror cell meetings, emails to banned Maoist rebels and a letter suggesting a suicide attack on Modi.\nThey all say they were falsely accused and that the evidence against them was fabricated and planted by hackers in order to silence them.\nDigital forensic investigators not only agree but say Modi's own government may be involved.",
      "url": "https://www.npr.org/2024/06/02/1198912881/india-modi-political-scandal-activists-jailed",
      "imgURL": "https://media.npr.org/assets/img/2024/05/30/stan-swamy-duo_wide-df6bdb3ce020e7a8c6983465d9065987a17a3a5b.jpg?s=1400&c=100&f=jpeg"
    },
    {
      "news_number": 31,
      "title": "G7, West’s shifting political landscape and India’s growing salience",
      "summary": "Winning a third term as prime minister was more than enough to raise his prestige among his peers in the West and beyond.\nAt the summit, Modi looked tall given the precarious situation the G7 leaders find themselves in.\nAcross the Atlantic, British Prime Minister Rishi Sunak is all set to lead the Tories to a defeat in the general election set for July 4.\nIndia’s internal arguments about its presence at the G7 summit betray a certain ignorance about the shifting political landscape in North America and Europe and a lack of awareness of India’s growing salience for the G7.\nThat would put the size of India’s economy ahead of all G7 countries except the US.",
      "url": "https://indianexpress.com/article/opinion/editorials/g7-wests-shifting-political-landscape-and-indias-growing-salience-9396452/",
      "imgURL": "https://images.indianexpress.com/2024/06/express-view-22.jpg"
    },
    {
      "news_number": 32,
      "title": "India’s election shows the world’s largest democracy is still a democracy",
      "summary": "Voters queue up to cast their ballots at a polling station during the seventh and final phase of voting in India’s general election in Dharamsala, India on June 1, 2024.\nResults from the nation’s parliamentary elections — the largest in the world — indicate a shocking electoral setback for Prime Minister Narendra Modi and his Hindu nationalist Bharatiya Janata Party (BJP).\nAt the end of the staggered six-week election, Modi will become only the second Indian prime minister to win a third consecutive term.\nThat’s more than any Indian party won between 1984 and 2009, when Modi first came to power, and in most elections, it would have been an amazing result.\nThe ruling party’s most significant losses came in Uttar Pradesh, India’s most populous state and a longtime BJP bastion.",
      "url": "https://www.vox.com/world-politics/353785/india-election-2024-modi-bjp",
      "imgURL": "https://platform.vox.com/wp-content/uploads/sites/2/2024/06/gettyimages-2154921002.jpg?quality=90&strip=all&crop=0,10.732984293194,100,78.534031413613"
    },
    {
      "news_number": 33,
      "title": "India’s Modi is known for bold — and controversial — decisions. After a narrower election victory, he may have to change style",
      "summary": "NEW DELHI (AP) — Since coming to power a decade ago, Prime Minister Narendra Modi has been known for big, bold and often snap decisions that he’s found easy to execute thanks to the brute majority he enjoyed in India’s lower house of parliament.\nIn the end, the party won 240 seats — short of the 272 needed to form the government on its own.\nThis is both a major setback and unknown territory for Modi, who has never needed his coalition partners to govern since first becoming prime minister in 2014.\nAt the heart of his governance style has been his penchant for control, critics say, adding that Modi has increasingly centralized power.\n“Modi is Modi.",
      "url": "https://www.pbs.org/newshour/politics/indias-modi-is-known-for-bold-and-controversial-decisions-after-a-narrower-election-victory-he-may-have-to-change-style",
      "imgURL": "https://d3i6fh83elv35t.cloudfront.net/static/2024/06/2024-06-04T155750Z_334922837_RC2F48ADT12K_RTRMADP_3_INDIA-ELECTION-MODI-1024x576.jpg"
    },
    {
      "news_number": 34,
      "title": "NDA govt back in charge, a short history of coalition politics in India",
      "summary": "In the past 50-60 years, phases of coalition governments in India, on and off, have disrupted phases of single-party governments with clear majorities.\nHere is a look at the history of coalition politics in India.\nMost of these coalition governments proved to be short lived but offered the Opposition parties a template to take on the Congress.\nIn his place, Chandra Shekhar became PM for a brief while with Congress support.\nThe coming of the NDAIn 1998, the BJP formed the National Democratic Alliance (NDA) to take on the Congress.",
      "url": "https://indianexpress.com/article/political-pulse/nda-govt-back-in-charge-a-short-history-of-coalition-politics-in-india-9397343/",
      "imgURL": "https://images.indianexpress.com/2024/06/cover_ea15b4.jpg"
    },
    {
      "news_number": 35,
      "title": "India election 2024: Why Modi failed to win outright majority",
      "summary": "Why India's Modi failed to win outright majority4 June 2024 By Soutik Biswas , @soutikBBC, India correspondent ShareAFP The results are a personal blow to Mr Modi, who has never fallen short of a majorityIndian PM Narendra Modi has won a third consecutive term in a much tighter general election than anticipated.\nMr Modi's harsh and divisive campaign, particularly targeting Muslims, could also have alienated voters in some regions.\nMr Modi’s party faced its largest setback in Uttar Pradesh (UP), a state larger than the United Kingdom and three times as populous.\nA dent of Brand Modi Mr Modi’s popularity has been also attributed to his mastery of branding, transforming routine events into spectacles and astute messaging.\nThe election results show that Brand Modi has lost some of its shine, indicating that even Mr Modi is susceptible to anti-incumbency.",
      "url": "https://www.bbc.com/news/articles/c977g8gl5q2o",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/9ecd/live/0a859a00-22a9-11ef-baa7-25d483663b8e.jpg"
    },
    {
      "news_number": 36,
      "title": "Lok Sabha 2024: The influencers driving India's big election",
      "summary": "\"Social media content is powerful and can influence the way a person feels about an issue,\" Mr Deshpande says.\nLike thousands of others, Ms Aggarwal follows a bunch of \"political influencers\", or people who talk about politics on social media to \"really understand what's going on\".\nBut for Mr Pal, this is just one of the problems he sees with politics on social media.\n\"The mainstream media has been taken over by the BJP,\" alleges Supriya Srinate, who heads social media for the Congress party.\nAnkit Lal, former political advisor of the opposition Aam Aadmi Party (AAP), agrees that influencers have helped democratise the publicity landscape.",
      "url": "https://www.bbc.com/news/world-asia-india-68920953",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/0D80/production/_133265430_final2-1.jpg"
    },
    {
      "news_number": 37,
      "title": "Here's why opposition in India must offer people a credible alternative",
      "summary": "India’s public sphere has begun to crumble after 10 years of one-party rule | Photo: BloombergBy Mihir SharmaFor a decade now, India has not had a functional opposition.\nPrime Minister Narendra Modi’s Bharatiya Janata Party won such sweeping mandates that even the official position of Leader of the Opposition lay vacant.\nHe seemed too earnest, awkward, and privileged to offer a credible alternative to Modi.\nAnd, while such a strategy may reveal what the opposition is against, Modi’s rivals need to show what they are for.\nThat means, while the election may be over, opposition parties must continue to sell their policy proposals.",
      "url": "https://www.business-standard.com/politics/heres-why-opposition-in-india-must-offer-people-a-credible-alternative-124061700046_1.html",
      "imgURL": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-06/17/thumb/fitandfill/400X400/1718587897-9944.jpg"
    },
    {
      "news_number": 38,
      "title": "Why Modi Underperformed",
      "summary": "It’s a message that says, “Modi, we’re not completely giving up on you, but we don’t like how you’ve done stuff.\nTV media will only give you Modi, Modi, Modi.” So social media emerged as this alternative space.\nNow, that has been heightened a bit because of the Modi government’s own arrogance, and that’s maybe been taken down a peg.\nBut fundamentally I don’t think this changes much about the nature of India’s partnerships, what its priorities are, and who it seeks to work with.\nRA: Nationalism has been such an important force in India, but particularly under the Modi government, that has morphed into jingoism.",
      "url": "https://foreignpolicy.com/2024/06/06/india-election-modi-bjp-nda-coalition/",
      "imgURL": "https://foreignpolicy.com/wp-content/uploads/2024/06/India-Modi-elections-GettyImages-2155410461.jpg?w=1000"
    },
    {
      "news_number": 39,
      "title": "Election 2024: The lack of discussion on LGBTQIA+ rights in campaigns and party manifestos",
      "summary": "It has implications for future political and social agendas Examining the manifestoes of political parties reveals their stance on LGBTQIA+ rights in India.\nThe missing debateThe Yogyakarta Principles of 2007 outline human rights standards related to sexual orientation and gender identity, affirming states’ obligation to protect LGBTQIA+ rights.\nIn the just concluded election, the manifestos of major political parties reflect a general apathy towards these issues.\nHowever, it stopped short of addressing marriage equality and banning conversion therapy, offering limited progress for LGBTQIA+ rights.\nIn the 2024 general election, the debate over LGBTQIA+ rights was largely absent.",
      "url": "https://indianexpress.com/article/opinion/columns/election-2024-the-lack-of-discussion-on-lgbtqia-rights-in-campaigns-and-party-manifestos-9397175/",
      "imgURL": "https://images.indianexpress.com/2024/06/cover_a5876b.jpg"
    },
    {
      "news_number": 40,
      "title": "On calling Indira Gandhi 'mother' of India, Union min Gopi now takes U-turn",
      "summary": "Suresh Gopi, who was inducted as a union minister in the Narendra Modi government’s third term, won the Thrissur Lok Sabha seat in the Lok Sabha elections 2024.\n(Photo: PTI)A day after calling former Prime Minister Indira Gandhi the “ mother of India ,” newly inducted Union Minister Suresh Gopi retracted his statement, saying that it was “misinterpreted” by the media.\n“In India, its (Congress) mother is Indira Gandhi.\nSuresh Gopi takes charge as union ministerGopi, who was inducted as a union minister in the Narendra Modi government’s third term, won the Thrissur Lok Sabha seat in the Lok Sabha elections 2024.\nGopi won the Thrissur seat by defeating his closest rival, the Communist Party of India’s Sunil Kumar, by 74,686 votes.",
      "url": "https://www.business-standard.com/politics/on-calling-indira-gandhi-mother-of-india-union-min-suresh-gopi-now-takes-u-turn-124061700225_1.html",
      "imgURL": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-06/12/thumb/fitandfill/400X400/1718165510-2547.jpg"
    },
    {
      "news_number": 41,
      "title": "Narendra Modi Fell to Earth After Making It All About Himself",
      "summary": "When everything became about Prime Minister Narendra Modi of India, his party and its century-old Hindu-nationalist network were propelled to unimagined heights.\nOn the back of his singular charisma and political skill, a onetime-fringe religious ideology was pulled to the center of Indian life.\nLandslide election victories remade India’s politics, once dominated by diverse coalitions representing a nation that had shaped its independence on secular principles.\nOn Tuesday, Mr. Modi and his Bharatiya Janata Party, or B.J.P., fell back to earth.\nMr. Modi will remain in office for a third term, but only with the help of a contentious coalition of parties, some of which are opposed to his core beliefs and want power of their own.",
      "url": "https://www.nytimes.com/2024/06/05/world/asia/india-election-modi.html",
      "imgURL": "https://static01.nyt.com/images/2024/06/05/multimedia/05india-assess-01-czbv/05india-assess-01-czbv-facebookJumbo.jpg"
    },
    {
      "news_number": 42,
      "title": "India election 2024: How Modi's rivals came back from the brink",
      "summary": "Experts questioned whether it was fit to challenge Mr Modi, who looked unstoppable at the time.\nThe credit for the opposition’s performance, Mr Kidwai says, largely goes to Mr Gandhi, the much criticised scion of the Nehru-Gandhi dynasty.\nIt also gave him confidence and political heft.” But Mr Gandhi was still not perceived as a threat to Mr Modi.\nBut the biggest upset for Mr Modi and the BJP, Mr Bose says, came from the bellwether state of Uttar Pradesh (UP).\nThe BJP’s tally has been restricted to a poor 33.” Mr Modi's party won 62 seats in 2019 and took 71 in 2014.",
      "url": "https://www.bbc.com/news/articles/cp00jze920eo",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/25e4/live/24c80770-2341-11ef-bc00-bfab0688459c.jpg"
    },
    {
      "news_number": 43,
      "title": "India's Gandhi wins 'rebirth' after shock election comeback",
      "summary": "NEW DELHI -- Rahul Gandhi's political career was on life support five years ago.\nThe leader of India's opposition Congress party -- and scion of the Nehru-Gandhi political dynasty -- had just suffered a thumping defeat to Prime Minister Narendra Modi's Bharatiya Janata Party (BJP) in 2019 polls.\nLosing his family's long-held constituency seat in the election drubbing, Gandhi quit as the head of Congress, while Modi and the BJP mocked the great-grandson of India's first post-independence leader as an unserious dilettante who they dubbed \"the prince\".",
      "url": "https://asia.nikkei.com/Politics/India-elections/India-s-Gandhi-wins-rebirth-after-shock-election-comeback",
      "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fcms-image-bucket-production-ap-northeast-1-a7d2.s3.ap-northeast-1.amazonaws.com%2Fimages%2F1%2F9%2F8%2F1%2F47821891-6-eng-GB%2FCropped-1718164804-06-04T134725Z_642899806_RC2C48ALX5G7_RTRMADP_3_INDIA-ELECTION+%281%29.JPG?width=1260&height=630&fit=cover&gravity=faces&source=nar-cms"
    },
    {
      "news_number": 44,
      "title": "Trudeau, Modi meet for first time since Canada publicly accused India of Sikh leader's assassination",
      "summary": "Prime Minister Justin Trudeau and India's Prime Minister Narendra Modi have met for the first time since Trudeau publicly accused Modi's government of involvement in the assassination of a Canadian Sikh activist.\n\"The prime minister congratulated Prime Minister Modi on his re-election and the leaders had a brief discussion on the bilateral relationship,\" Ann-Clara Vaillancourt said in a media statement.\nLast met in 2023Earlier on Friday, Trudeau and Modi were both around the same G7 table during an outreach session.\nIndian Prime Minister Narendra Modi, left, is welcomed by Italian Prime Minister Giorgia Meloni at the G7 in Borgo Egnazia, near Bari, in southern Italy, on Friday.\nOne expert said Friday that the leaders' meeting may be a sign that relations between India and Canada are improving.",
      "url": "https://www.cbc.ca/news/politics/trudeau-modi-india-g7-italy-1.7226843",
      "imgURL": "https://i.cbc.ca/1.7235570.1718405506!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/trudeau-modi-meeting.jpg"
    },
    {
      "news_number": 45,
      "title": "Indian voters dissect Modi’s politics while traversing the country by train",
      "summary": "India’s overcrowded trains are seen as a metaphor for its chaotic, diverse and unequal democracy, riven by class, caste and religion.\nAs the world’s largest democracy holds one of most consequential elections ever, the India team decided to go on an 1,800-mile (2,900-kilometer) train journey to understand what matters to the Indian voters and what has changed in the 10 years of Prime Minister Narendra Modi’s rule.\nThe aim was to lay out a clear plan for reporting, writing and filming, especially the inputs needed for digital presentation and social planning.\nThe package served both traditional and digital customers.\nThe sounds, sights and texture of the images both inside and outside the train captured the voices and mood of ordinary voters as the country’s six-week-long election enters its final stages.",
      "url": "https://www.ap.org/news-highlights/best-of-the-week/second-winner/2024/indian-voters-dissect-modis-politics-while-traversing-the-country-by-train/",
      "imgURL": "https://www.ap.org/wp-content/uploads/2024/05/AP24135277438820-1-scaled.jpg"
    },
    {
      "news_number": 46,
      "title": "'In India, a lower caste revolution is underway'",
      "summary": "In India, the Bharatiya Janata Party (BJP) led by Narendra Modi lost the national elections of 2024 as they fell short of majority by 32 seats, a considerable number.\nThey will now form a coalition government with the regional anti-caste political parties they had previously opposed.\nThe judiciary and the hitherto minimally oppositional media will find it easier to pursue their vocations in the coming months.\nOn December 6, 1992, the Rashtriya Swayamsevak Sangh (the upper caste supremacist paramilitary organization and the parent of the BJP) and its offshoots accomplished the demolition and unleashed pogroms against Muslims across India killing thousands.\nNot only Modi, but also the so-called left and right in the upper caste media, proclaimed that he had already won the elections.",
      "url": "https://www.lemonde.fr/en/opinion/article/2024/06/14/in-india-a-lower-caste-revolution-is-underway_6674773_23.html",
      "imgURL": "https://img.lemde.fr/2024/06/10/33/0/8245/5496/1440/960/60/0/733bfd2_4b870beb3dbc41f2a648b3af7cf8ed96-0-0fa1b4af7edc442ea47e13d3e0f40ecc.jpg"
    }
  ]
}