{
  "india": [
    {
      "news_number": 0,
      "title": "Visualizing the international reach of U.S. funding cut by Trump",
      "summary": "Using graphics to illustrate the scope of U.S. foreign aid spending and analyzing how the Trump administration’s sweeping cuts could play out across the world.\nMore than $60 billion in foreign assistance has been frozen for 90 days, pending a government review.\nWithout U.S. support, humanitarian experts warn that already precarious global aid efforts could collapse, putting millions of lives at risk.\nHere’s a breakdown of U.S. foreign assistance and a look at how the new administration’s sweeping cuts could play out across the world.\nThe majority of people receive direct food aid, rather than cash, which means that working supply chains are vital to staving off hunger.",
      "url": "https://www.washingtonpost.com/world/2025/02/09/trump-usaid-foreign-funding-cuts-rubio/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RUGLRTKULZB6XPESJMXXJVLTDI.jpeg&w=1440"
    },
    {
      "news_number": 1,
      "title": "ICC: Dozens of member states back top criminal court after Trump sanctions",
      "summary": "Dozens of countries back International Criminal Court after Trump sanctions2 days ago Bernd Debusmann Jr BBC News, White House Amy Walker BBC NewsGetty Images Trump previously sanctioned ICC officials during his first term in office in 2020Dozens of countries have expressed \"unwavering support\" for the International Criminal Court (ICC) after US President Donald Trump imposed sanctions on its staff.\nTrump announced the sanctions after hosting Israel's Prime Minister Benjamin Netanyahu - the first foreign leader to visit him since returning to power.\nLast year, the ICC issued an arrest warrant for Netanyahu over alleged war crimes in Gaza - which Israel denies - as well as a Hamas commander.\nThe US and Israel do not recognise the authority of the ICC, the only global court with powers to prosecute individuals for genocide, crimes against humanity and war crimes.\nDuring his first term in office, Trump imposed sanctions on ICC officials who were investigating whether US forces had committed war crimes in Afghanistan.",
      "url": "https://www.bbc.com/news/articles/cx2p19l24g2o",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/b9ec/live/979bc1e0-e526-11ef-a319-fb4e7360c4ec.jpg"
    },
    {
      "news_number": 2,
      "title": "How the far right is expanding its international network – DW – 02",
      "summary": "Fangen is a renowned expert on the transnational network of the radical right.\nAnd the radical right is quickly learning from each other.\n\"This communication strategy is now used everywhere by actors on the radical right,\" he said.\nFunding for the radical rightThe radical right has a lot of money at its disposal for its ideological struggle.\nOn his platform X, he raves about the AfD in Germany, supports the radical right in the UK and rails against liberal parties.",
      "url": "https://www.dw.com/en/how-the-far-right-is-expanding-its-international-network/a-71530393",
      "imgURL": "https://static.dw.com/image/71359605_6.jpg"
    },
    {
      "news_number": 3,
      "title": "These international student-athletes came to Philly for an education. Now their Eagles fandom is ‘a way of life.’",
      "summary": "The St. Joseph's field hockey team features many international students, but some have developed an affinity for the Eagles.\n“I think the supporters, especially from the Eagles, are really people who love the Eagles.\nLike, even in bad times, they keep supporting their team,” Bijkerk said.\n“For our sports, we usually sing a song every time our team wins the game,” Devenie said.\n“We play earlier that day, but that night, it’s all for Eagles,” Devenie said.",
      "url": "https://www.inquirer.com/college-sports/st-joes/sju-athletics-womens-basketball-field-hockey-eagles-super-bowl-2025-20250208.html",
      "imgURL": "https://www.inquirer.com/resizer/v2/2KBGJPR4ZVATLMW2J2LRXFJIEA.jpg?auth=f47b802b59df6e7836323a7b95ed2969270f8ad08b2f5311bbb30ad32f270e30&width=760&height=507&smart=true"
    },
    {
      "news_number": 4,
      "title": "Varsha Bharath’s Bad Girl wins NETPAC Award at International Film Festival Rotterdam",
      "summary": "The teaser of director Varsha Bharath’s debut film, Bad Girl, created quite a stir on social media.\nWhile it did receive its share of bouquets, the impact of the brickbats was more deeper as sections of the audience called the film out for its representation of sexual desire of a woman, and for caste-based stereotyping.\nWhile many argued it was too early to come to a conclusion considering it was just the teaser, the overwhelming negativity became the calling card for the film, presented by Anurag Kashyap and Vetrimaaran.\nNow, the film, which had its global premiere at the International Film Festival Rotterdam, has earned a rare honour that might turn the tides in its favour.\nALSO READ: Varsha Bharath’s Bad Girl teaser sparks polarising reactions from filmmakers and audience alike",
      "url": "https://indianexpress.com/article/entertainment/tamil/varsha-bharaths-bad-girl-wins-netpac-award-at-international-film-festival-rotterdam-9824621/",
      "imgURL": "https://images.indianexpress.com/2025/02/Bad-Girl-wins-NETPAC-award-at-IFFR.jpg"
    },
    {
      "news_number": 5,
      "title": "El Salvador constitutional amendment sparks international concerns over human rights",
      "summary": "Amnesty International on Friday expressed deep concern over the recent amendment to Article 248 of El Salvador’s constitution, warning that the change could drastically undermine human rights protections.\nHistorically, any constitutional changes in El Salvador required approval across two consecutive legislative sessions.\nThe international community, including human rights organizations and political analysts, has echoed Amnesty International’s concerns.\nThere is strong advocacy for the return to a more transparent and participatory constitutional process to safeguard human rights and democracy in El Salvador.\nRights advocates argue that these conditions have set a troubling precedent for the implications of the new constitutional amendment.",
      "url": "https://www.jurist.org/news/2025/02/el-salvador-constitutional-amendment-sparks-international-concerns-over-human-rights/",
      "imgURL": "https://www.jurist.org/news/wp-content/uploads/sites/4/2024/03/XIII_Legislative_Assembly_of_El_Salvador.jpg"
    },
    {
      "news_number": 6,
      "title": "Team USA Wins Three Medals at U.S. Synchronized Skating International Classic",
      "summary": "By Kristen HennemanTeam USA won three medals Saturday at the 2025 U.S. Synchronized Skating International Classic in Norwood, Massachusetts.\nSkating at the club they represent, The Skating Club of Boston, the Haydenettes used international season’s best scores for their short program, free skate and overall score to claim the bronze.\nIn the short program, the 2024 U.S. champions totaled the highest element and component scores.\nTeam Image ended the competition in sixth place, scoring 57.96 points in the short program and 105.60 points in the free skate.\nFor full results at the U.S. Synchronized Skating International Classic, visit the 2025 Challenger Series Competition Central.",
      "url": "https://www.usfigureskating.org/news/article/team-usa-wins-three-medals-us-synchronized-skating-international-classic",
      "imgURL": "https://www.usfigureskating.org/sites/default/files/media-library/IMG_4164%2016x9.jpg"
    },
    {
      "news_number": 7,
      "title": "USA: Sanctions against International Criminal Court betray international justice system",
      "summary": "In response to the executive order announced today by President Trump imposing sanctions on the International Criminal Court (ICC), Agnès Callamard, Amnesty International’s Secretary General, said:“This reckless action sends the message that Israel is above the law and the universal principles of international justice.\n“The United States is ready to punish an institution that ensures the individuals most responsible for committing atrocities cannot escape justice.\nAgnès Callamard, Amnesty International’s Secretary General“This attack against the ICC seeks to damage the Court’s independent pursuit of international justice.\n“Governments around the world and regional organizations must do everything in their power to mitigate and block the effect of President Trump’s sanctions.\nThrough collective and concerted actions, ICC member states can protect the Court and its staff.",
      "url": "https://www.amnesty.org/en/latest/news/2025/02/usa-sanctions-against-international-criminal-court-betray-international-justice-system/",
      "imgURL": "https://www.amnesty.org/en/wp-content/uploads/2025/02/301121-crop.jpg"
    },
    {
      "news_number": 8,
      "title": "CUI Tennis Teams Sweep Hope International",
      "summary": "Thanks for visiting !\nThe use of software that blocks ads hinders our ability to serve you the content you came here to enjoy.\nWe ask that you consider turning off your ad blocker so we can deliver you the best experience possible while you are here.\nThank you for your support!",
      "url": "https://cuigoldeneagles.com/news/2025/2/8/womens-tennis-cui-tennis-teams-sweep-hope-international.aspx",
      "imgURL": "https://cuigoldeneagles.com/images/2024/3/25/IMG_9866.JPG?preset=large.socialmediaimage"
    },
    {
      "news_number": 9,
      "title": "Investigators are starting to arrest high-tech international thieves targeting US superstar athletes like Patrick Mahomes",
      "summary": "© 2024 Fortune Media IP Limited.\nAll Rights Reserved.\nUse of this site constitutes acceptance of our Terms of Use and Privacy Policy | CA Notice at Collection and Privacy Notice | Do Not Sell/Share My Personal InformationFORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries.\nFORTUNE may receive compensation for some links to products and services on this website.\nOffers may be subject to change without notice.",
      "url": "https://fortune.com/2025/02/08/international-thieves-south-american-gangs-arrests-superstar-athletes-patrick-mahomes/",
      "imgURL": "https://fortune.com/img-assets/wp-content/uploads/2025/02/AP25039514868997-e1739059673249.jpg?resize=1200,600"
    },
    {
      "news_number": 10,
      "title": "(rv) Baseball Completes Four-Game Sweep of Columbia International, Run-Rule Rams in Seven Innings, 11-1",
      "summary": "Keiser erupted for seven runs in the bottom of the seventh inning, capped off by Edbarry Guzman's walk-off two-RBI single up the middle.\nOn the mound, Kyle Keyes delivered a strong performance, pitching 6.0 innings while allowing just one run and striking out one to earn his second win of the season.\nNoah Eatman closed out the game for the Seahawks, recording one strikeout.\nAcross the series, the Seahawks dominated offensively, outscoring the Rams 34-7 while tallying 42 hits, nine doubles, and two home runs with 29 RBIs.\nThe pitching staff was equally impressive, with three pitchers— Noah Eatman , Carson Hawkes , and Bastyan Hernandez —posting a flawless 0.00 ERA.",
      "url": "https://kuseahawks.com/news/2025/2/8/rv-baseball-completes-four-game-sweep-of-columbia-international-run-rule-rams-in-seven-innings-11-1.aspx",
      "imgURL": "https://kuseahawks.com/images/2025/2/8/Edbarry_Guzman.png?preset=large.socialmediaimage"
    },
    {
      "news_number": 11,
      "title": "AIDS Memorial Quilt exhibit at SFO honors lives lost, raises awareness to ongoing epidemic",
      "summary": "AIDS Memorial Quilt exhibit at SFO honors lives lost, raises awareness to ongoing epidemicThe AIDS Memorial Quilt exhibit is on display at San Francisco International Airport to help raise awareness about AIDS and the ongoing epidemic.\nThe AIDS Memorial Quilt exhibit is on display at San Francisco International Airport to help raise awareness about AIDS and the ongoing epidemic.\nThe AIDS Memorial Quilt exhibit is on display at San Francisco International Airport to help raise awareness about AIDS and the ongoing epidemic.\nThe AIDS Memorial Quilt exhibit is on display at San Francisco International Airport to help raise awareness about AIDS and the ongoing epidemic.\nThe AIDS Memorial Quilt has nearly 50,000 panels dedicated to more than 110,000 people who of died of AIDS-related illnesses.",
      "url": "https://abc7news.com/post/aids-memorial-quilt-exhibit-san-francisco-international-airport-honors-lives-lost-raises-awareness-ongoing-epidemic/15882672/",
      "imgURL": "https://cdn.abcotvs.com/dip/images/15882882_020825-kgo-sfo-aids-quilt-img.jpg?w=1600"
    },
    {
      "news_number": 12,
      "title": "International Criminal Court condemns US sanctions move",
      "summary": "The court was established by the Rome Statute, negotiated within the UN – but it is a fully independent court set up to try the gravest crimes, including crimes against humanity.\nThe US executive order says that the ICC actions against Israel and preliminary investigations against the US “set a dangerous precedent, directly endangering current and former” personnel.\nThe order details possible sanctions including the blocking of property and assets of ICC officials and barring them and their families from entering the US.\nA bid to impose sanctions on the ICC by the US Congress in January prior to the change in administration, failed to garner enough support in the Senate.\nICC ‘stands firmly by its personnel’“The ICC condemns the issuance by the US of an Executive Order seeking to impose sanctions on its officials and harm its independent and impartial judicial work,” said the court in a press release.",
      "url": "https://news.un.org/en/story/2025/02/1159911",
      "imgURL": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Libraries/Production%20Library/21-11-2024_ICC_Hague1.jpg/image770x420cropped.jpg"
    },
    {
      "news_number": 13,
      "title": "International Oscar Film Nominees Reflect on Political Turmoil: ‘It Just Proves That Maybe There Is No Real Recipe for What Works in Cinema’",
      "summary": "This year’s slate of best international film Oscar nominees puts France, Brazil, Germany, Latvia and Denmark center stage for the upcoming Academy Awards.\nDirector Jacques Audiard previously told Variety that “it’s a film that’s ‘political,’ I know it.\nDirector Magnus von Horn found himself surprised by the Academy recognition, as well as the film’s box office success back in Denmark.\nPopular on Variety“It’s not a film you expect to have such reach, especially … because small children are being subjected to bad things in it,” von Horn says.\n“In South Korea, for example, we spoke about national traumas of illegal adoptions for kids who were stolen in the ’70s and ’80s and adopted by families in Sweden and Denmark,” von Horn explains.",
      "url": "https://variety.com/2025/film/awards/international-oscar-film-nominees-2025-reflect-political-turmoil-1236296169/",
      "imgURL": "https://variety.com/wp-content/uploads/2024/12/The-Girl-With-the-Needle.jpg?crop=0px%2C67px%2C1000px%2C562px&resize=1000%2C563"
    },
    {
      "news_number": 14,
      "title": "Israel/ OPT: President Trump’s claim that US will take over Gaza and forcibly deport Palestinians appalling and unlawful",
      "summary": "His language is inflammatory, outrageous and shameful, and his proposal amounts to a flagrant violation of international law.\n“Any plan to forcibly deport Palestinians outside the occupied territory against their will is a war crime, and when committed as part of a widespread or systematic attack on the civilian population, it would constitute a crime against humanity.\nNor did he acknowledge the US government’s role in providing arms that have repeatedly been used to carry out deadly, unlawful attacks in Gaza.\n“Amnesty International also warns against the misuse of desperately needed humanitarian aid and reconstruction as a bargaining chip or as a means to coerce Palestinians in Gaza into leaving.\nNo state is entitled to treat a protected population living under occupation as pawns in a geopolitical chess game.”",
      "url": "https://www.amnesty.org/en/latest/news/2025/02/israel-opt-president-trumps-claim-that-us-will-take-over-gaza-and-forcibly-deport-palestinians-appalling-and-unlawful/",
      "imgURL": "https://www.amnesty.org/en/wp-content/uploads/2025/02/GettyImages-2197133370.jpg"
    },
    {
      "news_number": 15,
      "title": "International teams attend American Pond Hockey in Minocqua",
      "summary": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items.",
      "url": "https://www.wjfw.com/news/international-teams-attend-american-pond-hockey-in-minocqua/article_a6887fcc-e62f-11ef-ada1-4794896d39fe.html",
      "imgURL": "https://bloximages.newyork1.vip.townnews.com/wjfw.com/content/tncms/assets/v3/editorial/8/2c/82c989f4-e630-11ef-8c5e-0fe43ffe115e/67a776c55eb36.image.png?crop=899%2C472%2C0%2C13&resize=899%2C472&order=crop%2Cresize"
    },
    {
      "news_number": 16,
      "title": "International Business Machines (IBM): Among the Best Stocks to Invest In According to AI",
      "summary": "We recently compiled a list of the 10 Best Stocks to Invest in According to AI.\nIn this article, we are going to take a look at where International Business Machines Corporation (NYSE:IBM) stands against the other best stocks to invest in according to AI.\nRead more about these developments by accessing 10 Best AI Data Center Stocks and 10 Buzzing AI Stocks According to Goldman Sachs.\nRead more about these developments by accessing 30 Most Important AI Stocks According to BlackRock and Beyond the Tech Giants: 35 Non-Tech AI Opportunities.\nWhy are we interested in the stocks that hedge funds pile into?",
      "url": "https://finance.yahoo.com/news/international-business-machines-ibm-among-204632921.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/.NeZ_oB.BC2PRtGzcOJSZw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/006bcfc0bf6a5e2502bce632646ee7ea"
    },
    {
      "news_number": 17,
      "title": "Cold climate wines shine in national, international competitions",
      "summary": "These accolades highlight the dedication, consistency, and expertise of the Rolling Forks team, who produce exceptional wines that showcase the best of Minnesota's grapes.\nThe Catad’Or World Wine Awards, Latin America's most prestigious wine competition, featured over 1,000 entries from 17 countries and is endorsed by the International Organization of Vineyard and Wine and the Asociación de Ingenieros Agrónomos Enólogos de Chile.\nMinnesota's wine industry along with cold-hardy grape varieties are rapidly gaining recognition, thanks to the efforts of dedicated vintners like those at Rolling Forks Vineyards.\nJoseph Cihlar, co-owner of Rolling Forks Vineyards expressed his enthusiasm in a press release: \"We take immense pride in the achievements of our Minnesota wineries.\nAs we move forward, we are dedicated to collaborating and innovating to enhance Minnesota's wine reputation, striving for excellence in both grape cultivation and winemaking.\"",
      "url": "https://www.echopress.com/news/cold-climate-wines-shine-in-national-international-competitions",
      "imgURL": "https://cdn.forumcomm.com/dims4/default/1878942/2147483647/strip/true/crop/1200x800+0+0/resize/1599x1066!/quality/90/?url=https%3A%2F%2Fforum-communications-production-web.s3.us-west-2.amazonaws.com%2Fbrightspot%2Fc6%2F74%2F3c33973149fe8f524368693766a2%2Fep-news.jpg"
    },
    {
      "news_number": 18,
      "title": "Trump signs order imposing sanctions on International Criminal Court over investigations of Israel",
      "summary": "▶ Follow today’s live updates on the Trump administrationWASHINGTON (AP) — President Donald Trump signed an executive order imposing sanctions on the International Criminal Court over investigations of Israel, a close U.S. ally.\n“The ICC has no jurisdiction over the United States or Israel,” the order states, adding that the court had set a “dangerous precedent” with its actions against both countries.\nHe and Trump held talks Tuesday at the White House, and Netanyahu spent some of Thursday meeting with lawmakers on Capitol Hill.\nIn 2020, Trump sanctioned chief prosecutor Karim Khan’s predecessor, Fatou Bensouda, over her decision to open an inquiry into war crimes committed by all sides, including the U.S., in Afghanistan.\nAny sanctions could cripple the court by making it harder for its investigators to travel and by compromising U.S.-developed technology to safeguard evidence.",
      "url": "https://apnews.com/article/trump-icc-sanctions-israel-order-01beee050ae84d0d9eae66d00bc8ead9",
      "imgURL": "https://dims.apnews.com/dims4/default/91cf95f/2147483647/strip/true/crop/6496x3654+0+339/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8c%2F1b%2Fc5dbedcfcdb02d788f2f6861e21d%2Fe3b6bbb6264a451ba8805875324d7043"
    },
    {
      "news_number": 19,
      "title": "Russia, South Korea, China, Malaysia, and India Lead International Arrivals as Pattaya Welcomes Over 28 Million Tourists in 2024, Driving Growth and Sustainability Efforts",
      "summary": "Russia, South Korea, China, Malaysia, and India Lead International Arrivals as Pattaya Welcomes Over 28 Million Tourists in 2024, Driving Growth and Sustainability EffortsPattaya continues to establish itself as one of Thailand’s most sought-after destinations, witnessing a remarkable surge in international visitor arrivals.\nIn 2024, Pattaya attracted an impressive 28,156,302 international tourists, playing a pivotal role in Thailand’s overall tourism growth.\nTop Five International Markets Driving Pattaya’s Tourism BoomChina – Chinese travelers remain the largest segment of international visitors, fueled by enhanced air connectivity and targeted tourism campaigns.\nRussia – A long-time favorite among Russian tourists, Pattaya remains a preferred getaway, especially during winter.\nReports of Indian visitors sleeping on public beaches have drawn attention, sparking discussions on maintaining cleanliness and managing public spaces effectively.",
      "url": "https://www.travelandtourworld.com/news/article/russia-south-korea-china-malaysia-and-india-lead-international-arrivals-as-pattaya-welcomes-over-28-million-tourists-in-2024-driving-growth-and-sustainability-efforts/",
      "imgURL": "https://www.travelandtourworld.com/wp-content/uploads/2025/02/freepik__pattaya__53901-1-1.jpg"
    },
    {
      "news_number": 20,
      "title": "Trump sanctions ‘illegitimate’ International Criminal Court",
      "summary": "President Donald Trump has slapped sanctions on the International Criminal Court (ICC), accusing the body of abusing Israel and the United States.\nEuropean Council President Antonio Costa said the sanctions “undermine the international criminal justice system as a whole”.\nSanctioning the ICC threatens the Court’s independence and undermines the international criminal justice system as a whole.\nAdvertisementThe 125-member ICC is a permanent court that can prosecute individuals for war crimes, crimes against humanity, genocide and aggression against the territory of member states or by their nationals.\nIsrael praised the sanctions ordered on the “so-called ‘international criminal court'”.",
      "url": "https://www.aljazeera.com/news/2025/2/7/trump-sanctions-international-criminal-court-over-its-us-israel-probes",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2025/02/AA-20250205-36957730-36957722-DONALD_TRUMP_BENJAMIN_NETANYAHU_JOINT_PRESS_CONFERENCE_IN_WASHINGTON_DC-1-1738788551.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 21,
      "title": "US: Trump Authorizes International Criminal Court Sanctions",
      "summary": "Click to expand Image The International Criminal Court (ICC) is seen in The Hague, Netherlands, November 7, 2019.\n© 2019 AP Photo/Peter Dejong, File(Washington, DC) – US government sanctions targeting the International Criminal Court (ICC) would undermine international accountability for the worst crimes and deprive victims around the globe of justice, Human Rights Watch said today.\nThe ICC is the permanent international court created to try people, including senior officials, accused of war crimes, crimes against humanity, genocide, and the crime of aggression.\nThe February 6 executive order authorizes sanctions against non-US persons who assist in investigations to which the US administration objects.\nWhile the US is not an ICC member, the sanctions reverse growing support for the court among US officials in recent years.",
      "url": "https://www.hrw.org/news/2025/02/07/us-trump-authorizes-international-criminal-court-sanctions",
      "imgURL": "https://www.hrw.org/sites/default/files/styles/opengraph/public/media_2020/12/202012global_icc_building.jpg?h=310ac57c&itok=SoWVISGC"
    },
    {
      "news_number": 22,
      "title": "Jr. Avs Receive Memorable Send-Off to 2025 Quebec International Pee-Wee Hockey Tournament",
      "summary": "The Jr. Avs were rewarded with two memorable days at Ball Arena leading up to their once-in-a lifetime trip.\nOn January 27th, the Jr. Avs arrived at Ball Arena to the surprise that the Avalanche’s locker room was transformed into the Jr. Avs’ room.\nWhile on the ice, the Jr. Avs took a professional team photo and were able to have their own morning skate on Ball Arena Ice.\nGood luck to the Jr. Avs who head to Quebec on February 10th and begin play on February 13th!\nTo learn more about the 2025 Jr. Avs roster, click here.",
      "url": "https://www.nhl.com/avalanche/news/qcpwt-sendoff",
      "imgURL": "https://media.d3.nhle.com/image/private/t_ratio16_9-size50/prd/sjzyeqddcjdopfdxcaqj.png"
    },
    {
      "news_number": 23,
      "title": "International Religious Freedom Summit Highlights Global Challenges and Solutions",
      "summary": "The fundamental role of religious freedom in democratic societies and universal human rights took the spotlight this week in Washington, D.C., at the annual International Religious Freedom Summit (IRF), a major platform for bipartisan, multifaith collaboration co-sponsored by the National Endowment for Democracy (NED) and other partner organizations.\nGathering participants from around the world, this year’s event featured a powerful lineup of speakers, including Vice President J.D.\nA panel moderated by Co-editor of the Journal of Democracy Will Dobson discussed tools that authoritarian regimes are using to limit religious freedom, such as censorship, transnational repression, and the weaponizing of religion itself.\nNED grantee and Nobel Peace Prize winner Oleksandra Matviychuk; former NED grantee and fellow Felix Maradiaga, and partner Adrian Zenz shared their experiences and provided recommendations for the international religious freedom movement to respond.\nIn emerging and transitional democracies, religious communities often play an important role in protecting and advancing individual rights.",
      "url": "https://www.ned.org/international-religious-freedom-summit-highlights-global-challenges-solutions/",
      "imgURL": "https://www.ned.org/wp-content/uploads/2025/02/0C278068-FF80-4070-AD80-566C4349ED19.jpeg"
    },
    {
      "news_number": 24,
      "title": "World leaders react to Trump sanctions on International Criminal Court",
      "summary": "Countries condemn US sanctions on the ICC alleging impunity for serious crimes and weakening international law.\nDonald Trump’s decision to sanction the International Criminal Court (ICC) increases the “risk of impunity” for serious crimes, 79 parties to the global tribunal have said.\n“Trump’s International Criminal Court sanctions put the US on the side of war criminals at expense of victims,” Omar Shakir, Israel-Palestine director at Human Rights Watch said.\n“Of course, as the host country, we have a responsibility to guarantee the unhindered functioning of the criminal court at all times.\n“The Netherlands stands by the International Criminal Court.",
      "url": "https://www.aljazeera.com/news/2025/2/7/countries-unite-against-trump-sanctions-on-international-criminal-court",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2024/11/2024-11-21T124109Z_347567878_RC2N9BAO0J5P_RTRMADP_3_ISRAEL-PALESTINIANS-ICC-1732366029.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 25,
      "title": "The Best International Films at the Oscars",
      "summary": "The other notable thing is that two of the films in this category are also nominated for Best Picture.\nThat’s a first, though the number of Best Picture nominees expanded from five to 10 in 2009, offering a little more room.\nIt leads this year’s Oscars with the most nominations at 13, including Best Picture.\nThis is reminiscent of how many Black critics characterized the Civil Rights-era film Green Book reactionary, yet it still won Best Picture in 2019.\nLike Gascón, Torres is also nominated for Best Actress, and I’m Still Here is also nominated for Best Picture.",
      "url": "https://foreignpolicy.com/2025/02/07/oscars-international-films-academy-nominees/",
      "imgURL": "https://foreignpolicy.com/wp-content/uploads/2025/02/oscars-foreign-films-foreign-policy-Klawe-Rzeczy-illustration-hp.jpg?w=1000"
    },
    {
      "news_number": 26,
      "title": "Paging Checks and Balances: International Expert Outlines National Security Risks From Growing Executive Branch Power",
      "summary": "By Andrew CohenIn 1990, Harold Hongju Koh’s award-winning book National Security Constitution detailed the historical importance of government checks and balances in keeping the United States safe.\n“Does the Constitution exempt foreign affairs from checks and balances?” asked Koh, who has testified regularly before Congress and litigated many cases involving international law issues in U.S. and international tribunals.\nIn that case, the Court asserted the President holds extensive and inviolable power over foreign affairs.\nSome issues her work explores include presidential power in foreign affairs, governance through executive orders, international regulatory cooperation, the role of tech platforms in national security governance, and economic statecraft.\n﻿“Many of these actions by the new administration implicate foreign affairs and national security and rest on highly questionable legal grounds,” she says.",
      "url": "https://www.law.berkeley.edu/article/harold-koh-international-expert-outlines-national-security-risks-from-growing-executive-branch-power/",
      "imgURL": "https://www.law.berkeley.edu/wp-content/uploads/2025/02/koh_web_DSC08264.jpg"
    },
    {
      "news_number": 27,
      "title": "Trump issues sanctions against the International Criminal Court",
      "summary": "Trump issues sanctions against the International Criminal Court The International Criminal Court is condemning President Trump's recent executive order imposing sanctions on the body.\nMeanwhile, Hamas released the names of three Israeli hostages that it plans to release on Saturday.\nCBS News' Chris Livesay reports.",
      "url": "https://www.cbsnews.com/video/trump-issues-sanctions-against-international-criminal-court-1/",
      "imgURL": "https://assets2.cbsnewsstatic.com/hub/i/r/2025/02/08/19afc9f3-b728-4fb5-851d-a4144f67911b/thumbnail/1200x630/2f64993e21aa34553674308802d5c43d/cbsn-fusion-trump-issues-sanctions-against-international-criminal-court-thumbnail.jpg?v=c6b5070a57014f3b00753bf0e763f9c3"
    },
    {
      "news_number": 28,
      "title": "Steelers to host international game in Dublin, marking first NFL game in Ireland",
      "summary": "Although Ireland has hosted a number of college football games, the trip to Dublin will be a first for the prosThe Pittsburgh Steelers will host the NFL's first game in Ireland at Dublin's Croke Park.\n(Photo By Seb Daly/Sportsfile via Getty Images)The NFL's international presence keeps growing, with the league announcing a game in Ireland next season.\nAr Aghaidh Linn 🇮🇪☘️The NFL is coming to Dublin, Ireland and the @steelers are the designated team!\npic.twitter.com/kpAemsOUvc — NFL UK & Ireland (@NFLUKIRE) February 7, 2025The game will mark the NFL's first appearance in the country.\nNFL commissioner Roger Goodell has ramped up the league's international games in recent years, saying in November that he was aiming for eight international games in the 2025 season.",
      "url": "https://sports.yahoo.com/steelers-to-host-international-game-in-dublin-marking-first-nfl-game-in-ireland-144652400.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/fEzbuzryS.XmTQDVPC8g4A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03Mzg-/https://s.yimg.com/os/creatr-uploaded-images/2025-02/cef8a430-e55f-11ef-bbf7-c9681e3e7395"
    },
    {
      "news_number": 29,
      "title": "Weather forecast for 2025 Daytona 500, NASCAR races at Daytona International Speedway",
      "summary": "Here is a look at the Daytona schedule and forecast for the week, leading up to the Daytona 500, via Weather Underground.\nThe forecast for Cup qualifying is for mostly clear skies and a high of 71 degrees.\nThe forecast for the Xfinity race is for partly cloudy skies, a high of 75 degrees and a 20% chance of rain.\nSunday, Feb. 162:30 p.m. — Daytona 500The forecast for the NASCAR Cup race calls for the potential of showers in the morning.\nThe forecast for the start of the race is for partly cloudy skies, a high of 74 degrees and a 17% chance of rain.",
      "url": "https://www.nbcsports.com/nascar/news/weather-forecast-for-2025-daytona-500-nascar-races-at-daytona-international-speedway",
      "imgURL": "https://nbcsports.brightspotcdn.com/dims4/default/b6912a7/2147483647/strip/true/crop/5341x3004+0+278/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fbf%2F4c%2Fa1cf38fa4b988be822df8e89b571%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2023947219"
    },
    {
      "news_number": 30,
      "title": "RIC adds first international flights in a decade with direct routes to Bermuda",
      "summary": "For the first time in a decade, international flights will arrive and depart from Richmond International Airport.\nDirect flights from Richmond to Bermuda will begin in late spring through BermudAir, a 2-year-old airline based in Bermuda, a British overseas territory about 650 miles off the Eastern Seaboard.\nThe flights will go between RIC and Bermuda’s L.F. Wade International Airport.\nThe roughly two-hour flights will run Wednesdays and Saturdays, and RIC spokesman Troy Bell said the service will be year-round.\nThe last time international flights went in and out of RIC was 2013, when direct service to Toronto ended.",
      "url": "https://richmondbizsense.com/2025/02/07/ric-adds-first-international-flights-in-a-decade-with-direct-routes-to-bermuda/",
      "imgURL": "https://richmondbizsense.com/wp-content/uploads/2025/02/bermudair.png"
    }
  ],
  "health": [
    {
      "news_number": 0,
      "title": "NRDC Analysis: Climate Action Can Improve Health in Rural India",
      "summary": "Rural India faces intense climate hazardsBoth HAPs and the NCAP—as well as a large number of climate change preparedness efforts worldwide—are focused on highly populated urban areas.\nThis effort, jointly funded by NRDC and SEWA, aims to alleviate energy poverty and advance rural climate action through implementation of policy and market-based solutions.\nNew evidence of health gainsA new commentary in the Journal of Change and Health offers early evidence of how these types of climate actions in rural India can help to improve people’s health and well-being.\nIn houses with biogas, 56 percent respondents reported health benefits from adopting cleaner cooking for themselves or other members of the household.\nScaling up rural climate action can benefit healthClimate change impacts in India are already widespread and human vulnerability is vast; the early evidence presented in our commentary shows that even stronger ambition and sustained action can help to strengthen climate resilience of people living in rural India and improve their health in the process.",
      "url": "https://www.nrdc.org/bio/vijay-limaye/nrdc-analysis-climate-action-can-improve-health-rural-india",
      "imgURL": "https://www.nrdc.org/sites/default/files/styles/social_sharing_1200x630/public/2025-02/blog.png?h=93ccc1d0&itok=004WCL7w"
    },
    {
      "news_number": 1,
      "title": "Researchers link India’s food program to better health and stronger incomes",
      "summary": "The United Nations estimated that 2.33 billion people experienced moderate or severe food insecurity in 2023.\nResearchers at UC Santa Barbara, the Indian Institute of Management and the University of Calgary examined the impacts of the world’s largest food assistance program to understand its effectiveness.\nTheir results, published in the American Economic Journal, reveal health and economic benefits that reach far beyond the caloric content of the subsidized food.\nPDS operates in a similar manner to how food stamps worked in the United States in decades past: Eligible families and individuals can purchase bags of rice or wheat at heavily subsidized rates.\nThe PDS serves 800 million people and accounted for 60% of India’s social assistance budget in 2019 through 2020, the paper explains.",
      "url": "https://news.ucsb.edu/2025/021738/researchers-link-indias-food-program-better-health-and-stronger-incomes",
      "imgURL": "https://news.ucsb.edu/sites/default/files/2025-01/India-PDS-iStock.jpg"
    },
    {
      "news_number": 2,
      "title": "MediBuddy to develop health IoT devices and more India briefs",
      "summary": "MediBuddy developing IoT devices with Japan's ELECOMVirtual care company MediBuddy has started collaborating with Japanese electronics maker ELECOM to develop health IoT devices.\nIn a media release, MediBuddy said it will develop products for daily health management and leverage the collected health and medical data to generate personalised health insights and preventive care programmes.\nThe health data will also be integrated into MediBuddy's mobile application.\nThe programme called GrafCare leverages AI, genomics data, and personalised health tracking.\nDigital child health platform to expand with seed fundBabynama, touted to be the first digital paediatric care platform in India, has scored $700,000 in a seed funding round led by Good Capital.",
      "url": "https://www.mobihealthnews.com/news/asia/medibuddy-develop-health-iot-devices-and-more-india-briefs",
      "imgURL": "https://www.mobihealthnews.com/sites/default/files/web_xl-1061984054.JPG"
    },
    {
      "news_number": 3,
      "title": "Reconceptualizing menstrual health and hygiene among young women in India",
      "summary": "This indicates that a large majority of young women in India lack access to adequate MHH resources.\nAdequate MHH by background characteristics among young women, NFHS-5 (2019–21)Table 2 shows the prevalence of adequate MHH across background characteristics, revealing significant differences in access.\nCompared to never-married women, currently married women had significantly lower odds (AOR: 0.82, 95% CI: 0.79, 0.85).\nWomen with higher education had over three times the odds of adequate access (AOR: 3.23, 95% CI: 2.89, 3.60) compared to women with no formal education.\nThese findings highlight the crucial role of sociodemographic and geographic factors in shaping disparities in adequate MHH access.",
      "url": "https://www.nature.com/articles/s44294-025-00056-0",
      "imgURL": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs44294-025-00056-0/MediaObjects/44294_2025_56_Fig1_HTML.png"
    },
    {
      "news_number": 4,
      "title": "The indefatigable ASHA worker, central to India’s healthcare system, seeks proportionate compensation",
      "summary": "After the selection, the ASHA workers go through a series of training programmes to enable them to execute their roles.\nHowever, talking to ASHA workers reveals their side of the story - a not-so-happy story.\n“I started working as an ASHA worker, hoping that I would, one day, be able to not depend on him.\nBeing an ASHA worker has allowed me to step away from my family and gain some sense of self.”For Neeraj, however, things look grim.\nAs the backbone of India’s rural healthcare system, it is essential that their contributions are recognised and their challenges are addressed.",
      "url": "https://www.thehindu.com/sci-tech/health/the-indefatigable-asha-worker-central-to-indias-healthcare-system-seeks-proportionate-compensation/article69195177.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/hi020m/article69195474.ece/alternates/LANDSCAPE_1200/AFP_36T93ZA.jpg"
    },
    {
      "news_number": 5,
      "title": "Mumbai hospitals embrace green revolution for health, savings",
      "summary": "Actrec powerSlow changeA necessity, not optionMUMBAI: There is a silent \"green\" change taking place in many city hospitals.\nCERE's Switch on Solar initiative has helped 50 institutions — schools, colleges, hospitals, old age homes, rescue centres.\nThe solarisation project will help the hospital shift to a clean energy source while reducing its carbon footprint.\n\"It's mandatory for medical colleges to adopt environmentally friendly technologies and be green, but it's voluntary for the private sector,\" he said.\n\"Considering that energy-saving ways and installations help save money in the long run, private hospitals have begun investing in the greening process despite the initial high investment,\" said Dr Desai.",
      "url": "https://timesofindia.indiatimes.com/city/mumbai/city-hospitals-embrace-green-revolution-for-health-savings/articleshow/118073202.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118074796,width-1070,height-580,imgsize-501529,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 6,
      "title": "India Research Center",
      "summary": "India Research Center The India Research Center, based in Mumbai, serves as a hub for Harvard Chan School’s research projects, educational programs, and knowledge translation and communication work across India.\nAccording to the World Bank, infant mortality in India fell from 66 to 38 per 1,000 live births from 2000 to 2015.\nYet Indian government and public health officials agree that the country also faces persistent and daunting public health challenges, particularly for the poor.\nPublic and private health systems are placing huge demands on the country’s capacity to train exceptional health leaders and professionals.\nWe seek to leverage the School’s resources to help strengthen public health training and build capacity across the health sector in India.",
      "url": "https://hsph.harvard.edu/research/india-center/",
      "imgURL": "https://hsph.harvard.edu/wp-content/uploads/2024/12/Social-Share@2x-1024x538.png"
    },
    {
      "news_number": 7,
      "title": "What's Driving Violence Against Health Workers in India",
      "summary": "The attack on Jagannathan is a grim reflection of a growing epidemic of violence against health-care workers across India.\nMany doctors and health workers believe that the media's portrayal of doctors and modern medicine plays a large role in reinforcing the existing frustrations against India's health-care system.\n\"There is no explanation in the news about the patient's medical condition, the available treatment options, or the realistic outcomes.\nHealth workers across India have been protesting and demanding a central law to address violence against health-care workers.\nShe is also a freelance health writer and patient rights advocate with a special interest in gender.",
      "url": "https://www.thinkglobalhealth.org/article/whats-driving-violence-against-health-workers-india",
      "imgURL": "https://www.thinkglobalhealth.org/sites/default/files/styles/og_image_landscape/public/2025-01/Media%20Malice_0.JPG?itok=5B7_-_yb"
    },
    {
      "news_number": 8,
      "title": "Kerala: Breaking the taboo around 'living wills' in India",
      "summary": "Dying with dignity: Breaking the taboo around 'living wills' in India6 days ago Cherylann Mollan BBC News, MumbaiGetty Images Health activists are helping champion the idea of living wills in IndiaIn 2010, IP Yadev, a surgeon from the southern Indian state of Kerala, was confronted with one of the hardest decisions of his life.\nThe experience, he says, deeply impacted him and helped him realise the importance of advance medical directives (AMDs), also known as living wills.\nBut despite the legal go-ahead, the concept of living wills hasn't really taken off in India.\nCurrently, it has the country's best palliative care network, and organisations that offer end-of-life care have also started awareness campaigns around living wills.\nIn March, around 30 people from the Pain and Palliative Care society in Thrissur city signed living wills.",
      "url": "https://www.bbc.com/news/articles/ckgyq735wnlo",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/7ab8/live/8aa6f6b0-de07-11ef-8a70-addfa227c811.jpg"
    },
    {
      "news_number": 9,
      "title": "Trends and determinants of maternal health services utilization in India from 2015 to 2021",
      "summary": "India contributes to 18% of global maternal deaths, and with 24,000 deaths in 2020, India is the highest contributor to maternal deaths among South Asian countries1.\nA better understanding of CoC pathways in terms of maternal health services utilization will assist in effective evidenced-based planning and optimal utilization of maternal schemes for MMR reduction in India.\nIn this study, the need to use maternal health services was limited to perceived need, indicating the perceived severity of pregnant women’s condition to seek maternal health services.\nFurthermore, it is important to note that the ABM model is extensively referenced in public health, particularly health services research including research on maternal health services utilization23.\nBesides, the model is flexible, provides a robust analytical understanding of maternal health services use, and has been applied in different settings and contexts24.",
      "url": "https://www.nature.com/articles/s41598-025-87975-9",
      "imgURL": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-025-87975-9/MediaObjects/41598_2025_87975_Fig1_HTML.png"
    },
    {
      "news_number": 10,
      "title": "Health Matters newsletter: on budgeting for health in india",
      "summary": "(In the weekly Health Matters newsletter, wewrite about getting to good health, and staying there.\nAmalorpavanathan says more doctors (from more medical seats) does not automatically mean better public health.\nWhy is salt important, and why has salt again become a vehicle to bring about sweeping public health behaviour change?\nIt’s also World Cancer Day today, and Siddharth Kumar Singh tells you why India’s cancer crisis demands people-centric care and ethical reforms.\nMeanwhile, the World Health Organization’s chief asked global leaders to lean on Washington to reverse President Donald Trump’s decision to withdraw from the U.N. health agency.",
      "url": "https://www.thehindu.com/sci-tech/health/health-matters-newsletter-on-budgeting-for-health-in-india/article69178669.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/1z56y/article69179363.ece/alternates/LANDSCAPE_1200/CCI_UDHindu_KSL_U6M43E2KL_R1527932989_4_fc811d91-c76b-4ba4-9066-2c63275ca694.jpg"
    },
    {
      "news_number": 11,
      "title": "Air pollution in India linked to millions of deaths",
      "summary": "Air pollution in India linked to millions of deaths Carly Stearnbourne Hide caption Show caption Credit: Adobe Stock ImageJump to Section Share Post LinkedInFacebookWhatsAppEmailCopy linkA new study published today in Lancet Planetary Health found that long-term exposure to air pollution increased deaths by 1.5 million deaths per year in India, when compared to conditions if India met the World Health Organization’s recommendations for safe exposure.\nAir pollution consisting of particles smaller than 2.5 micrometers in diameter, PM2.5, can enter the lungs and bloodstream and is a major health risk in India.\nThe study also highlights that the entire population of India lives in areas where PM2.5 levels exceed WHO guidelines.\nHence 1.4 billion people are exposed year after year to air pollution that can negatively affect health.\nIn some regions, levels of up to 119 micrograms per cubic meter were measured, significantly higher than what both the WHO and India consider safe.",
      "url": "https://hsph.harvard.edu/environmental-health/news/air-pollution-in-india-linked-to-millions-of-deaths/",
      "imgURL": "https://hsph.harvard.edu/wp-content/uploads/2024/12/AdobeStock_308391157-1024x614.jpeg"
    },
    {
      "news_number": 12,
      "title": "Time series forecasting of bed occupancy in mental health facilities in India using machine learning",
      "summary": "The analysis of weekly bed occupancy data reveals significant variability and skewness, with most weeks showing moderate-to-high occupancy levels but occasional sharp declines.\nThe seasonal component reveals that mental health hospital bed occupancy exhibits cyclical variation throughout the year.\nThe residual component, which represents the deviations from the trend and seasonal patterns, highlights periods where bed occupancy behaved unpredictably.\nDespite these small discrepancies, both Gradient Boosting and XGBoost remain strong contenders and can be considered reliable tools for forecasting bed occupancy.\nOur study addresses the research gap in forecasting bed occupancy in mental health hospitals using machine learning models, a critical yet underexplored area compared to general hospitals.",
      "url": "https://www.nature.com/articles/s41598-025-86418-9",
      "imgURL": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-025-86418-9/MediaObjects/41598_2025_86418_Fig1_HTML.png"
    },
    {
      "news_number": 13,
      "title": "Harvard T.H. Chan School of Public Health",
      "summary": "Yet Indian government and public health officials agree that the country also faces persistent and daunting public health challenges, particularly for the poor.\nThere are disparities in health and health care systems between poorer and richer states and underfunded health care systems that in many cases are inefficiently run and underregulated.\nPublic and private health systems are placing huge demands on the country’s capacity to train exceptional health leaders and professionals.\nChan School of Public Health is collaborating with partners across India to address those challenges.\nWe seek to leverage the School’s resources to help strengthen public health training and build capacity across the health sector in India.",
      "url": "https://hsph.harvard.edu/research/india-center/improving-health-in-india/",
      "imgURL": "https://hsph.harvard.edu/wp-content/uploads/2024/12/Social-Share@2x-1024x538.png"
    },
    {
      "news_number": 14,
      "title": "A green signal for India to assert its health leadership",
      "summary": "The Union Budget 2025-26 lays a robust foundation for India to assert its leadership in global health care and innovation, with strategic announcements that bolster medical infrastructure, expand educational opportunities, and promote global collaboration.\nIt has been a delight to see both these ideas in action through the ‘Heal in India’ and ‘Heal by India’ initiatives.\nThe emphasis on Artificial Intelligence and digital health marks a pivotal moment for the future of India’s health care.\nBuild on the momentumThis Budget clearly recognises the government’s vision for — and demonstration of bold leadership in recognising — health care as a pillar of national growth and development.\nThrough the synergy of Heal in India, Heal by India, and innovation-driven care, we are shaping a future where India’s health-care system sets new global benchmarks.",
      "url": "https://www.thehindu.com/opinion/op-ed/a-green-signal-for-india-to-assert-its-health-leadership/article69184667.ece",
      "imgURL": "https://th-i.thgim.com/public/opinion/op-ed/ik881q/article69184793.ece/alternates/LANDSCAPE_1200/iStock-1950104221.jpg"
    },
    {
      "news_number": 15,
      "title": "Myths vs. facts: Cervical cancer and sexual health awareness",
      "summary": "Myth: Cervical cancer is hereditaryMyth : HPV infection means cervical cancerMyth : HPV in not commonMyth : HPV infection can be treated with medicinesMyth : Cervical cancer always has symptomsMyth : Pap smears are painfulMyth : Cervical cancer can happen only to those who have multiple sexual partnersMyth : Pap smears must be done every yearMyth :HPV infection is unavoidableDr. Neha Abhijit Pawar, Consultant, Gynaecology, Kokilaben Dhirubhai Ambani Hospital, MumbaiCervical cancer is a type of cancer that develops in the cervix, the lower part of the uterus.\nMaintaining a healthy lifestyle and practicing safe sex can also help prevent cervical cancer.\nPapilloma Virus (HPV) many years after being exposed.HPV infection by no means is the same as cervical cancer.\nOnce contracted, the virus can remain latent for many years and eventually cause cancer cervix.\nYou can however, an immunity prior to exposure by taking the HPV Vaccine .In its early stages, cervical cancer may not cause any symptoms.",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/myths-vs-facts-cervical-cancer-and-sexual-health-awareness/articleshow/118013884.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118013849,width-1070,height-580,imgsize-987414,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 16,
      "title": "Impact of pandemic-related worries on mental health in India from 2020 to 2022",
      "summary": "Regarding mental health outcomes, the weighted proportions of respondents experiencing feelings of depression and anxiety were 8% and 6%, respectively, in both periods.\nAssociations between worry variables and mental health outcomesTable 2 displays the odds ratios for worry variables (considered as exposures) obtained from weighted logistic regression analyses.\nIndividuals reporting food insecurity had higher adjusted odds for depression (odds ratio: 1.45, 95% CI: [1.38, 1.53]) and anxiety (odds ratio: 1.56, 95% CI: [1.47, 1.66]) compared to those without this concern.\nSimilarly, the adjusted odds ratios regarding COVID-19-related illness worries were 1.65 (95% CI: [1.59, 1.71]) for depression and 1.81 (95% CI: [1.73, 1.90]) for anxiety.\nSpecifically, in terms of concerns about financial status, the odds ratios for feeling depressed and anxious were 2.03 (95% CI: [1.88, 2.19]) and 1.74 (95% CI: [1.58, 1.91]) for females, respectively, lower than the corresponding odds ratios for males, which were 2.59 (95% CI: [2.49, 2.70]) and 2.02 (95% CI: [1.92, 2.12]).",
      "url": "https://www.nature.com/articles/s44184-024-00101-x",
      "imgURL": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs44184-024-00101-x/MediaObjects/44184_2024_101_Fig1_HTML.png"
    },
    {
      "news_number": 17,
      "title": "India has robust system to tackle pandemics: Health Minister",
      "summary": "Budget with ET Tax calculator(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelIndia has a very robust system to deal with future pandemics and public health emergencies , Union Health and Family Welfare Minister JP Nadda asserted in the Rajya Sabha on Tuesday.\n\"We have got the RRT, which is called the rapid response team, which is there in the states.\nAnd also, we have got an integrated health information platform where advanced data with analysis and analytical data and data modelling tools are there,\" the minister said.\n\"We give real-time reporting for all the emerging pandemics or the there are chances of having any pandemic.\n\"The Indian Council for Medical Research (ICMR) has 150 labs, he said, adding that there are viral research diagnostic laboratories.",
      "url": "https://m.economictimes.com/news/india/india-has-robust-system-to-tackle-pandemics-health-minister/articleshow/117910751.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-117910827,width-1200,height-630,imgsize-29856,overlay-economictimes/articleshow.jpg"
    },
    {
      "news_number": 18,
      "title": "Boehringer Ingelheim India Partners with EMRI Green Health Services Transforming Pre-Hospital Stroke Care in India",
      "summary": "Recognizing this challenge, Boehringer Ingelheim India has entered into a strategic partnership with EMRI Green Health Services, a GVK enterprise that operates the Government-funded 108 National Emergency Ambulance Service, to enhance pre-hospital stroke care across the country.\nA Game-Changing CollaborationThe Memorandum of Understanding (MoU) between Boehringer Ingelheim India and Hyderabad-based EMRI Green Health Services marks a significant step toward improving stroke management in India.\nThe initiative aims to standardize emergency response protocols, accelerate diagnosis, and provide specialized training to emergency medical teams.\nUnder this agreement, Boehringer Ingelheim India will leverage its globally recognized Angels Initiative to provide expert training for EMRI Green Health trainers and call center personnel.\nLeaders’ Perspectives on the InitiativeSpeaking on the collaboration, Dr. Shraddha Bhure, Medical Director of Boehringer Ingelheim India, emphasized the importance of timely intervention: “This partnership underscores our commitment to improving access to timely stroke care.",
      "url": "https://ehealth.eletsonline.com/2025/02/boehringer-ingelheim-india-partners-with-emri-green-health-services-transforming-pre-hospital-stroke-care-in-india/",
      "imgURL": "https://ehealth.eletsonline.com/wp-content/uploads/2025/02/Boehringer-Ingelheim-India-EMRI-Green-Health-Services.jpg"
    },
    {
      "news_number": 19,
      "title": "Samsung Introduces Personal Health Records Feature on Samsung Health App in India",
      "summary": "The Health Records feature enables users to create and access their Ayushman Bharat Health Account (ABHA) directly through the Samsung Health Mobile App.\nUsers can now effortlessly manage their health data generated by healthcare providers across India, transforming the way individuals take charge of their personal health records.\nThe introduction of the Health Records feature for India within the Samsung Health app signifies our dedication to provide convenient access to Digital Health records, enabling data sharing with doctors or caretakers in a secure manner anytime.\nSamsung Health app offers comprehensive health services including medication management, sleep monitoring, mindfulness programs, and irregular heartbeat notifications.\nIndian users can experience the new Health Records feature via Samsung Health’s latest app updates on Samsung Galaxy store and Google play store.",
      "url": "https://news.samsung.com/in/samsung-introduces-personal-health-records-feature-on-samsung-health-app-in-india",
      "imgURL": "https://img.global.news.samsung.com/in/wp-content/uploads/2025/01/uUntitled.jpg"
    },
    {
      "news_number": 20,
      "title": "Supporting India’s digital health transformation",
      "summary": "An important element of the ABDM mission is the Ayushman Bharat Health Account (ABHA) universal health account, which aims to bring the advantages of India’s digital healthcare ecosystem to people across the country.\nThe associated health ID enables its holders to store their health-related information, like lab reports or prescriptions, and easily share and receive it with participating healthcare groups across the country.\nThrough a partnership with Eka Care, an authorized issuer of the digital health IDs, we will be making the ABHA ID cards available on Google Wallet starting next year.\nThis will enable the more than 600 million ABHA ID holders to access their cards readily and easily on their smartphones.\nTo ensure the privacy of sensitive health information, people will be required to authenticate their device with a fingerprint, PIN or passcode in order to add or access their ABHA health ID in Google Wallet.",
      "url": "https://blog.google/around-the-globe/google-asia/google-india-digital-health-initiatives/",
      "imgURL": "https://storage.googleapis.com/gweb-uniblog-publish-prod/images/G4I_SocialShare.width-1300.png"
    },
    {
      "news_number": 21,
      "title": "India commits US$ 85 million to WHO Global Traditional Medicine Centre",
      "summary": "At a signing ceremony in Geneva, the Government of India committed US$ 85 million over 10 years, 2022–2032, to support the programming of the WHO Global Traditional Medicine Centre.\nIndia’s 10-year financial contribution will support a cross-sectoral program of work to strengthen the evidence base for traditional medicine by providing data and evidence on traditional medicine policies, practice, products, and public use.\nThe WHO Global Traditional Medicine Centre is is a knowledge hub focusing on five inter-connected areas of work: research and evidence; primary health care and universal health coverage; Indigenous Knowledges and biodiversity; digital health applications; and the biennial WHO Global Traditional Medicine Summit and collaborations.\nThe first WHO traditional medicine global summit was held in August 2023 in Gujarat, resulting in the a multistakeholder action agenda, the Gujarat Declaration.\nThe Centre and TCI collaborate closely with teams across WHO to advance WHO’s multisectoral agenda on traditional medicine, including through regular meetings of the WHO Technical Expert Network, coordinated by the WHO Global Traditional Medicine Centre and TCI, to promote a One WHO approach on traditional medicine across headquarters, regional and country office.",
      "url": "https://www.who.int/news/item/31-07-2024-india-commits-usd-85-million-to-who-global-traditional-medicine-centre",
      "imgURL": "https://www.who.int/favicon.ico"
    },
    {
      "news_number": 22,
      "title": "Alex Bregman's wife, Reagan Bregman, focuses on health and family, but Alex is missing from the picture",
      "summary": "While Alex Bregman continues to stay in the news for trade rumours, his pregnant wife, Reagan Bregman , is busy inculcating healthy habits to make sure her health is taken care of while she prepares to give birth.But what might raise eyebrows is the fact that the star player, Alex Bregman, has been missing from her Instagram stories for the last few days.Recently, Alex Bregman’s wife, Reagan Bregman, took to her Instagram story to share that she has been keeping herself busy by eating healthy foods, attending a course at Harvard Business School Online and spending her time with her son.\nHighly recommend.”A few hours later, she uploaded a picture of their son eating fruits by the poolside and added the caption, \"could not be a prettier day ☀️.” But there has been no presence of Alex Bregman in his wife, Reagan Bregman’s Instagram stories.\nHowever, it is possible that the couple are being private since Alex Bregman has been slammed by fans and experts for turning down Houston Astros’ $156 million offer.Alex Bregman’s last post on Instagram about his wife was when he wished her on her birthday back on 8th December.\nAlex’s wife, Reagan Bregman, also uploaded a sweet family portrait on 15th December and added the caption, “virtual Christmas card 💌🎄”The last post made by Alex Bregman’s wife, Reagan Bregman, was a picture of her cradling her baby bump with a caption that read as, “we can’t wait to meet you little man 🧺🧸🫶🏼🥹”Alex Bregman has constantly been in the news since the time he rejected his former team, the Houston Astros’ offer for $156 million.\nCurrently, there are strong rumours of Alex Bregman going back to his former team, but there has not been any confirmations of it yet.With Spring Training being just a few days away, Alex Bregman is yet to join any team.Also Read: Aaron Judge welcomes baby girl, sparking wild fan reactions and bizarre predictions",
      "url": "https://timesofindia.indiatimes.com/sports/mlb/news/alex-bregmans-wife-reagan-bregman-focuses-on-health-and-family-but-alex-is-missing-from-the-picture/articleshow/117988121.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117989650,width-1070,height-580,imgsize-183086,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 23,
      "title": "Argentina to quit world health organisation: Presidency",
      "summary": "World health organisation (Image credits: AP)BUENOS AIRES : Argentina will pull out of the world health organisation , President Javier Milei 's office said Wednesday, following in the footsteps of the United States which announced its exit from the UN agency last month.Milei's decision was based on \"deep differences regarding health management especially during the (Covid-19) pandemic,\" spokesman Manuel Adorni told reporters, adding Argentina would not \"allow an international body to interfere in our sovereignty.\n\"The measure also gave Argentina \"greater flexibility to implement policies adapted to the context\" locally, while ensuring \"greater availability of resources,\" he said.Self-declared \"anarcho-capitalist\" Milei is an avowed fan of US President Donald Trump, who signed an order within hours of his January 20 inauguration for the United States to withdraw from the Who, which he has also criticized for its handling of the pandemic.Washington was the biggest contributor to the Geneva-based organisation, which Trump claimed had \"ripped us off,\" and the US withdrawal could leave global health initiatives short of funding.Since taking office in December 2023, Milei has gutted public spending, having vowed to maintain a zero budget deficit after years of overspending.His austerity measures are estimated to have tipped millions more people into poverty, but the country also recorded its biggest-ever trade surplus in 2024 partly due to an import and spending slump.Milei was the first foreign leader to visit Trump at his Mar-a-Lago Florida estate after the republican's November US election victory.",
      "url": "https://timesofindia.indiatimes.com/world/rest-of-world/argentina-to-quit-world-health-organisation-presidency/articleshow/117955647.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117955794,width-1070,height-580,imgsize-1434274,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 24,
      "title": "USAID closure: Experts warn of setbacks for health, climate, development programmes in India",
      "summary": "The closure of the United States Agency for International Development (USAID) is likely to have far-reaching consequences for India, with experts warning key programmes in health, water, sanitation, and hygiene (WASH), and climate resilience could suffer major setbacks.\n\"They have been on the frontier working on TB, maternal health and WASH.\nUSAID has been a crucial partner in addressing India's development challenges, leveraging local financial and human resources to drive large-scale projects.\nIts maternal and child health programmes across six states have helped 2.8 million pregnant women and 2.6 million newborns access better medical care.\nBeyond India's domestic challenges, USAID has played a strategic role in fostering regional stability by promoting trade and investment, particularly with Afghanistan.",
      "url": "https://www.thehindu.com/news/national/usaid-closure-experts-warn-of-setbacks-for-health-climate-development-programmes-in-india/article69179376.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/nuwou5/article69179419.ece/alternates/LANDSCAPE_1200/IMG_The_USAID_building_s_2_1_IUDUO0S6.jpg"
    },
    {
      "news_number": 25,
      "title": "FOX reporter Erin Andrews revealed that she is currently dealing with a serious health condition prior to the Super Bowl LIX",
      "summary": "Image via Getty ImagesPoll How Do You Feel About Erin Andrews Continuing to Work as a Sideline Reporter Despite Her Health Condition?\nShe will also call the game because Andrews, a well-known journalist, has a health condition she disclosed in public on game days.\nAndrews is one of 38 million people affected by dry eye disease .\nFOX reporter Erin Andrews has chronicled the ongoing issues in great detail, up to what happens on the teams' benches.\nIt turns out I'm an idiot and my doctor said, 'No, it's dry eye,'\" Andrews said in the interview.Erin Andrews has discovered a prescription eye drop to alleviate her dry eye condition, which she plans to share with the audience.",
      "url": "https://timesofindia.indiatimes.com/sports/nfl/news/fox-reporter-erin-andrews-revealed-that-she-is-currently-dealing-with-a-serious-health-condition-prior-to-the-super-bowl-lix/articleshow/117872475.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117872472,width-1070,height-580,imgsize-86904,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 26,
      "title": "Chikungunya in India - Level 2 - Level 2 - Practice Enhanced Precautions - Travel Health Notices",
      "summary": "Chikungunya disease is caused by the chikungunya virus and is spread to humans through mosquito bites.\nMost people infected with chikungunya virus develop some symptoms.\nSymptoms of chikungunya usually begin 3–7 days after a bite by an infected mosquito.\nOther symptoms may include headache, muscle pain, joint swelling, or rash.\nMost people get better within a week; however, some can have severe joint pain for months to years following acute illness.",
      "url": "https://wwwnc.cdc.gov/travel/notices/level2/chikungunya-telangana-india",
      "imgURL": "https://wwwnc.cdc.gov/travel/images/chikungunya-india.png"
    },
    {
      "news_number": 27,
      "title": "CDC in India",
      "summary": "CDC India works closely with the Ministry of Health and Family Welfare and partner organizations to detect, prevent and control infectious disease outbreaks and build and strengthen the country's core public health capabilities .\nImproving public health systemsCDC supports global health security priorities in India by providing technical expertise in strengthening public health systems to prevent, detect, and respond to emerging infectious diseases.\nTo help achieve this goal, CDC supported the establishment of an advanced FETP, India Epidemic Intelligence Service (India EIS) in 2012.\nSince 2012, India FETP officers investigated over 550 outbreaks and conducted over 300 surveillance evaluations.\nSupported India FETP in launching two new initiatives to support FETP faculty development – an India EIS faculty cohort and a two-year public health workforce fellowship.",
      "url": "https://www.cdc.gov/global-health/countries/india.html",
      "imgURL": "https://www.cdc.gov/global-health/media/images/flag_india.png?_=37677"
    },
    {
      "news_number": 28,
      "title": "Opportunities and Challenges in Health Financing in India",
      "summary": "DOWNLOADS Download Working PaperExecutive SummaryThis paper analyses the landscape of demand-side health financing in India, focusing on its progress, challenges, and potential pathways towards achieving Universal Health Coverage (UHC).\nCurrent Landscape of Health Insurance in IndiaGovernment of India’s strategy to address its citizen’s health rests on two main pillars: strengthening primary care through Health and Wellness Centres (HWCs) and expanding health insurance coverage through the Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (AB-PMJAY) for secondary and tertiary care.\nThe Indian health insurance system is fragmented, with numerous schemes operating under different governance structures and offering varying benefits.\nSocial Health Insurance (SHI) schemes cover occupation groups, managed by separate ministries (health, labour, railways, defence), with different networks of providers.\nCommercial health insurance caters to a small segment of the population who can afford premiums, characterised by high costs, market failures (like risk selection), and limited regulation.",
      "url": "https://csep.org/working-paper/opportunities-and-challenges-in-health-financing-in-india/",
      "imgURL": "https://i0.wp.com/csep.org/wp-content/uploads/2025/02/AdobeStock_988572648-1.jpg?fit=1400%2C800&ssl=1"
    },
    {
      "news_number": 29,
      "title": "‘Climate doctors created to deal with public health crisis’",
      "summary": "\"Climate change is becoming climate energising, making weather unpredictable, causing temperatures to increase, and shifting disease patterns, he said.\nThe impact of climate change is higher in hot regions compared to colder climates.\nThe first 20% already know climate change is impacting health and needs work.\n\"Climate change is becoming climate energising, making weather unpredictable, causing temperatures to increase, and shifting disease patterns, he said.\nThe impact of climate change is higher in hot regions compared to colder climates.",
      "url": "https://timesofindia.indiatimes.com/city/chennai/climate-doctors-created-to-deal-with-public-health-crisis/articleshow/117992667.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117517394,width-1070,height-580,imgsize-235489,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 30,
      "title": "Health officials confirm bacteria C. jejuni caused Pune Guillain-Barré Syndrome surge, say it was in water, not food",
      "summary": "\"The waterborne transmission of C. jejuni, the official said, likely occurred due to the way water is supplied to most households in affected areas.\n(See map)\"Wells in these affected areas receive untreated water from Khadakwasla dam, which is then supplied directly to the community.\nScientists from NIV are also investigating if C. jejuni samples from Pune have mutations that could increase impact on human health.\n\"Municipal authorities have been directed to intensify water quality checks and increase manpower for inspections in affected zones.\nA survey of past GBS cases in Pune and Pimpri Chinchwad, over the last two years, has also been initiated to assess long-term trends,\" the health department official said.",
      "url": "https://timesofindia.indiatimes.com/city/pune/health-officials-confirm-bacteria-c-jejuni-caused-pune-guillain-barr-syndrome-surge-say-it-was-in-water-not-food/articleshow/117927066.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117927061,width-1070,height-580,imgsize-106296,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 31,
      "title": "Winston Churchill in an obesity ad? Ministry of Health’s post sparks hilarious debate",
      "summary": "Credit: X/@MoHFW_INDIAThe larger than life image of ChurchillCredit: X/@OutlawsPoeticThe history between India and ChurchillCredit: X/@yoemsriPublic health campaigns are meant to inform, but sometimes, they spark unexpected debates.\nOn February 4, India’s Ministry of Health posted an anti-obesity ad on X, featuring a silhouette of an overweight figure covered in warnings about related health risks.\nWhile the message seemed clear, some users noticed something unusual—the outline looked strikingly similar to Winston Churchill .\nChoose health today for a better tomorrow.”However, one user reposted the original post and captioned it: “India hates Churchill so much that its Ministry of Health uses his silhouette as a stand-in for an obese person”.\nAs the post gained traction, social media users were quick to react, flooding the comment section with a mix of humor, outrage, and speculation.",
      "url": "https://timesofindia.indiatimes.com/etimes/trending/winston-churchill-in-an-obesity-ad-ministry-of-healths-post-sparks-hilarious-debate/articleshow/117956626.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117956683,width-1070,height-580,imgsize-23978,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 32,
      "title": "Elimination of trachoma as a public health problem in India",
      "summary": "The World Health Organization has validated India as having eliminated trachoma as a public health problem.\nTrachoma continues to be a public health problem in 39 countries and is responsible for the blindness of about 1.9 million people.\n“Congratulations to India on achieving certification for trachoma elimination as a public health problem!\nTo eliminate trachoma, WHO recommends the SAFE strategy [1] to achieve elimination of trachoma as a public health problem.\nGlobally, India joins 19 other countries that have been validated by WHO for having eliminated trachoma as a public health problem.",
      "url": "https://www.who.int/news/item/08-10-2024-elimination-of-trachoma-as-a-public-health-problem-in-india",
      "imgURL": "https://www.who.int/images/default-source/departments/ntd-library/trachoma/filed-work-india/kandanu-mahto-being-examined-by-doctor-after-bandages-are-taken-off-india-vision.tmb-1200v.png?Culture=en&sfvrsn=f2820312_1"
    },
    {
      "news_number": 33,
      "title": "India economic outlook, January 2025",
      "summary": "Strong services sector growth: Services grew by 7.2%, driven by public administration and defense (9.1%) and finance, insurance, and real estate (7.2%).\nBetween April and October 2024, total services exports stood at US$216 billion, compared to US$192 billion in 2023.\nServices grew by 7.2%, driven by public administration and defense (9.1%) and finance, insurance, and real estate (7.2%).\nBetween April and October 2024, total services exports stood at US$216 billion, compared to US$192 billion in 2023.\nHigh-value manufacturing exports: Exports of electronics, engineering goods, and chemicals have grown significantly, now comprising 31% of total merchandise exports.",
      "url": "https://www2.deloitte.com/us/en/insights/economy/asia-pacific/india-economic-outlook.html",
      "imgURL": "https://assets.deloitte.com/is/image/deloitte/IN188021_Social:1200-x-627"
    },
    {
      "news_number": 34,
      "title": "Black Grapes Benefits: 5 impressive health benefits of black grapes",
      "summary": "Fiber is a type of carbohydrate that gives meals and snacks more substance and prolongs feelings of fullness.Grapes may be particularly beneficial to heart health because of their flavonoids.\nAccording to a review on the impact of berries, including grapes, on cardiovascular health.\nBlack grapes take care of our platelets, cholesterol, oxidative stress (an imbalance between antioxidants and free radicals), blood vessel (vascular) health, lipids in the blood, and blood pressure.\nThese substances might help fight oxidative stress, which has been linked to an increased risk of cancer.\nCell damage brought on by an imbalance between antioxidants and free radicals, or unstable atoms, is known as oxidative stress.",
      "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/5-impressive-health-benefits-of-black-grapes/articleshow/118034272.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118034283,width-1070,height-580,imgsize-1730504,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 35,
      "title": "Pharma's Influence on India's Global Health Engagement",
      "summary": "As India continues to engage in global health power politics, this contradiction may shape India's strategy—and the resulting balance of power.\nThus grew India's image as a champion of LMIC interests, linking India's political capital in the global health ecosystem to the work of the pharmaceutical sector.\nVasudhaiva Kutumbakham and India's Global Health EngagementBringing this positionality into its international advocacy, India has carved out a \"middle ground\" for itself in global health.\nDeploying IP flexibilities would be \"counterproductive\" to India's international diplomatic effortsYet, the evolution in India's pharmaceutical sector has influenced the country's modern engagement on these issues; at the same time, notable instances of India's equity-oriented IP rhetoric persist.\nRebecca Katz is a professor and director of the Center for Global Health Science and Security at Georgetown University.",
      "url": "https://www.thinkglobalhealth.org/article/pharmas-influence-indias-global-health-engagement",
      "imgURL": "https://www.thinkglobalhealth.org/sites/default/files/styles/og_image_landscape/public/2024-11/2024-11-07T132501Z_888399210_RC2C0BAJUXA9_RTRMADP_3_LUPIN-RESULTS.JPG?itok=2nGB7bep"
    },
    {
      "news_number": 36,
      "title": "Mapping every square kilometer of air pollution in India",
      "summary": "Harvard Public Health: Your research expands understanding of pollution in India.\nUsually that is done through air pollution monitors on the ground.\nSo we make air pollution estimates from a statistical model that is calibrated against the ground monitoring observations.\nHPH: As someone who studies air pollution, how do you feel each year when the smog emergency occurs?\nMost people are not aware that air pollution causes long-term damage to the heart or its arteries.",
      "url": "https://harvardpublichealth.org/environmental-health/researchers-map-the-health-consequences-of-india-air-pollution/",
      "imgURL": "https://harvardpublichealth.org/wp-content/uploads/2024/12/HarvardPublicHealth_India-air-pollution_hrz.jpg"
    },
    {
      "news_number": 37,
      "title": "What is micro-retiring, and why is Gen Z choosing it for mental health?",
      "summary": "Is micro-retirement good for mental health?\nWhy mental health needs more attention today?\nThis generation of workforce is choosing to prioritize their mental health over everything else and even quitting their job - while trying not to compromise on their sanity.\nThat's not really truly prioritizing your mental health or well-being.\nI would say your mental health is probably affected most if you run out of money.”",
      "url": "https://timesofindia.indiatimes.com/life-style/relationships/work/what-is-micro-retiring-and-why-is-gen-z-choosing-it-for-mental-health/articleshow/117840597.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117840553,width-1070,height-580,imgsize-40768,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 38,
      "title": "A Global Exchange of Yusuf Hamied Researchers Aims to Elevate Public Health in India",
      "summary": "For 24 scholars, the Yusuf Hamied Fellowship Program has been that alchemy.\nThe heart, soul, and funder of the program is scientist, industrialist, and philanthropist Dr. Yusuf Hamied, who is himself a game-changer in the field of global public health.\n“Academics like to talk about theory, but I’m a scientist and what I’m interested in is implementation,” says Yusuf Hamied.\nOne reason that extra push is so necessary is that in India, certain areas of public health are still evolving.\n“Public health isn’t just about medicine,” says Yusuf Hamied.",
      "url": "https://www.publichealth.columbia.edu/news/global-exchange-yusuf-hamied-researchers-aims-elevate-public-health-india",
      "imgURL": "https://www.publichealth.columbia.edu/sites/default/files/styles/cola_media_1280_16_9/public/media/images/teaser/2024-11/hamiedfellowship_header_1024_a6_2100x1181.jpg?itok=OnfFgjqc"
    },
    {
      "news_number": 39,
      "title": "Health Financing Progress Matrix Sub-national assessment Jammu and Kashmir, India, 2024",
      "summary": "OverviewThis report summarizes the findings of the Health Financing Progress Matrix assessment, WHO’s standardized assessment of a country’s health financing policies, for the union territory of Jammu and Kashmir, India.\nThe report highlights both strengths and weaknesses in Jammu and Kashmir’s current health financing arrangements, assessed against the desirable attributes of a health financing system, based on global evidence.\nBased on the findings, the report suggests a number of policy adjustments to drive accelerated progress towards universal health coverage (UHC) in the country.\nThe report draws attention to the limited revenue raising capacity for Jammu and Kashmir due to its recent transition to a union territory coupled with low levels of budget execution.\nThe report is intended to be used as a baseline for the future monitoring of Jammu and Kashmir progress in implementing health financing reforms.",
      "url": "https://www.who.int/publications/i/item/9789290229490",
      "imgURL": "https://cdn.who.int/media/images/default-source/health-topics/health-financing/hfpm_jammu-and-kashmir_report.tmb-1200v.png?sfvrsn=f71f4898_2"
    },
    {
      "news_number": 40,
      "title": "Tuberculosis",
      "summary": "Key factsA total of 1.25 million people died from tuberculosis (TB) in 2023 (including 161 000 people with HIV).\nTuberculosis is preventable and curable.\nOnly a small proportion of people who get infected with TB will get TB disease and symptoms.\nTB symptoms may be mild for many months, so it is easy to spread TB to others without knowing it.\nTuberculosis is particularly difficult to diagnose in children.",
      "url": "https://www.who.int/news-room/fact-sheets/detail/tuberculosis",
      "imgURL": "https://cdn.who.int/media/images/default-source/tuberculosis/boy-holding-endtb-sign-tb-tuberculosis.tmb-1200v.jpg?sfvrsn=b56bf073_14"
    },
    {
      "news_number": 41,
      "title": "WHO assists response to Guillain-Barré Syndrome in Pune",
      "summary": "WHO is supporting health authorities in India’s western state of Maharashtra to respond to suspected and confirmed cases of Guillain-Barré Syndrome (GBS) in the city of Pune.\nWorking closely with Pune Municipal Corporation and state and district authorities to trace and test suspected cases and follow up on confirmed cases, WHO medical officers are also assisting health authorities analyze epidemiology and trends.\nWHO teams are also conducting field work to validate household visits, monitoring the response conducted by central, state, district/corporation health officials, and participating in the state-, district- and corporation-level reviews.\nPune Municipal Corporation is promoting public health interventions – food and hand hygiene, and safe water — for disease management.\nIf muscle weakness persists, patients may need rehabilitation services to strengthen their muscles and restore movement.",
      "url": "https://www.who.int/india/news/feature-stories/detail/who-assists-response-to-guillain-barr--syndrome-in-pune",
      "imgURL": "https://cdn.who.int/media/images/default-source/south-east-asia-(searo)/countries/india/who-pune.tmb-1200v.jpg?sfvrsn=93186737_1"
    },
    {
      "news_number": 42,
      "title": "Trump pauses global funding for key health programme but allows HIV drug access: What is PEPFAR, how does it impact India?",
      "summary": "Other than providing ART to 20.6 million people, the programme has also provided HIV testing services to 83.8 million.\nPEPFAR funding in India comes mainly through projects such as Accelerate, Sunrise and Sunshine.\nLaunched in 2016, project Sunrise has been supporting the activities of the State AIDS Control Societies of the northeastern states.\nThey also provide technical assistance to the programme — this is where an impact might be felt if the funding is stopped,” said an official working with the country’s AIDS control programme.\nOver 25.4 lakh people in India were living with HIV, according to the latest India HIV Estimates 2023.",
      "url": "https://indianexpress.com/article/health-wellness/us-global-funding-health-programme-hiv-drug-access-pepfar-impact-india-9807137/",
      "imgURL": "https://images.indianexpress.com/2025/01/hiv-aids.png"
    },
    {
      "news_number": 43,
      "title": "July 2024: How Telemedicine is Redefining Healthcare Access",
      "summary": "These countries have significant telemedicine needs, being island nations.\nDr. Verma: Wonderful.\nWe're excited to see the global impact eSanjeevani and telemedicine can create to improve health access and outcomes.\nWe firmly believe telemedicine is a vital component of a resilient healthcare system and a necessary part of any healthcare infrastructure.\nWe share a common mission to improve healthcare access, and we are grateful for the opportunity to collaborate with you.",
      "url": "https://publichealth.jhu.edu/center-for-global-digital-health-innovation/july-2024-how-telemedicine-is-redefining-healthcare-access",
      "imgURL": "https://publichealth.jhu.edu/themes/custom/jhsph/favicon.ico"
    }
  ],
  "sports": [
    {
      "news_number": 0,
      "title": "India England Cricket",
      "summary": "Mary Louise Kistner Stone, M.D., passed away on February 6, 2025.\nDr. Kistner was born in Philadelphia, in 1952 and attended the University of PA Medical College.\nShe founded Bluefield Hematology & Oncology, Inc. in 1986 and practiced medicine in Bluefield until her retirement.",
      "url": "https://www.bdtonline.com/sports/national_sports/india-england-cricket/image_19de8e4b-a100-5a62-a985-6898a2e1363d.html",
      "imgURL": "https://bloximages.chicago2.vip.townnews.com/bdtonline.com/content/tncms/assets/v3/editorial/1/9d/19de8e4b-a100-5a62-a985-6898a2e1363d/67a85ebd5cdd9.image.jpg?crop=1166%2C612%2C0%2C581&resize=1166%2C612&order=crop%2Cresize"
    },
    {
      "news_number": 1,
      "title": "India England Cricket",
      "summary": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code",
      "url": "https://www.wvnews.com/sports/pro/india-england-cricket/image_0c935037-d838-5b71-92aa-2ca0f92563ad.html",
      "imgURL": "https://bloximages.chicago2.vip.townnews.com/wvnews.com/content/tncms/assets/v3/editorial/0/c9/0c935037-d838-5b71-92aa-2ca0f92563ad/67a86c7c8aab4.image.jpg?crop=1763%2C926%2C0%2C125&resize=1200%2C630&order=crop%2Cresize"
    },
    {
      "news_number": 2,
      "title": "\"Will not let that go\": Jazz Chisholm Jr. calls out ex-NFL star Cam Newton's 'dying sport' remark on MLB",
      "summary": "Image via: (AP Photo/Chris Szagola)Jazz Chisholm Jr.\nFires Back at Cam Newton's 'Dying Sport' Claim, Defending Baseball's FutureCam Newton's SHOCKING Take on Baseball's Future!\nCam Newton says baseball is dying & Referee gets tackled in college football game | Weekly DumbThe nerve!\nFormer NFL star Cam Newton literally throws a cat-a-mouse in the sports arena, and oh boy, has that gone awry.\nSo, to Newton's apocalyptic prediction, Chisholm Jr. fired back with a well-calibrated, half-brimstone, half-laughter message: \"Cam, I have one thing to say—am I?",
      "url": "https://timesofindia.indiatimes.com/sports/mlb/news/will-not-let-that-go-jazz-chisholm-jr-calls-out-ex-nfl-star-cam-newtons-dying-sport-remark-on-mlb/articleshow/118073947.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118073974,width-1070,height-580,imgsize-172762,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 3,
      "title": "India England Cricket",
      "summary": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code",
      "url": "https://www.idahopress.com/sports/national/india-england-cricket/image_bc855ac7-6f24-5722-807f-91e2b063c16a.html",
      "imgURL": "https://bloximages.chicago2.vip.townnews.com/idahopress.com/content/tncms/assets/v3/editorial/b/c8/bc855ac7-6f24-5722-807f-91e2b063c16a/67a865cb4365f.image.jpg?crop=1763%2C926%2C0%2C124&resize=1200%2C630&order=crop%2Cresize"
    },
    {
      "news_number": 4,
      "title": "India vs England 2nd ODI Live Cricket Score Streaming Online: Where to Watch IND vs ENG Cuttack match free?",
      "summary": "Livestreaming details of India vs England 2nd ODIWhere is India vs England 2nd ODI taking place?\nThe India vs England second ODI will take place at the Barabati Stadium, Cuttack.\nWhen is India vs England 2nd ODI taking place?\nThe India vs England second ODI will take place on February 9, Sunday in Cuttack.\nStory continues below this adWhere to watch the LIVE stream of India vs England 2nd ODI?",
      "url": "https://indianexpress.com/article/sports/cricket/india-vs-england-2nd-odi-live-cricket-score-streaming-9825366/",
      "imgURL": "https://images.indianexpress.com/2025/02/IND-ENG-23.jpg"
    },
    {
      "news_number": 5,
      "title": "Sports News Today Live Updates on February 9, 2025: VIDEO: Axar Patel drops a dolly of Phil Salt during IND vs ENG 2nd ODI, leaves Hardik Pandya visibly annoyed",
      "summary": "LIVE UPDATESSports News Today Live Updates on February 9, 2025: VIDEO: Axar Patel drops a dolly of Phil Salt during IND vs ENG 2nd ODI, leaves Hardik Pandya visibly annoyed6 min read .\nUpdated: 09 Feb 2025, 03:25 PM ISTSports News Today Live Updates on February 9, 2025: Stay up-to-date with the latest in sports, from cricket series and hockey tournaments to badminton championships and beyond.\nWe bring you highlights, player performances, and expert analysis across major sports.\nWith real-time updates on match results, league standings, and standout moments, you’ll never miss a key play or turning point.",
      "url": "https://www.livemint.com/sports/latest-sports-news-on-february-9-2025-live-updates-11739065213394.html",
      "imgURL": "https://images.livemint.com/img/2018/12/24/1600x900/breaking_news_1545650155659.jpg"
    },
    {
      "news_number": 6,
      "title": "Jos Buttler challenges England to play better for longer after India take lead in ODI series",
      "summary": "England captain Jos Buttler has called on his side to play better for longer after falling to a four-wicket defeat against India in the first of a three-match ODI series in Nagpur.\n\"We got off to a fantastic start, the two guys [Salt and Ben Duckett] were very aggressive in the power play.\nImage: Phil Salt scored 43 and Ben Duckett posted 32 for England\"This is not how we want to play.\nWe need to play better for longer, we need to execute our plans better, and when we get momentum and the opposition under pressure extend that for longer.\"\nEngland 'need to sharpen up'England's defeat came in their first ODI match since a series defeat against the West Indies in November, with Joe Root and Buttler both returning to 50-over international cricket since 2023.",
      "url": "https://www.skysports.com/cricket/news/12123/13304041/jos-buttler-challenges-england-to-play-better-for-longer-after-india-take-lead-in-odi-series",
      "imgURL": "https://e0.365dm.com/25/02/1600x900/skysports-jos-buttler-rohit-sharma_6821448.jpg?20250206161636"
    },
    {
      "news_number": 7,
      "title": "Not Rishabh Pant! Sanjay Bangar Reveals Which Star India Batter Impressed Ravi Shastri Even Before Debut",
      "summary": "Sanjay Bangar Reveals Which Star India Batter Impressed Ravi Shastri Even Before Debut (Photo credit: ICC)Former India batting coach Sanjay Bangar has revealed that when Ravi Shastri saw the first glimpse of Shubman Gill in his first nets session with the national team, he was extremely impressed and exclaimed how the Indian team had bagged a 'ready' player.\nGill didn't have a memorable debut in New Zealand, scoring just nine and seven runs in the two ODIs he played.\nHowever, Bangar, speaking to Star Sports, recounted his first-ever India nets session.\nBangar revealed that every cricketer aiming for a spot in the national team must undergo a traditional screen test, in which batters, particularly, must face throwdowns.\n\"He was so impressive in that net session which was his screen test that Ravi Shastri was left stunned and said 'Ek taiyaar player mil gaya humein (We’ve got someone ready for international cricket)'.",
      "url": "https://www.timesnownews.com/sports/cricket/not-rishabh-pant-sanjay-bangar-reveals-shubman-gill-impressed-ravi-shastri-even-before-debut-article-118081132",
      "imgURL": "https://static.tnn.in/thumb/msid-118081132,width-1280,height-720,resizemode-75/118081132.jpg"
    },
    {
      "news_number": 8,
      "title": "India vs England 2nd ODI LIVE Updates: Rohit Sharma Fumes As KL Rahul Makes Big Blunder",
      "summary": "India vs England Live updates: Here's what Rohit Sharma said at the toss\"It was a good performance in the first game.\nThe energy was very good despite not being on the field for a while.\nShreyas prides himself on that intent and attitude and not to forget the contributions of Shubman and Axar as well.\nTwo changes, Jaiswal makes way for Virat.\nKuldeep is rested so Varun makes his debut.\"",
      "url": "https://sports.ndtv.com/india-vs-england-2025/india-vs-england-2nd-odi-live-score-england-tour-of-india-2025-ind-vs-eng-live-scorecard-updates-7668934",
      "imgURL": "https://c.ndtvimg.com/2025-02/egm6p6g_rohit-sharma-x_625x300_09_February_25.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=738"
    },
    {
      "news_number": 9,
      "title": "India v England LIVE - Follow action from 2nd ODI as Root and Brook rebuild for tourists",
      "summary": "England 143-2 (Root 23, Brook 20) Overs: 26Hang on, replays show Root would have been out had India reviewed in the previous over!\nEngland 138-2 (Root 19, Brook 18) Overs: 25Axar goes up for LBW when Root misses a sweep.\nEngland 135-2 (Root 16, Brook 18) Overs: 24Excellent work from Jadeja, who bowls the first maiden of the innings to Brook.\nEngland 118-2 (Root 11, Brook 11) Overs: 20Jadeja rushes through another economical over, with just a single apiece to Root and Brook.\nTHE TWO XIsEngland Salt (wk), Duckett, Root, Brook, Buttler (c), Livingstone, Overton, Atkinson, Rashid, Wood, Mahmood.",
      "url": "https://www.tntsports.co.uk/cricket/india-v-england-2025/2025/india-v-england-live-follow-action-from-2nd-odi_sto20079099/story.shtml",
      "imgURL": "https://imgresizer.eurosport.com/unsafe/2400x1260/filters:format(jpeg)/origin-imgresizer.eurosport.com/2025/02/09/4095924-83056133-2560-1440.jpg"
    },
    {
      "news_number": 10,
      "title": "Is India vs England 2nd ODI 2025 Live Telecast Available on DD Sports, DD Free Dish and Doordarshan National TV Channels?",
      "summary": "Meanwhile, if you are searching for IND vs ENG 2nd ODI 2025 match DD sports live streaming details, scroll down below for more information.\nStar Sports is the official broadcaster of the India vs England 2025 T20 series in India but will IND vs ENG be available on DD Sports, DD National, DD Free Dish, or on Doordarshan Network?\n'Virat Kohli Is Fit and Available for Selection', Confirms Batting Coach Sitanshu Kotak Ahead of IND vs ENG 2nd ODI 2025.\nIs IND vs ENG 2nd ODI 2025 Live Telecast Available on DD National or DD Sports on DD Free Dish?\nThe IND vs ENG 2nd ODI 2025 live telecast will be available on DD Sports as well but for DD Free Dish and other DTT (Digital Terrestrial Television) users only.",
      "url": "https://www.latestly.com/sports/cricket/is-india-vs-england-2nd-odi-2025-live-telecast-available-on-dd-sports-dd-free-dish-and-doordarshan-national-tv-channels-6629506.html",
      "imgURL": "https://st1.latestly.com/wp-content/uploads/2025/02/Shreyas-Iyerleft-and-Shubman-Gill-right-784x441.jpg"
    },
    {
      "news_number": 11,
      "title": "Varun Chakravarthy becomes 2nd oldest cricketer to make ODI debut for India",
      "summary": "The Indian team handed mystery spinner Varun Chakravarthy his maiden ODI cap in the 2nd game of the three-match series.\nVarun has steadily risen in the 50-over format and was the best spinner in the recently concluded Vijay Hazare Trophy, India's premier 50-over competition.\nadvertisementIND vs ENG, 2nd ODI: UpdatesVarun's inclusion in the ODI XI is a crucial move for the Indian team as he might be fast-tracked for the Champions Trophy 2025.\nVarun was the standout bowler in the recently concluded T20I series, troubling the England batters in every single game.\nEngland were not able to figure out Varun in any of the series and lost wickets in clumps against him.",
      "url": "https://www.indiatoday.in/sports/story/varun-chakravarthy-odi-debut-cuttack-champions-trophy-india-vs-england-cricket-2677126-2025-02-09",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202502/indias-varun-chakravarthy-291436238-16x9_0.jpg?VersionId=BusEODehQNCnBjthd6dFpfn8NsPi3675"
    },
    {
      "news_number": 12,
      "title": "MotoGP and FanCode agree three-year digital streaming rights deal in India",
      "summary": "MotoGP and FanCode have agreed a three-year contract for the exclusive digital streaming rights to the series in India.\nContract:FanCode will stream every sprint and Grand Prix session liveThe platform will also offer exclusive highlights and behind-the-scenes contentContext:Since the Indian Grand Prix debuted in 2023, MotoGP has experienced a significant rise in popularity in India.\nThe first Indian Grand Prix also attracted over 100,000 spectators, although financial difficulties have seen both the 2024 and 2025 editions of the event postponed.\nThis streaming rights deal, which sees FanCode replace Viacom18, lines up with the three-year contract that was signed for the Indian Grand Prix to join the MotoGP calendar and sits alongside Eurosport India’s linear media rights agreement signed in August last year.\nComment:“We are thrilled to announce our partnership with FanCode as the exclusive digital partner for MotoGP in India,” said Alex Arroyo, head of media rights at MotoGP rights holder Dorna Sports.",
      "url": "https://www.sportspro.com/news/motogp-fancode-digital-streaming-rights-india-february-2025/",
      "imgURL": "https://www.sportspro.com/wp-content/uploads/2025/02/motogp-fancode-digital-streaming-rights-india-february-2025.jpg"
    },
    {
      "news_number": 13,
      "title": "Indian sports wrap, February 8: Aditi Ashok makes cut at Founders Cup",
      "summary": "GOLFAditi keeps going at Founders CupIndia’s Aditi Ashok ensured weekend play as she squeezed inside the cut line alongside a long list of stars at the LPGA Tour’s Founders Cup.\n- PTIShubhankar, Ahlawat miss cut in Qatar MastersShubhankar Sharma played a solid 3-under 69 in the second round but the Indian still missed the cut at the Qatar Masters by one shot here.\nIt was his third straight missed cut on the DP World Tour in 2025, though he made a cut in between on the Asian Tour.\nShe is Tied-24th, while the third Indian in the field, Tvesa Malik missed the cut with cards of 79-76.\nWith Top-60 and ties making the cut, 56 players made the cut which fell at 3-over.",
      "url": "https://sportstar.thehindu.com/other-sports/indian-sports-wrap-february-8-roundup-score-results-highlights-news/article69195463.ece",
      "imgURL": "https://ss-i.thgim.com/public/incoming/ogie8e/article69195498.ece/alternates/LANDSCAPE_1200/AP08_07_2024_000438B.jpg"
    },
    {
      "news_number": 14,
      "title": "Gateway Sport Group: Pioneering the Future of India’s Sports Business",
      "summary": "Sachin Kumar, Neil Maxwell and Alex Brown, unveiled the launch of Gateway Sport Group.\nThe initiative promises to transform the Indian sports business ecosystem by becoming a hub for innovation, thought leadership, and growth.\nA Vision for Indian SportsGateway Sport Group has ambitious goals to accelerate the development of India’s sports industry.\nThe Inaugural Indian International Sports SummitThe first major milestone for Gateway Sport Group is the Indian International Sports Summit (IISS), scheduled for March 7-8, 2025, in New Delhi.\nFor more information about Gateway Sport Group or to request an invitation to the Indian International Sports Summit, visit their official website or LinkedIn page.",
      "url": "https://ministryofsport.com/gateway-sport-group-pioneering-the-future-of-indias-sports-business/",
      "imgURL": "https://ministryofsport.com/wp-content/uploads/2025/01/gatewaysport_logo.jpeg"
    },
    {
      "news_number": 15,
      "title": "Ind vs Eng 2nd ODI Match Live Streaming: When and where to watch India vs England match live? - Sports News",
      "summary": "India vs England 2nd ODI Match Live Streaming: India will look to clinch the three-match ODI series when it faces England in the second One-Day International at the Barabati Stadium in Cuttack on Sunday.\nALSO READ India vs England Live Cricket Score, 2nd ODIIndia comes into the ODI leg of the series after a dominant 4-1 victory over England in the T20Is.\nIndia’s Winning MomentumIn the first ODI, India successfully chased down England’s total with contributions from Shubman Gill, KL Rahul, and Ravindra Jadeja.\nMatch Details: IND vs ENG 2nd ODIDate: Sunday, February 9Sunday, February 9 Venue: Barabati Stadium, CuttackBarabati Stadium, Cuttack Start Time: 1:30 PM IST1:30 PM IST Toss Timing: 1:00 PM ISTWhich TV channels will broadcast the live telecast of India vs England 2nd ODI?\nWhere to watch the live streaming of India vs England 2nd T20IThe live streaming of second ODI between India and England will be available on the Disney+ Hotstar app and website.",
      "url": "https://www.financialexpress.com/sports/ind-vs-eng-2nd-odi-match-live-streamingnbspwhen-and-where-to-watch-india-vs-england-match-live/3743923/",
      "imgURL": "https://www.financialexpress.com/wp-content/uploads/2025/02/Ind-vs-Eng-2nd-ODI-Live-Streaming-India-vs-England-Match-Live-at-Star-Sports-Disney-plus-Hotstar.png"
    },
    {
      "news_number": 16,
      "title": "‘Virat Kohli is fit and available for selection’: India batting coach Sitanshu Kotak ahead of 2nd ODI vs ENG",
      "summary": "India's Virat Kohli wears his helmet to bat in the nets during a training session ahead of the first one day international cricket match between India and England in Nagpur, India, Wednesday, Feb. 5, 2025.\n(AP Photo/Aijaz Rahi)India batting coach Sitanshu Kotak on Saturday bore good news for the Indian team and its fans as he confirmed star batter Virat Kohli was fit and available for selection for the second ODI match against England at Cuttack on Sunday.\n‘Virat Kohli is fit to play.\nHe has come for practice and is good to go,” Kotak said in the pre-match press conference ahead of the match.\n“Virat Kohli was unavailable for selection for the 1st ODI due to a sore right knee,” the BCCI had posted on the day of the match.",
      "url": "https://indianexpress.com/article/sports/cricket/virat-kohli-fit-available-selection-sitanshu-kotak-ind-vs-eng-9825114/",
      "imgURL": "https://images.indianexpress.com/2025/02/Kohli-82.jpg"
    },
    {
      "news_number": 17,
      "title": "India vs England LIVE Streaming, 2nd ODI: When And Where To Watch",
      "summary": "India vs England LIVE Telecast: India will be squaring off against England in the second ODI of the three-match series on Sunday in Cuttack.\nEngland Tour of India 2025: India vs England 1st ODI LIVE Streaming, LIVE Telecast: Check Where and How to WatchWhen will the India vs England 2nd ODI take place?\nThe India vs England 2nd ODI will be held at the Barabati Stadium, CuttackAdvertisementWhat time will the India vs England 2nd ODI start?\nAdvertisementWhere to follow the live streaming of the India vs England 2nd ODI?\nThe India vs England 2nd ODI will be live streamed on the Disney+Hotstar app and website.",
      "url": "https://sports.ndtv.com/india-vs-england-2025/india-vs-england-live-streaming-2nd-odi-when-and-where-to-watch-7668859",
      "imgURL": "https://c.ndtvimg.com/2025-02/mdm1vf6o_rohit-sharma-and-jos-buttler-bcci_625x300_09_February_25.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=738"
    },
    {
      "news_number": 18,
      "title": "India thrash South Africa to win U19 T20 World Cup",
      "summary": "India have won the first two editions of the Women's Under-19 T20 World Cup [Getty Images]ICC Women's Under-19 World Cup final, Kuala LumpurSouth Africa 82 (20 overs): Van Vorst 23 (18); Trisha 3-15, Sisodia 2-6India 84-1 (11.2 overs): Trisha 44* (33), Chalke 26* (22); Reyneke 1-14India won by nine wicketsScorecardIndia have won the Under-19 T20 World Cup after storming to a nine-wicket victory over South Africa in the final.\nHaving bowled South Africa out for 82, India needed just 11.2 overs to knock off the runs in Kuala Lumpur.\nGongadi Trisha was the standout performer for India, taking 3-15 with the ball before smashing an unbeaten 44 from 33 balls in the chase.\nSouth Africa won the toss and opted to bat first but were soon in trouble as they slipped to 20-3 in the powerplay and never recovered.\nThere were no such problems for India as Trisha quickly put them in control with a flurry of early boundaries.",
      "url": "https://sports.yahoo.com/india-thrash-south-africa-win-100449796.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/Sl0qySHTtR.C0b9Cg6e8vw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/bbc_us_articles_995/a80048b02990ad477296f5139cae3f74"
    },
    {
      "news_number": 19,
      "title": "India vs England Live Cricket Score, 2nd ODI: ENG reach 150/2 in 27 overs, Root and Brook steady the innings",
      "summary": "India vs England, IND vs ENG Live Cricket Score, 2nd ODI: England are in a strong position at 138/2 after 24.5 overs, maintaining a run rate of 5.55.\nDuckett played an aggressive knock of 65 off 56 deliveries, striking 10 boundaries before being dismissed by Ravindra Jadeja.\nCurrently, Joe Root is unbeaten on 19 off 28 balls, while Harry Brook is on 18 off 37, with one four and one six to his name.\nIndia vs England Live Cricket Scorecard, 2nd ODI: Live Coverage on IND vs ENG 2nd ODI Match Live Cricket Scorecard, Ball by Ball Live UpdatesIndia’s bowlers have tried to keep things in check, with Jadeja (5-1-15-1) and Chakravarthy (6-0-26-1) making key breakthroughs.\nMohammed Shami (4-0-30-0) and Hardik Pandya (3-0-26-0) have been expensive, while Harshit Rana (4-0-25-0) and Axar Patel (2.5-0-15-0) have maintained decent control.",
      "url": "https://www.financialexpress.com/sports/india-vs-england-live-cricket-score-2nd-odi-ind-vs-eng-match-ball-by-ball-latest-update/3743938/",
      "imgURL": "https://www.financialexpress.com/wp-content/uploads/2025/02/Ind-vs-Eng-2nd-ODI-Live-Score-India-vs-England-Live-Scorecard-2nd-ODI-1.png"
    },
    {
      "news_number": 20,
      "title": "'Wide draw thwarted Derby favourites'",
      "summary": "MUMBAI: Racing enthusiasts are still trying to figure out the reasons behind the result of last Sunday's Indian Derby .\n\"I believe most of the fancied runners were compromised by their wide draws, which significantly impacted their chances,\" observed Chauhan.\n\"At Mahalaxmi, the first turn comes up quickly, and those drawn wide had to cover at least an extra 100 meters to get in position.\n\"Billy Lee (the jockey) burned up his mount's chances by going to the front too aggressively,\" he noted.\nWide draws and race-day dynamics will always play their part, but champions are forged in adversity.",
      "url": "https://timesofindia.indiatimes.com/sports/more-sports/others/wide-draw-thwarted-derby-favourites/articleshow/117968147.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117968127,width-1070,height-580,imgsize-66448,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 21,
      "title": "Indian cycling stars: India’s own Beckham, Ronaldo, and Rivaldo shine, not in football but in cycling & water sports",
      "summary": "DEHRADUN: The 38th National Games in Uttarakhand are buzzing with excitement as names like David Beckham, Ronaldo, and Rivaldo make headlines.\nThese are India's own rising stars in cycling and water sports.Two of them, David Beckham, 21, from Andaman & Nicobar Islands, and Ronaldo Singh, 22, from Manipur, are promising names in Indian cycling, while Ronaldo's 20-year-old brother, Rivaldo, is a young member of Manipur's freestyle swimming and water polo team.\nAfter two years, when my brother was born, he named him after another Brazilian superstar, Rivaldo.\nHis whole family has been a big fan of the sports club Manchester United and the English football superstar, David Beckham, who was once part of the team.\nHe already won a gold on Monday and hopes to get more podium finishes in the events in the coming days.\"",
      "url": "https://timesofindia.indiatimes.com/city/dehradun/indias-own-beckham-ronaldo-and-rivaldo-shine-not-in-football-but-in-cycling-water-sports/articleshow/117958045.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117980055,width-1070,height-580,imgsize-1309531,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 22,
      "title": "National Games 2025: Yogasana, mallakhamb elevated to medal sports status",
      "summary": "Yogasana and mallakhamb have been granted full-fledged medal sports status at the National Games 2025, which is currently underway in Uttarakhand.\nThe Indian Olympic Association (IOA) had originally designated the two as demonstration sports back in December but both have been elevated at the request of the event organisers.\nOn Wednesday, the organisers issued a release which added yogasana and mallakhamb to the list of medal sports at the 38th National Games.\nThe addition of the two takes the number of medal sports to 34 now.",
      "url": "https://www.olympics.com/en/news/national-games-2025-mallakhamb-yogasana-medal-sports",
      "imgURL": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/pgkyz7ju6fbvttkdgwff"
    },
    {
      "news_number": 23,
      "title": "India vs England 2nd ODI: TV channel, online live stream and how to watch IND vs ENG one-day match from India",
      "summary": "MORE: India vs England ODI series: IND vs ENG head-to-head record in One-Day Internationals listedWhen is India vs England's 2nd ODI?\nThe India vs England 2nd ODI match will be played at the Barabati Stadium in Cuttack.\nWhat time does the India vs England 2nd ODI start in India?\nWhich TV channel will telecast the India vs England 2nd ODI in India?\nHow to watch the India vs England 2nd ODI live online in India?",
      "url": "https://www.sportingnews.com/in/cricket/news/india-england-2nd-odi-tv-channel-live-stream-how-watch-india/c6b6909ae8cc196c37ae600b",
      "imgURL": "https://library.sportingnews.com/styles/crop_style_16_9_desktop/s3/2025-02/GettyImages-2196699250.jpg?h=4d960371&itok=2Xm5OGY3"
    },
    {
      "news_number": 24,
      "title": "Why is India so bad at sport?",
      "summary": "Limited time offer Save 50% on Digital EditionRs1950 for your first 6 months.\nThen Rs1950 per 3 months.\nThe new FT Digital Edition: today's FT, cover to cover on any device.\nThis subscription does not include access to ft.com or the FT App.",
      "url": "https://www.ft.com/content/4d8e0119-fa6c-4bbb-aa15-56e85dd30f2d",
      "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Ff8a5780a-40ea-4206-9c82-2ec3012506b4.jpg?source=next-barrier-page"
    },
    {
      "news_number": 25,
      "title": "How Shubman Gill left Shastri stunned in his 1st net session for India, reveals Bangar",
      "summary": "Former India cricketer Sanjay Bangar recently revealed how young India batter Shubman Gill left former head coach Ravi Shastri stunned during his first-ever net session for India.\nGill earned his maiden India call-up for the New Zealand tour in 2019.\nWhile he failed to impress with his performances on the pitch, scoring just 9 and 7 in the two ODIs he played on the tour, his net session was a treat to watch, revealed Bangar.\nHowever, Gill, who was just 18 years old at that time, batted flawlessly against them, which even earned him praise from the then-head coach Ravi Shastri, who was left in awe of his talent.\nHe was so impressive in that net session which was his screen test that Ravi Shastri was left stunned and said 'ek taiyaar player mil gaya humein (We’ve got someone who’s ready for international cricket)'.",
      "url": "https://www.indiatoday.in/sports/story/cricket-shubman-gill-left-ravi-shastri-stunned-in-his-first-net-session-for-team-india-sanjay-bangar-2676934-2025-02-08",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202502/shubman-gill-15472252-16x9.jpg?VersionId=IrhZpp0c1ukIhM11_jh4FdPuNjoJFIRr"
    },
    {
      "news_number": 26,
      "title": "India’s junior athletes will no longer get cash prizes for international medals after government amends policy",
      "summary": "Junior athletes winning international medals will no longer receive cash awards from the government.\nChess players winning International Master or Grandmaster norms, too, will no longer be incentivised.\n“It can be said that the cash awards are one of the reasons athletes are lured into adopting unfair means.\nMost of them come from humble backgrounds, so it is a case of high risk, high reward for them,” said another official.\nMeanwhile, athletes winning events like the All-England Badminton Championship or the Candidates Tournament in chess will be given the same amount of cash prize as World Championship winners, given the high standard of competition there.",
      "url": "https://indianexpress.com/article/sports/sport-others/govt-ends-cash-awards-for-junior-athletes-to-curb-doping-age-fraud-9823902/",
      "imgURL": "https://images.indianexpress.com/2025/02/Doping-File_571_855.jpg"
    },
    {
      "news_number": 27,
      "title": "Real Madrid vs Atletico Madrid LaLiga Live Streaming: When and Where to Watch Madrid Derby Free Live Stream In India",
      "summary": "Real Madrid vs Atletico Madrid, LaLiga Live Streaming: When and Where to Watch Madrid Derby Free Live Stream In India.\nPhoto : APReal Madrid vs Atletico Madrid LaLiga Live: Real Madrid battles Atletico Madrid in the Madrid derby with only one point difference between the two teams.\nReal Madrid vs Atletico Madrid LaLiga match Live Streaming-When will Real Madrid vs Atletico Madrid LaLiga match take place?\nReal Madrid vs Atletico Madrid LaLiga match will be held Estadio Santiago Bernabeu, Madrid, Spain.\nWhere to watch Real Madrid vs Atletico Madrid LaLiga match live?",
      "url": "https://www.timesnownews.com/sports/football/real-madrid-vs-atletico-madrid-laliga-live-streaming-when-and-where-to-watch-madrid-derby-free-live-stream-in-india-article-118068391",
      "imgURL": "https://static.tnn.in/thumb/msid-118068489,thumbsize-52170,width-1280,height-720,resizemode-75/118068489.jpg"
    },
    {
      "news_number": 28,
      "title": "India’s sports budget 2025: A strategic investment in future success",
      "summary": "The Union Budget 2025 unveiled a substantial INR 3,794.30 crore allocation for sports, a significant INR 351.98 crore increase from the previous fiscal year.\nIt will empower NSFs to enhance athlete development programs, improve training facilities, and facilitate greater international sports participation.\nThis investment in the Ministry of Youth Affairs & Sports (MYAS) initiative underscores the government’s focus on holistic youth development through community service and character building.\nThe National Dope Testing Laboratory‘s budget rose to INR 23 crore, while the National Anti-Doping Agency‘s budget increased to INR 24.30 crore.\nThe focus on grassroots development through Khelo India and increased support for NSFs and elite athlete programs create a strong foundation for future success.",
      "url": "https://sportsmintmedia.com/indias-sports-budget-2025-a-strategic-investment-in-future-success/",
      "imgURL": "https://sportsmintmedia.com/wp-content/uploads/2025/02/Indias-sports-budget-2025_-A-strategic-investment-in-future-success-1.jpg"
    },
    {
      "news_number": 29,
      "title": "Hosting the 2036 Olympics will take Indian sports to great heights, says Bhaichung",
      "summary": "Prayagraj: Former Indian football team captain Baichung Bhutia feels that hosting the 2036 Olympics will take Indian sports to great heights.\nAddressing the gathering, Bhutia praised the Uttar Pradesh government’s efforts in promoting sports, stating, “The initiatives of Yogi ji for football are remarkable.\nHosting the 2036 Olympics will take Indian sports to great heights.” He further emphasised the need for collaborative efforts between the government and institutions like Dream Sports Foundation to enhance sports infrastructure and training.\nThroughout the day, young athletes from Uttar Pradesh, Haryana, Tamil Nadu, and other states showcased their skills in India’s ancient sports, including Mallakhamb.\nAdding to the grandeur of the event, Uttarakhand Chief Minister Pushkar Singh Dhami will be present on February 9, followed by Uttar Pradesh Chief Minister Yogi Adityanath on February 10 to encourage the athletes.",
      "url": "https://www.sentinelassam.com/sports-news/hosting-the-2036-olympics-will-take-indian-sports-to-great-heights-says-bhaichung",
      "imgURL": "https://media.assettype.com/sentinelassam-english%2F2025-02-09%2Fpcvxiu3u%2F850983041739012602202502083322475.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100"
    },
    {
      "news_number": 30,
      "title": "Hockey India League returns, franchises brace for 'exciting challenge', 'long haul'",
      "summary": "Hockey IndiaMeanwhile, like JSW, Shrachi Sports also own two teams (from Kolkata) in the Hockey India League.\nThey are prepared to wait on the returns and have confidence that the Hockey India will deliver after learning lessons from the 2013-17 period.\n\"I'm sure Hockey India knows the mistake they made last time and won't repeat them,\" said Bhupati.\nHockey India League has been preparing for this for more than a year, I think they are very confident of getting the kind of support it deserves.\"\nIndia internationals will be the big names to watch out for in the Hockey India League player auctions.",
      "url": "https://www.espn.com/field-hockey/story/_/id/43167647/hockey-india-league-returns-franchises-profit-long-term-jsw-sport-shrachi-sg-mahesh-bhupathi",
      "imgURL": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2024%2F1016%2Fr1401300_1296x729_16%2D9.jpg"
    },
    {
      "news_number": 31,
      "title": "Top sporting achievements of India in 2024",
      "summary": "Neeraj Chopra’s silver lining at Paris 2024 OlympicsWith six medals - one silver and five bronze - Indian athletes enjoyed a stellar outing at Paris 2024.\nThis was India’s first medal in wrestling at Paris 2024, sixth overall and the second successive one in the event at the Olympics.\nAman Sehrawat, interestingly, had bested Dahiya in the national wrestling trials to earn the right to represent India in the men's 57kg category at Paris 2024.\nNo other Indian men’s badminton player had managed to make the top four at the Olympics before him.\nLater in the year, 18-year-old Gukesh was crowned the 2024 world chess champion in Singapore after defeating Ding Liren in the final.",
      "url": "https://www.olympics.com/en/news/sporting-achievements-india-2024",
      "imgURL": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/hj8aqyhdamncabsw0o9c"
    },
    {
      "news_number": 32,
      "title": "Pakistan PM says beating India 'a real task' for their team in Champions Trophy",
      "summary": "Pakistan Prime Minister Shehbaz Sharif has said that beating India will be a real task for Pakistan in the upcoming ICC Champions Trophy 2025.\nThe tournament is all set to begin on February 19 and will be co-hosted by Pakistan and the UAE.\nI have full confidence that our team will continue to make the nation proud in the upcoming Champions Trophy,” he added.\nPakistan are the defending champions of the Champions Trophy, having won the last edition of the tournament by beating India in the final by a massive margin of 180 runs.\nHowever, India have dominated Pakistan ever since their Champions Trophy win, having defeated them in five out of six ODIs played since then, with one game being washed out.",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-pm-shehbaz-sharif-says-beating-india-a-real-task-for-their-team-in-champions-trophy-2676837-2025-02-08",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202502/mohammad-rizwan--rohit-sharma-afp-photo-03165168-16x9_1.jpg?VersionId=II2zKM8DPv7hMAMmXBxPUWJMTxJ4eQyI"
    },
    {
      "news_number": 33,
      "title": "How India Can Boost Sports Tourism - India Report",
      "summary": "A KPMG report suggests strategies like diversifying sports offerings, leveraging technology, and promoting local culture to enhance the tourism experience.\nThe Skift India Newsletter is your go-to platform for all news related to travel, tourism, airlines, and hospitality in India.\nThe Skift India Newsletter is your go-to platform for all news related to travel, tourism, airlines, and hospitality in India.\nA new report by KPMG – ‘Harnessing India’s Sports Tourism Potential’ – looks at the challenges India faces in capturing this potential.\nPromoting local culture and local tourism activities along with sport events can improve visitor experience and lead to longer stays.",
      "url": "https://skift.com/2024/10/15/how-india-can-boost-sports-tourism-india-report/",
      "imgURL": "https://skift.com/wp-content/uploads/2024/10/ipl-Blr-vs-LSG.jpg"
    },
    {
      "news_number": 34,
      "title": "India vs England: Nasser Hussain on visitors' batting strategy and state of white-ball form",
      "summary": "India vs England: Nasser Hussain on visitors' batting strategy and state of white-ball formNasser Hussain says England face a \"very important few months\" for their white-ball game and need to work out the tempo of their batting in the 50-over format.\nThursday's convincing Nagpur defeat came on the heels of England losing 4-1 in the T20 series that opened the India tour.\nsaid Hussain in conversation with fellow ex-England captain Michael Atherton on the podcast as they dissected the six matches played in India so far.\n\"But England white-ball cricket for quite some time now has been way off where it was under Morgan and Bayliss.\nAnd amid focus on England's ability to cope with the India bowlers' spin, Hussain argued: \"You wouldn't say they've been getting out to big spin.",
      "url": "https://www.coastfm.co.uk/news/sports/india-vs-england-nasser-hussain-on-visitors",
      "imgURL": "https://e3.365dm.com/25/02/640x380/skysports-harshit-rana-harry-brook_6820959.jpg?20250206090120"
    },
    {
      "news_number": 35,
      "title": "Major sports events in India 2025",
      "summary": "February is loaded with tennis action with the Davis Cup World Group I play-offs in New Delhi and four ATP Challenger tournaments.\nIndia will host the FIH Pro League matches following the conclusion of the Hockey India League in February.\nThe 2025 Women's ODI World Cup will be the biggest cricket tournament in India this year.\nMarquee events like the ISSF Junior World Cup, the World Boxing Cup Final and a World Athletics Continental Tour event will be held in India for the first time.\nThe Squash World Cup, World Para Athletics Championships and BWF World Junior Championships are also some of the high-profile events set to be hosted by India this year.",
      "url": "https://www.olympics.com/en/news/sports-events-india-2025-tournaments-calendar-schedule",
      "imgURL": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/h8feiksmvieignnqb4xn"
    },
    {
      "news_number": 36,
      "title": "India vs England 2nd ODI LIVE Streaming: When And Where To Watch IND vs ENG Cricket Match?",
      "summary": "India vs England 2nd ODI LIVE Streaming: When And Where To Watch IND vs ENG Match Photo : APIndia will face England in the second ODI of the three-match series at the Barabati Stadium, Cuttack at 1:30 pm IST on Sunday, February 9.\nThe barren run of captain Rohit Sharma and the selection confusion that ace batter Virat Kohli's possible return poses are the tall barriers in India's quest for a series victory over England.\nShreyas Iyer revealed after the first ODI that he played only because Kohli didn't.\nIndia vs England 2nd ODI TV Broadcast Details The second ODI between India and England can be watched on Star Sports Network.\nIndia vs England LIVE Streaming The live-streaming for the India National Cricket Team vs England Cricket Team Match will be available on the Disney+Hotstar App.",
      "url": "https://www.timesnownews.com/sports/cricket/india-vs-england-2nd-odi-live-streaming-when-and-where-to-watch-ind-vs-eng-match-article-118056501",
      "imgURL": "https://static.tnn.in/thumb/msid-118056501,width-1280,height-720,resizemode-75/118056501.jpg"
    },
    {
      "news_number": 37,
      "title": "Rohit Sharma's poor form makes team India look unsettled: Kapil Dev",
      "summary": "Legendary India all-rounder Kapil Dev has highlighted Rohit Sharma’s poor form as a major concern for India ahead of the ICC Champions Trophy 2025.\nRecently, Kapil Dev shared his thoughts on the India captain’s performance and said that the team looks unsettled due to his poor form.\nWhen the captain's form is poor, the team has problems,\" Kapil said on the Cricket Adda YouTube channel.\nRohit was instrumental in giving explosive starts to India during the ODI World Cup 2023 with his aggressive batting.\nHe would aim to play a similar role for the team in the upcoming Champions Trophy 2025 as well.",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharmas-poor-form-makes-team-india-look-unsettled-says-kapil-dev-2676873-2025-02-08",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202502/rohit-sharma-081016934-16x9_0.jpg?VersionId=dU21QSdJ1SVXJWQpyOHhtHWic_4YtuOY"
    },
    {
      "news_number": 38,
      "title": "Trump moves to restrict transgender participation in women's sports",
      "summary": "On February 5 2025, US President Donald Trump issued an executive order aimed at restricting transgender athletes from competing in women's sports.\nThe directive, titled \"Keeping Men out of Women's Sports,\" gives the government the power to withhold funding from schools that allow transgender athletes to join women's sports.",
      "url": "https://www.indiatoday.in/newsmo/video/trump-moves-to-restrict-transgender-participation-in-womens-sports-2675772-2025-02-06",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/video/202502/trump-063019363-16x9_0.jpeg?VersionId=7ElUBNgInZlXYOzmYhDusPxkJD0MaQsJ"
    },
    {
      "news_number": 39,
      "title": "Indian media fails to appreciate 'Jackpot Jango' Ravindra Jadeja: R Ashwin",
      "summary": "Former India spinner Ravichandran Ashwin praised Ravindra Jadeja ahead of the 2nd ODI vs. England.\nadvertisementSpeaking on his YouTube channel, Ashwin called Jadeja the 'Jackpot Jango,' as India had a 3-dimensional player at their disposal.\nAshwin felt that Jadeja was not praised enough by the Indian media, despite his years of contribution in all formats of the game.\nAshwin praised Jadeja and said that the all-rounder had always been under the scanner throughout his career.\nApart from his stunning bowling, Jadeja also bailed India out of a slightly tricky situation with the bat.",
      "url": "https://www.indiatoday.in/sports/story/cricket-ravindra-jadeja-r-ashwin-india-vs-england-2nd-odi-match-2676792-2025-02-08",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202502/ravindra-jadeja-064655662-16x9_1.jpg?VersionId=XI3zkZojdS0SHv_3xE0c89FtQuxjncCk"
    },
    {
      "news_number": 40,
      "title": "India cricket: Abhishek Sharma shines in T20 win over England",
      "summary": "When you are making your way as a batter in India, it helps to have a legend in your corner.\nAbhishek Sharma brutally destroyed England's bowling by striking 135 in India's crushing victory in the fifth T20.\nIt was the kind of assault his mentor Yuvraj Singh used to inflict.\nAbhishek's relationship with his fellow left-hander Yuvraj goes back to when their paths crossed while playing first-class cricket for Punjab - Yuvraj at the end of his career, Abhishek at the start.\n\"That was the special shot that Yuvraj mentioned before, so he was happy with the shots,\" said Abhishek.",
      "url": "https://www.bbc.com/sport/cricket/articles/cx2plx9g03ko",
      "imgURL": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/37cf/live/3d72dba0-e19c-11ef-bd1b-d536627785f2.png"
    },
    {
      "news_number": 41,
      "title": "Engaging Fans Digitally",
      "summary": "The rapid expansion is fuelled by rising government investment, the people’s embrace of healthier lifestyles, widespread digital adoption, and an increase in quality content for various sports.\nThe growth is also driven by sports-related consumption trends, two of which stand out for advertisers.\nFirst, consumers, whose discretionary spending is set to double by 2030,1 are more willing to spend on sports.2 Second, the majority of Indian sports fans – and as high as 71% for Gen Z – say they made a purchase based on ads they saw while consuming sports content.3These trends present opportunities for all brands, sports-related or not, to win new and existing customers in India.\nSo Google partnered with Deloitte to conduct research on Indians’ love for sports and their sports-viewing preferences, to help marketers better engage them.\nHere are two key insights on sports fans from the research, which brands can tap into to connect more deeply with audiences.",
      "url": "https://www.thinkwithgoogle.com/intl/en-apac/consumer-insights/consumer-trends/youtube-advertising-india-sports/",
      "imgURL": "https://storage.googleapis.com/twg-content/images/TwG_APAC_6239_-_From_Cricket-Crazy_to_Multi-S.width-1200_HNflsf1.png"
    },
    {
      "news_number": 42,
      "title": "Sports News Today highlights on February 4, 2025: Nagpur Police mistakes Indian support staff as fan, allows entry after journos shout ‘arey, coach hai wo’: Viral video",
      "summary": "Sports News Today highlights on February 4, 2025: Nagpur Police mistakes Indian support staff as fan, allows entry after journos shout ‘arey, coach hai wo’: Viral video8 min read .\nUpdated: 04 Feb 2025, 07:04 PM ISTSports News Today highlights on February 4, 2025: Stay up-to-date with the latest in sports, from cricket series and hockey tournaments to badminton championships and beyond.\nWe bring you highlights, player performances, and expert analysis across major sports.\nWith real-time updates on match results, league standings, and standout moments, you’ll never miss a key play or turning point.",
      "url": "https://www.livemint.com/sports/latest-sports-news-on-february-4-2025-live-updates-11738644201181.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2025/02/04/1600x900/Raghavendra_Dwivedi_1738675945212_1738675945440.jpg"
    },
    {
      "news_number": 43,
      "title": "India vs Pakistan: Bad news for Pakistan as this star cricketer ruled out of Champions Trophy 2025, his name is...",
      "summary": "Image credit: XWhen is India vs Pakistan game and details about the match ticketsCricket enthusiasts eager to experience the thrilling India vs Pakistan match live were disheartened as tickets sold out in just minutes after becoming available.\nThe much-anticipated Champions Trophy game between the two rivals will take place on February 23 at the Dubai International Cricket Stadium.",
      "url": "https://www.india.com/photos/sports/india-vs-pakistan-bad-news-for-pakistan-as-this-star-cricketer-ruled-out-of-champions-trophy-2025-his-name-is-saim-ayub-424309/",
      "imgURL": "https://st1.photogallery.ind.sh/wp-content/uploads/indiacom/India-vs-Pakistan:-Bad-news-for-Pakistan-as-this-star-cricketer-ruled-out-of-Champions-Trophy-2025,-his-name-is...-202502-1739050407.jpg"
    },
    {
      "news_number": 44,
      "title": "Indian sports wrap, February 7: Solid start for Diksha and Avani in Morocco; Shubhankar, Veer struggle",
      "summary": "Avani Prashanth, making her professional debut, also had a rough start from the 10th as she bogeyed twice in the first three holes.\nBut it did not turn out well for Tvesa Malik, who shot six-over 77 and was tied 98.\nIn other bouts of the day, Services’ Mandengbam Singh defeated Chandigarh’s Anshul Punia in the men’s flyweight (51kg) division by a 4-1 split decision.\nIt was the first victory in two matches for the Punjab team which had lost its earlier match to Chennai Heat.\nIt was the second loss in as many matches for Mumbai Titans which had lost earlier to Delhi Dribblers.",
      "url": "https://sportstar.thehindu.com/other-sports/indian-sports-wrap-february-7-roundup-score-results-highlights-news/article69191456.ece",
      "imgURL": "https://ss-i.thgim.com/public/incoming/wtajil/article69191453.ece/alternates/LANDSCAPE_1200/Diksha_Dagar_Golf_08882.jpg"
    },
    {
      "news_number": 45,
      "title": "Live Sports News - Latest Cricket, Football, Olympics & Indian Sports Updates",
      "summary": "Rachin Ravindra Rushed Off The Field Soaked In Blood After Facing Serious Head Injury – WATCHIn match against Pakistan it seemed Rachin Ravindra had lost his eye on the ball due to the lights and crashed directly into his face.\nHe fell on the ground, bleeding, and the medical team rushed to him immediately, and took him off the field.\nRead the full story here",
      "url": "https://news24online.com/sports/latest-cricket-and-other-sports-news-today-live-updates-february-9-2025/467784/",
      "imgURL": "https://news24online.com/wp-content/uploads/2024/11/Sports-Live-News-Update-N24.jpg"
    },
    {
      "news_number": 46,
      "title": "India sweat over Virat Kohli's fitness ahead of Champions Trophy",
      "summary": "Star batter misses first ODI with sore kneeGo Beyond The Boundary with our YouTube channel.\nNAGPUR: For 1,130 days, Virat Kohli had been immune to the wear and tear which sidelines even the toughest athletes.\nIt did though.It wasn't until Rohit Sharma confirmed Kohli's absence at the toss that the reality sank in - India's batting mainstay had been rested.\n\"His right knee was fine during practice, but once we got back to the hotel, it swelled up,\" a team insider told TOI.\nHe will play the Cuttack ODI in all likelihood,\" he added.The 36-year-old hasn't yet been taken for scans.",
      "url": "https://timesofindia.indiatimes.com/sports/cricket/england-tour-of-india-2025/india-sweat-over-virat-kohlis-fitness-ahead-of-champions-trophy/articleshow/117998148.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117998118,width-1070,height-580,imgsize-71010,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    }
  ],
  "finance": [
    {
      "news_number": 0,
      "title": "Finance Ministry directs officers not to use AI models like ChatGPT, DeepSeek flagging data risk concerns",
      "summary": "In a communication last month to all its departments, the ministry said AI tools/AI apps in office devices may be strictly avoided.\n“It has been determined that AI tools and AI apps (such as ChatGPT, DeepSeek etc) in the office computers and devices pose risks for confidentiality of Govt data and documents,” the directive is learnt to have said.\n“It is, therefore, advised that use of AI tools/AI apps in office devices may be strictly avoided.\nStory continues below this ad A few other countries have already acted to protect their official systems from AI tools, particularly Chinese foundational model DeepSeek, over privacy and data security concerns.\nDeepSeek’s model has shown to the world that cutting edge foundational models could be built at cheaper costs, unlike the huge investments that have gone into making OpenAI’s models.",
      "url": "https://indianexpress.com/article/india/finance-ministry-directs-officers-not-use-chatgpt-deepseek-ai-models-data-risk-9818997/",
      "imgURL": "https://images.indianexpress.com/2025/02/DEEPSEEK-1.jpg"
    },
    {
      "news_number": 1,
      "title": "India’s Economic Aspirations: A Conversation with Finance Minister Nirmala Sitharaman",
      "summary": "Nirmala Sitharaman, Union Minister of Finance and Corporate Affairs, Government of India on October 25.\nThe event with Minister Sitharaman will begin with remarks followed by a moderated session led by Dr John J. Hamre from 5-6 pm.\nMinister Sitharaman has held several of the Indian Cabinet’s most significant portfolios including Minister of Defence; Minister of State for Commerce and Industry; and Minister of State for Corporate Affairs.\nNirmala Sitharaman, Union Minister of Finance and Corporate Affairs, Government of IndiaH.E.\nNirmala Sitharaman was appointed as India’s Minister of Finance in 2019.",
      "url": "https://www.csis.org/events/indias-economic-aspirations-conversation-finance-minister-nirmala-sitharaman",
      "imgURL": "https://csis-website-prod.s3.amazonaws.com/s3fs-public/2024-10/241021_India_Econ_Banner.jpg?VersionId=IDMpOrdv.aa0vHSWvtjTosMuKhlHqDLY"
    },
    {
      "news_number": 2,
      "title": "ChatGPT, Deepseek Usage in India: India’s finance ministry asks employees to avoid AI tools for official purposes",
      "summary": "The Ministry of Finance has advised government officials to “strictly avoid” Artificial Intelligence (AI) tools, including ChatGPT and DeepSeek, on official devices as they “pose risks for confidentiality of government data and documents”.\nSam Altman, the CEO of OpenAI, which runs ChatGPT, is currently in India to meet Prime Minister Narendra Modi.\n“It has been determined that AI tools and AI Apps (such as ChatGPT, DeepSeek etc.)\nIt is, therefore, advised that use of AI tools/AI Apps in office devices may be strictly avoided.\nIt is not clear if other Ministries or Central government departments received similar orders restricting the use of AI tools.",
      "url": "https://www.thehindu.com/sci-tech/technology/indias-finance-ministry-asks-employees-to-avoid-ai-tools-like-chatgpt-deepseek/article69183180.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/th0rtx/article69183717.ece/alternates/LANDSCAPE_1200/Deepseek_China_Security_57262.jpg"
    },
    {
      "news_number": 3,
      "title": "Budget: Tax relief for Indian middle class",
      "summary": "Tax relief for Indian middle class - but will it boost economy?\nFinance minister Nirmala Sitharaman announced measures to counter slowing growth, rising prices and flagging consumption among the middle class in Asia's third-largest economy.\nThe finance minister has also announced tweaks to other income tax slabs which is likely to leave more money in the hands of the middle class.\nThe income tax concessions to the middle class \"seems aimed at addressing the slump in urban consumption\", said Nomura's India Economist Aurodeep Nandi.\nBoost for nuclear energy, insuranceThe budget has set a goal to generate 100GW of nuclear energy by 2047.",
      "url": "https://www.bbc.com/news/articles/cx25k05p1y1o",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/478b/live/b01fe450-e06a-11ef-b59b-45d387e1d31a.jpg"
    },
    {
      "news_number": 4,
      "title": "Budget boost for India’s middle class",
      "summary": "Limited time offer Save 50% on Digital EditionRs1950 for your first 6 months.\nThen Rs1950 per 3 months.\nThe new FT Digital Edition: today's FT, cover to cover on any device.\nThis subscription does not include access to ft.com or the FT App.",
      "url": "https://www.ft.com/content/5011203c-ac92-42de-aca5-70ddb4ce840e",
      "imgURL": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1ab10125-63fb-4d48-a4b6-59d504856dda.jpg?source=next-barrier-page"
    },
    {
      "news_number": 5,
      "title": "Raising the Bar: India’s Push to Increase Ambition on Climate Finance",
      "summary": "The landscape of issues reveals a deep divide between the developed and developing country Parties to the UNFCCC.\nSeveral elements of the new goal need to be resolved: quantity, structure, quality, contributors, time frame and revisions, tracking and reviewing progress, and the relationship to the Paris Agreement’s long-term goal on climate finance.\nHeading into Baku, the stated quantum of the new goal will be key to ascertaining India’s position on the negotiated outcome.\nThey call for the contributor base to be expanded to include developing countries based on responsibility, economic capability and ability to contribute.\nTherefore, India is likely to stand firm on raising the quantum of the new goal in a bid to hold developed countries more accountable for their climate finance obligations.",
      "url": "https://www.nrdc.org/bio/vyoma-jha/raising-bar-indias-push-increase-ambition-climate-finance",
      "imgURL": "https://www.nrdc.org/sites/default/files/styles/social_sharing_1200x630/public/2024-11/UNFCCC-Bonn-climate-talks.jpg?h=827069f2&itok=LLIpCdwZ"
    },
    {
      "news_number": 6,
      "title": "Sustainable Finance Flows to India’s Agriculture Sector",
      "summary": "Addressing these challenges necessitates a transition toward sustainable agriculture.\nThis report introduces a comprehensive sustainable agriculture framework developed using a value-chain approach to analyze relevant sectors, activities, policies, and key initiatives.\nAnnual financial flows to sustainable agriculture averaged INR 22,393 billion (USD 301 billion) for FY 2020-22.\nThis was characterized by a 1.1% decline from INR 22,474 billion (USD 303 billion) in FY 202021 to INR 22,312 billion (USD 299 billion) in FY 2021-22.\nDomestic sources represented 99.5% of flows (INR 22,289 billion), with international sources contributing only 0.5% (INR 105 billion).",
      "url": "https://www.climatepolicyinitiative.org/publication/sustainable-finance-flows-to-indias-agriculture-sector/",
      "imgURL": "https://www.climatepolicyinitiative.org/wp-content/uploads/2025/01/Depositphotos_172149494_XL_web.jpg"
    },
    {
      "news_number": 7,
      "title": "India cuts key interest rate for first time since 2020 amid slowing growth",
      "summary": "Reserve Bank of India announces first rate cut in nearly five years as world’s most populous nation faces slowdown.\nIndia’s central bank has cut its benchmark interest rate for the first time in nearly five years as officials try to reverse slowing economic growth in the world’s most populous country.\nThe Reserve Bank of India (RBI) said on Friday that it had lowered the repo rate, which the central bank lends to commercial banks, by 0.25 percent to 6.25 percent.\nThe RBI last cut the key interest rate in May 2020, after which it rolled out a series of hikes aimed at tamping down rising inflation in the wake of the COVID-19 pandemic.\nGrowth is expected to come in at 6.3-6.8 percent in 2024/25, below its post-pandemic trend.",
      "url": "https://www.aljazeera.com/economy/2025/2/7/india-cuts-key-interest-rate-for-first-time-since-2020-amid-slowing-growth",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2025/02/2025-01-27T115146Z_2009462870_RC2V80A0IJ92_RTRMADP_3_RESERVE-BANK-OF-INDIA-AVIOM-1738910162.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 8,
      "title": "India’s Stimulus Gets Muted Response From Investors Wanting More",
      "summary": "(Bloomberg) -- Prime Minister Narendra Modi is counting on a two-pronged stimulus of tax and interest rate cuts to turn around India’s slowing economy, but investors may need more convincing that the measures will be enough.\nYet, investor response to these steps has been muted throughout the week, illustrating the scale of the challenge facing the government.\nBonds fell following the central bank announcement, while the benchmark NSE Nifty 50 index lost 0.2%.\nEconomists said that despite its 25 basis-point cut, the central bank’s overall actions were relatively restrained.\nEconomists including Kaushik Das at Deutsche Bank AG sees just one more rate cut in this cycle, a 25 basis-point move in April.",
      "url": "https://finance.yahoo.com/news/india-ramps-stimulus-spur-faltering-143123089.html",
      "imgURL": "https://media.zenfs.com/en/bloomberg_markets_842/8c0dce085fde71f45dde05711e0c5a09"
    },
    {
      "news_number": 9,
      "title": "India's finance minister faces a tough choice crafting the annual budget — boost growth or cut deficit?",
      "summary": "They also projected the government would set a nominal GDP growth target of 10.5% for the next fiscal year.\nIndian Finance Minister Nirmala Sitharaman will present the national budget on Feb. 1, in what would be the coalition government's first full-year budget after assuming power in June.\nThe budget comes against the backdrop of a growth slowdown in the world's fifth-largest economy, weak domestic demand, a depreciating rupee and rising global uncertainties.\nFor the next fiscal year, Nomura analysts said the government might set a nominal GDP growth target of 10.3%, up from 9.7% for the current fiscal year ending March 2025.\nWhile some additional \"accommodative tax and spending measures are on the cards,\" they are likely to be \"piecemeal,\" Shah added.",
      "url": "https://www.cnbc.com/2025/01/30/india-budget-fiscal-deficit-slowing-growth-challenge.html",
      "imgURL": "https://image.cnbcfm.com/api/v1/image/108010183-1721713371628-gettyimages-2162473745-INDIA_BUDGET.jpeg?v=1721713454&w=1920&h=1080"
    },
    {
      "news_number": 10,
      "title": "Finance ministry asks employees not to use ChatGPT, DeepSeek for official work",
      "summary": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelThe finance ministry has warned its employees against the use of artificial intelligence AI ) tools and apps on office devices, citing risks to the confidentiality of government data and documents.\nThe advisory, which has been approved by the finance secretary, specifically mentions AI-powered tools such as ChatGPT and DeepSeek , stating that their use on office computers and devices poses a significant threat to data security.\n\"It has been determined that Al tools and Al apps (such as ChatGPT, DeepSeek, etc.)\nin office computers and devices pose risks for confidentiality of government data and documents,\" the advisory said.",
      "url": "https://m.economictimes.com/news/india/finance-ministry-asks-employees-not-to-use-chatgpt-deepseek-for-official-work/articleshow/117959058.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-117959115,width-1200,height-630,imgsize-21550,overlay-economictimes/articleshow.jpg"
    },
    {
      "news_number": 11,
      "title": "UPSC Ethics Simplified | Integrity in Finance: Money talks—But what does it say about ethics?",
      "summary": "UPSC Ethics Simplified draws your attention to topics related to applied ethics.\nFinancial ethics must grapple with two powerful variables—ethics itself and the dynamic nature of money, which can easily lead to greed, arrogance, and ego.\nBeyond the immediate tragedy, this incident also brings to light the question of financial ethics.\nHe teaches courses on and offers training in ethics, values and behaviour.\nHe writes for the UPSC Ethics Simplified (concepts and caselets) fortnightly.)",
      "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-ethics-simplified-integrity-finance-money-budget-economy-9826145/",
      "imgURL": "https://images.indianexpress.com/2025/02/UPSC-essentials-Nanditesh-Nilay-feature-8.jpg"
    },
    {
      "news_number": 12,
      "title": "Landscape of Green Finance in India 2024",
      "summary": "The Landscape of Green Finance in India tracks flows to real economy sectors—clean energy, clean transportation, and energy efficiency—as well as to some adaptation sectors.\nIndia continues to expand its green finance flows.\nCoordinated action to scale up green finance at a faster paceCreating market-based incentives, innovative financial products, and de-risking investments to accelerate green finance.\nAugmenting development banks’ and FIs’ important roles in mobilizing green finance through interventions that direct capital to green initiatives.\nFurthering policy and regulatory measures to mobilize green finance across all sectors, by:Developing and operationalizing a green/climate finance taxonomy.",
      "url": "https://www.climatepolicyinitiative.org/publication/landscape-of-green-finance-in-india-2024/",
      "imgURL": "https://www.climatepolicyinitiative.org/wp-content/uploads/2018/11/Depositphotos_55902045_XL-scaled.jpg"
    },
    {
      "news_number": 13,
      "title": "Sustainable Finance Flows to India’s Agriculture Sector",
      "summary": "India’s agriculture sector faces a multifaceted “Grand Challenge”: ensuring food security for a growing population, supporting rural livelihoods, and managing the adverse impacts of climate change, all while contending with limited resources, financial constraints, and the need to reduce greenhouse gas emissions.\nAddressing these challenges necessitates a transition toward sustainable agriculture.\nIn this event, CPI will launch and present the findings of the “Financial Flows to Sustainable Agriculture in India” report, which offers insights into public and private finance sources, intermediaries, and end-use activities of sustainable agriculture during the financial year (FY) 2020–21 and 2021-22.\nThis event brings together stakeholders—including policymakers, regulators, and private investors— in a collaborative effort to share the research observations with the ecosystem and find opportunities to augment finance and advance sustainable practices in the agriculture sector.\nDownload the Agenda",
      "url": "https://www.climatepolicyinitiative.org/event/financial-flows-to-sustainable-agriculture-in-india/",
      "imgURL": "https://www.climatepolicyinitiative.org/wp-content/uploads/2025/01/6.jpg"
    },
    {
      "news_number": 14,
      "title": "Home First Finance Company (India) - Awfis Space Solutions, IndusInd Bank among 10 companies that saw highest increase in mutual fund holdings in December",
      "summary": "Around 10 companies saw the highest increase in mutual fund holdings in percentage terms in December, according to a press release by Prime Database.\nHere is the list of companies:",
      "url": "https://m.economictimes.com/mf/analysis/awfis-space-solutions-indusind-bank-among-10-companies-that-saw-highest-increase-in-mutual-fund-holdings-in-december/home-first-finance-company-india/slideshow/118082731.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-118082829,width-1070,height-580,overlay-etwealthmutualfunds/slideshow.jpg"
    },
    {
      "news_number": 15,
      "title": "Fiscal, monetary steps to help boost consumption, says Finance minister Nirmala Sitharaman",
      "summary": "NEW DELHI: Finance minister Nirmala Sitharaman said Saturday that coordinated fiscal and monetary actions by govt and RBI will help boost consumption and there are initial signs of a good order book for the first quarter of the next fiscal year, which will help boost private investment.\n\"After the budget, the few inputs I have received from some business leaders is that the orders for fast-moving consumer goods for April-June are already getting booked, and the industry is clearly seeing signs of a possible recovery of consumption,\" she told reporters after addressing the RBI board.As a result, many companies are looking at reviewing their capacity utilisation, she said, adding that the triggers for a consumption-driven cycle are clearly being felt by those who have to decide on investments.\n\"We will be very, very watchful, alert and very nimble and agile in whatever are the requirements of the banking system to provide liquidity, both transient, overnight, as well as more durable liquidity,\" he said.The governor said a large part of the depreciation of the rupee was driven by global uncertainty, especially US President Donald Trump's stand, and that should be out of the way soon.\n\"Hopefully that should settle down and that should help us in the downward movement of inflation,\" he said.He also made it clear that there was no change in the policy on exchange rate and that RBI is not targeting any price band for the rupee and focusing on curbing excess volatility.\nWhile assuming the exchange rate at 87 to a dollar, Malhotra said that a 5% depreciation in the rupee resulted in a 30-35 basis point inflation in the domestic market and added that RBI had factored it into its calculations.",
      "url": "https://timesofindia.indiatimes.com/business/india-business/fiscal-monetary-steps-to-helpboost-consumption-says-finance-minister-nirmala-sitharaman/articleshow/118073941.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118073982,width-1070,height-580,imgsize-1107570,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 16,
      "title": "UK universities look to open campuses in India amid financial woes at home",
      "summary": "“The UK universities are aiming to ride the high tide of demographic bulge in India,” Srivastava said.\nBy opening branch campuses in India universities can reach an untapped domestic market that is unable to study abroad.\nMaddalaine Ansell, the British Council’s director of education, said India was “of great importance” to UK higher education for students and academic partnerships.\nThese range from joint and dual PhDs and master’s degrees to the establishment of UK university campuses,” Ansell said.\nGift City’s first UK university resident is likely to be Queen’s University Belfast (QUB), which has announced it will offer postgraduate courses there from January next year.",
      "url": "https://www.theguardian.com/education/2025/feb/07/uk-universities-open-campuses-india-financial-woes-at-home",
      "imgURL": "https://i.guim.co.uk/img/media/bfb8dcc4063958033fe70a0cb99397bd5b9dd218/0_0_2800_1680/master/2800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0a398929accd1129efc33de9c4d56366"
    },
    {
      "news_number": 17,
      "title": "India’s 2035 targets will ‘reflect the disappointment of COP29 outcome on climate finance in Baku’",
      "summary": "The sources also said that India’s NDC would likely “reflect the disappointment of the climate finance outcome at COP29 in Baku” last year.\nIndia, and other developing countries, have expressed serious disappointment with the outcome of COP29, last year’s climate conference in Baku, which delivered an extremely weak agreement on climate finance.\nThe Economic Survey presented last week also made a similar argument, and clearly hinted at a readjustment of climate targets by India.\n“The funding shortfall may lead to a reworking of the climate targets.\nStory continues below this adThe 2035 NDC has to be a progression over the 2030 targets.",
      "url": "https://indianexpress.com/article/india/the-2035-targets-disappointment-cop29-outcome-climate-finance-baku-9818200/",
      "imgURL": "https://images.indianexpress.com/2024/12/october-2024-11-25T132912.210_20241128112312_20241205192735.jpg"
    },
    {
      "news_number": 18,
      "title": "Japan finds new bright spots for investment in India",
      "summary": "Financial services, electronics, telecommunications and media sectors have emerged as compelling destinations for Japanese investments,\" Ota told ET.\n\"This diversification reflects a broader strategic shift in Japanese investment philosophy in India, moving beyond traditional manufacturing strongholds to embrace emerging technological and strategic sectors,\" Ota added.\nAs per official data, foreign direct investment (FDI) inflows from Japan into India were $43.11 billion between April 2000 and September 2024.\nWhile there has been a recent decrease in mergers and acquisition activities between India and Japan, this was due to the Covid pandemic.\nThere were 343 inbound deals from Japan to India, resulting in investments of $62.35 billion during the past decade.",
      "url": "https://m.economictimes.com/news/economy/finance/japan-finds-new-bright-spots-for-investment-in-india/articleshow/117992540.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-117992662,width-1200,height-630,imgsize-27244,overlay-economictimes/articleshow.jpg"
    },
    {
      "news_number": 19,
      "title": "Landscape of Green Finance in India: The Way Forward for Transformational Change.",
      "summary": "India will require ~INR 162.5 thousand crores (USD 2.5 trillion) from 2015 to 2030, roughly INR 11 trillion (USD 170 billion) per year, to finance its NDC goals.\nWhile climate finance is increasing, we are still significantly short of our climate finance needs.\nIn November 2021, India ratcheted its climate ambitions at the Conference of Parties 26 (COP26) and announced the target to reach 500 GW of renewable energy generation by 2030.\nIn this event, CPI will launch and present the latest findings from the “Landscape of Green Finance in India” report, which measures public and private sources of green capital in India for 2021 and 2022.\nFinance can be mobilized from public, private, and blended financing.",
      "url": "https://www.climatepolicyinitiative.org/event/landscape-of-green-finance-in-india-the-way-forward-for-transformational-change/",
      "imgURL": "https://www.climatepolicyinitiative.org/wp-content/uploads/2024/11/Landscape-Event.jpg"
    },
    {
      "news_number": 20,
      "title": "Home First Finance Engages with Investors in Recent Meet",
      "summary": "Maximize Your Portfolio with Data Driven Insights:Leverage the power of TipRanks' Smart Score, a data-driven tool to help you uncover top performing stocks and make informed investment decisions.\nMonitor your stock picks and compare them to top Wall Street Analysts' recommendations with Your Smart PortfolioHome First Finance Company India Ltd. ( (IN:HOMEFIRST) ) has shared an announcement.\nHome First Finance Company India Limited recently held a one-on-one meeting with investors and analysts to discuss its operations and financial outlook.\nMore about Home First Finance Company India Ltd.Home First Finance Company India Limited operates in the financial services industry, focusing primarily on providing housing finance solutions.\nYTD Price Performance: -2.92%Average Trading Volume: 377,306Current Market Cap: 91.14B INRSee more data about HOMEFIRST stock on TipRanks’ Stock Analysis page.",
      "url": "https://www.tipranks.com/news/company-announcements/home-first-finance-engages-with-investors-in-recent-meet",
      "imgURL": "https://blog.tipranks.com/wp-content/uploads/2023/06/shutterstock_261540053-750x406.jpg"
    },
    {
      "news_number": 21,
      "title": "India fires warning shot with rejection of finance deal at COP29",
      "summary": "“This amount is a paltry sum and not something that will enable conducive climate action,” she said of the hard-fought deal on climate finance after it was gavelled through.\nThe final deal in Baku – half of that – did not specify how much of the core public finance goal should come as grants and cheap loans.\nPai described the COP29 finance deal as “grim”.\nThe final deal only “encourages” developing countries to make contributions to the new finance goal “on a voluntary basis”.\nIndia’s Raina told the final CO29 plenary that developing countries are now being seen as contributors to finance climate action, and India was opposed to it.",
      "url": "https://www.climatechangenews.com/2024/11/25/india-fires-warning-shot-with-rejection-of-finance-deal-at-cop29/",
      "imgURL": "https://cdn.climatechangenews.com/files/2024/11/25151628/India-COP29-speech-small.jpg"
    },
    {
      "news_number": 22,
      "title": "Finance ministry issues warning to employees on ChatGPT, DeepSeek and other AI tools",
      "summary": "What the finance ministry’s advisory saysDeepSeek , ChatGPT and other AI tools have been banned for official use by the finance ministry.\nAccording to a Reuters report, the ministry has issued an internal advisory on January 29, warning that the use of AI applications on office computers and devices presents risks to the security of sensitive government information.\nThree officials from India's finance ministry confirmed the authenticity of the advisory, the report added.This comes amid ongoing scrutiny of AI tools across various nations.\nCountries such as Australia and Italy have already implemented similar restrictions on the use of DeepSeek, citing data security concerns.The Indian finance ministry's advisory reads: \"It has been determined that AI tools and AI apps (such as ChatGPT, DeepSeek, etc.)\nThis marks Altman's second visit to India, following his June 2023 trip when he first met with PM Modi to discuss AI regulations.",
      "url": "https://timesofindia.indiatimes.com/technology/tech-news/finance-ministry-issues-warning-to-employees-on-chatgpt-deepseek-and-other-ai-tools/articleshow/117942716.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117942709,width-1070,height-580,imgsize-9958,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 23,
      "title": "Morning Bid: India eyes historic rate cut, global easing momentum mounts",
      "summary": "The obvious exceptions are the U.S. Federal Reserve, which has paused its easing cycle, and the Bank of Japan, which is gradually raising rates, albeit from virtually zero.\nBut the Reserve Bank of India's decision comes amid growing concern worldwide over the potential damage to economic activity and growth from U.S. President Donald Trump's tariff threats.\nA rate cut is widely expected so it should be in the rupee's price, leaving all eyes on the new governor's guidance.\nTaiwan's trade deficit with the US last year widened to $74 billion, meaning it has virtually quadrupled in six years.\nTaiwan is home to chipmaker TSMC, which has a $65 billion investment in the US to build factories in Arizona.",
      "url": "https://ca.finance.yahoo.com/news/morning-bid-india-eyes-historic-214649458.html",
      "imgURL": "https://media.zenfs.com/en/reuters.com/b93de83072c901627d7b56a167983053"
    },
    {
      "news_number": 24,
      "title": "IFC Partners with Axis Bank to Provide a $500 million Climate Loan in India",
      "summary": "This transaction is also the largest green financing by IFC in the country.\nThe funding will enable Axis Bank to expand its climate finance portfolio.\nThis loan will not only catalyze private sector investment in this emerging asset class but also direct long-term funding toward fostering a sustainable blue economy.\nAdditionally, it aims to enhance financing for climate projects across India, with a strong emphasis on green buildings that will mitigate climate change impacts and generate jobs.\nIFC has built a successful track record in the green finance market and is laying the groundwork for launching and scaling blue finance across the globe.",
      "url": "https://www.ifc.org/en/pressroom/2024/ifc-partners-with-axis-bank-to-provide-a-500-million-climate-loan-in-india",
      "imgURL": "https://www.ifc.org/content/dam/ifc/photos/2024/Axis-PR.jpeg"
    },
    {
      "news_number": 25,
      "title": "Focus on fiscal consolidation, growth supports India's credit profile: CareEdge Global",
      "summary": "Revenue expenditure-to-GDP is budgeted to moderate to 11 per cent in 2025-26 from 11.4 per cent in 2024-25, while the capex-to-GDP is budgeted to remain steady at 3.1 per cent.The Budget provided the future roadmap for the central government's debt-to-GDP, which remains on a downward trajectory to reach 50+-1 per cent by end-2030-31, from the estimated 57.1 per cent in 2024-25.CareEdge projects India's General Government Gross (GGG) debt, which includes state government debt to remain on a downward trajectory in the medium term.\n\"Globally, the GG debt-to-GDP levels of most other major economies are projected to show a rising trend going forward.\nHowever, India is among a few major economies where the GGG debt-to-GDP is projected to fall,\" CareEdge Global Ratings said.India continues to remain the world's fastest-growing major economy.\nThe government's focus on capex-led growth has supported economic growth post-pandemic.However, the economic momentum witnessed some deceleration, with real GDP growth estimated at a four-year low of 6.4 per cent in 2024-25, as per the First Advance Estimate released recently.The Budget addressed some key economic concerns on the growth front.CareEdge Global believes the reduction in income tax announced in the Budget will likely provide the much-needed impetus to domestic consumption.In the Budget for 2025-26 tabled on February 1, the finance minister had announced that no income tax will be payable on income up to Rs 12 lakh, providing significant relief to taxpayers, especially the middle class.\nEarlier, this limit was Rs 7 lakh.",
      "url": "https://m.economictimes.com/news/economy/finance/focus-on-fiscal-consolidation-growth-supports-indias-credit-profile-careedge-global/articleshow/118081674.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-118081692,width-1200,height-630,imgsize-12128,overlay-economictimes/articleshow.jpg"
    },
    {
      "news_number": 26,
      "title": "Finance Ministry bans use of ChatGPT, DeepSeek for official purposes. Here’s why",
      "summary": "Finance Ministry has asked its employees to avoid using AI tools such as ChatGPT and DeepSeek for official purposes because of the risks these chatbots pose to the confidentiality of government documents and data, Reuters reported, citing an internal department advisory.\nAustralia removes DeepSeek from government devices“It has been determined that AI tools and AI apps (such as ChatGPT, DeepSeek etc.)\nWe will have a world-class foundational AI model in just a few months.” the Union Minister had said then.\nThe Electronics and IT minister had also stated then that the data privacy issues surrounding DeepSeek could be addressed by hosting open source models on Indian servers.\nSince its sudden rise in popularity, DeepSeek has come under increasing scrutiny from regulators around the world over its privacy policies.",
      "url": "https://www.livemint.com/technology/tech-news/finance-ministry-bans-use-of-chatgpt-deepseek-for-official-purposes-heres-why-sam-altman-11738734040808.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2025/02/05/1600x900/AI-DEEPSEEK-32_1738373400041_1738734344412.jpg"
    },
    {
      "news_number": 27,
      "title": "India’s Minister of Finance discusses India's economic growth at Wharton fireside chat",
      "summary": "India’s Minister of Finance discusses India's economic growth at Wharton fireside chatThe Wharton Initiative on Financial Policy and Regulation and the Wharton India Economic Forum hosted a fireside chat with Nirmala Sitharaman, India's Minister of Finance and Corporate Affairs, on Oct. 22. Credit: Abhiram JuvvadiWharton students and faculty gathered for a fireside chat with Nirmala Sitharaman, India's Minister of Finance and Corporate Affairs, at Huntsman Hall on Oct. 22.\nThe event was co-hosted by the Wharton Initiative on Financial Policy and Regulation and the Wharton India Economic Forum.\nSitharaman, an influential figure in global finance and Indian politics, shared insights into India’s economy and the transformative policies that have positioned the nation on a global stage.\nIn addition to discussing India’s economic growth, Sitharaman also highlighted the importance of student involvement in global finance.\nShe encouraged Penn students to consider internships and research opportunities within India’s finance sector.",
      "url": "http://www.thedp.com/article/2024/10/penn-india-finance-minister-discusses-growth-wharton-fireside-chat",
      "imgURL": "https://snworksceo.imgix.net/dpn/d6b2a5ed-0e5a-4a4a-b024-d84fa86a3685.sized-1000x1000.jpg?w=800"
    },
    {
      "news_number": 28,
      "title": "Finance secretary calls for investment, and innovation to drive economic growth",
      "summary": "New Delhi: While the government having returned money to citizens through tax cuts in the budget, it is now for industry and businesses to take investment risks and create institutions and jobs, finance secretary Tuhin Kanta Pandey said on Thursday.\nSpeaking at a post-budget interaction hosted by the PHD Chamber of Commerce and Industry, Pandey emphasized that new ideas, strategies and private investments are needed to drive the cycle of economic growth.\nMeanwhile, the new income tax bill, which is set to be introduced in Parliament soon, will feature simplified language, eliminating long clauses, provisos, and excessive explanations, Pandey said.\nPandey said that the new income tax bill is not trying to attempt a new thing, but it will be a different way of engagement with citizens.\nThe bill is part of a broader initiative to reform the tax system, aiming to streamline and enhance transparency in the existing structure.",
      "url": "https://www.livemint.com/economy/finance-secretary-calls-for-investment-and-innovation-to-drive-economic-growth-11738848514732.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2025/02/06/1600x900/PTI01-09-2025-000299B-0_1738575071150_1738849160067.jpg"
    },
    {
      "news_number": 29,
      "title": "The financial toxicity of cancer care in India",
      "summary": "Financial toxicity is the least assessed and most devastating toxicity of cancer.\nTo finance the direct medical cost of cancer care, some States such as Delhi, Maharashtra, Punjab, and Kerala have implemented several schemes.\nOnly a strong political will and strategic investment in the public health system will address the financial toxicity of cancer.\nBut only a fraction of these specialise in cancer care.\nIndian philanthropy, CSR initiatives, government funding, and nonprofits hold the power to alleviate the economic burden of cancer care.",
      "url": "https://www.thehindu.com/opinion/op-ed/the-financial-toxicity-of-cancer-care-in-india/article69179836.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/go5opv/article69179899.ece/alternates/LANDSCAPE_1200/Lung_04.jpg"
    },
    {
      "news_number": 30,
      "title": "State survived financial crisis; welfare schemes, development unaffected, says Kerala Finance Minister",
      "summary": "Stories you might be interested in",
      "url": "https://m.economictimes.com/news/india/state-survived-financial-crisis-welfare-schemes-development-unaffected-says-kerala-finance-minister/articleshow/118003877.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-118003922,width-1200,height-630,imgsize-1430701,overlay-economictimes/articleshow.jpg"
    },
    {
      "news_number": 31,
      "title": "'Budget's given comfort to monetary authority': Finance secretary Tuhin Kanta Pandey",
      "summary": "Is the time right formonetary authorities to play a part in accelerating growth, for example with a rate cut?\nIs the tax relief largely to boost consumption and address some of the concerns of the middle class?\nFinance secretary Tuhin Kanta Pandey said the 2025-26 Budget has tried to push growth in a non-inflationary manner and has kept the promise of fiscal consolidation .the Budget has enabled all levers of growth to accelerate.\nThat has also been included in the FRBM statement.In a way, the Budget has provided whatever stimulations are required.\nIt will have a salutary and good effect on the economy because if they choose to consume, it will boost demand.",
      "url": "https://timesofindia.indiatimes.com/business/india-business/budgets-given-comfort-to-monetary-authority-finance-secretary-tuhin-kanta-pandey/articleshow/117995724.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117996121,width-1070,height-580,imgsize-455300,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 32,
      "title": "Finance ministry prohibits employees from using ChatGPT, DeepSeek on govt devices",
      "summary": "Representative imageNEW DELHI: Ministry of finance has prohibited its employees to refrain from using AI tools and applications like ChatGPT and DeepSeek on office computers and devices.In a communication issued last month to all departments, the ministry stressed that the use of AI tools and apps must be strictly prohibited on office devices.Ministry's department of expenditure, in a memo dated January 29, said that AI tools and app in the office computers and devices pose risks for confidentiality of data and documents.\n\"It has been determined that AI tools and AI apps (such as ChatGPT, DeepSeek etc) in the office computers and devices pose risks for confidentiality of Govt, data and documents,\" the memo read.Meanwhile, Australia and Italy have also shielded their official systems from Chinese DeepSeek over privacy and data security concerns.This comes as OpenAI CEO Sam Altman is on a tour to India and participated in a fireside chat on Wednesday morning.\nHe is also meeting top government officials and industry leaders.At around $6 million, DeepSeek's most recent AI offering has garnered global attention because of its low cost compared to the global norm of billions of dollars.\nAdditionally, DeepSeek's R1 uses only a fraction of the compute power required by well-known AI models like ChatGPT.Last week, the US tech industry , which has long justified investing billions of dollars in AI, watched in disbelief as DeepSeek surpassed ChatGPT as the most popular free app on Apple's Appstore.",
      "url": "https://timesofindia.indiatimes.com/india/finance-ministry-prohibits-employees-from-using-chatgpt-deepseek-on-govt-devices/articleshow/117949256.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-117949305,width-1070,height-580,imgsize-324601,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 33,
      "title": "Govt, RBI will work together for growth: Finance Minister",
      "summary": "“I see this as a positive sign and with (Friday’s rate cut by the RBI), things can move together in alignment,” she said.\nThe minister also stressed the government would continue to work in a well-coordinated fashion with the RBI to prop up growth and contain inflation.\n“In the coming times also, RBI and government will work in a well-coordinated manner keeping our growth impulses in mind,” she said.\nThe RBI has pegged its real GDP growth forecast for FY26 at 6.7% compared with the Economic Survey’s estimate of 6.3% to 6.8%.\nHe added that RBI took on board the current rupee-dollar rate while working out growth and inflation projections for the next financial year.",
      "url": "https://www.financialexpress.com/policy/economy-govt-rbi-will-work-together-for-growth-finance-minister-3743734/",
      "imgURL": "https://www.financialexpress.com/wp-content/uploads/2025/02/sitharaman.reuters.jpg"
    },
    {
      "news_number": 34,
      "title": "India Delivers $12 Billion in Tax Cuts to Spur Economic Growth",
      "summary": "She also announced a slightly smaller budget deficit for the coming fiscal year, with a modest increase in infrastructure spending.\nThe tax changes will affect 10 million individuals, increasing the number of those paying zero income tax to 60 million, or about 74% of all taxpayers.\nThe economy is expected to expand 6.3%-6.8% in the coming fiscal year.\nOn the spending side, the government underspent on its capital expenditure this year, resulting in a smaller budget deficit of 4.8% of GDP, compared with a previous estimate of 4.9%.\nCapital spending is projected to grow 10% to 11.2 trillion rupees in the coming fiscal year.",
      "url": "https://finance.yahoo.com/news/india-targets-smaller-budget-deficit-063205739.html",
      "imgURL": "https://s.yimg.com/ny/api/res/1.2/c3OFzVztfmy47wyR1YDx6A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://media.zenfs.com/en/bloomberg_markets_842/ae84ff6840d2f2e3364258f45b16f7bf"
    }
  ],
  "politics": [
    {
      "news_number": 0,
      "title": "Analysis | ‘Chindia’ returns as India and China prepare for a Trump earthquake",
      "summary": "A US military plane carrying Indian illegal immigrants landed in the northern Indian city of Amritsar on Wednesday , handcuffed and legs chained throughout the journey.\nUnlike Colombia , which last month initially refused to accept deportees dispatched in military planes like criminals, India chose discretion as the better part of valour.\nAs Trump unleashed new tariffs on Mexico, Canada and China, the Narendra Modi government cut customs duties on high-end motorcycles, cars and smartphone parts.\nIndian tariffs on Harley-Davidson, in particular, had been an old Trump peeve .\nThe last time he was president, he forced Modi to slash tariffs on Harleys from 75 per cent to 50 per cent.",
      "url": "https://www.scmp.com/week-asia/politics/article/3297836/chindia-returns-india-and-china-prepare-trump-earthquake",
      "imgURL": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_analysis/public/d8/images/canvas/2025/02/07/e8edeb35-aeef-409c-af55-592fd6b8fe65_7dcf37b9.jpg?itok=yne331-J&v=1738928537"
    },
    {
      "news_number": 1,
      "title": "Opposition parties must speak up for Modi critics, says Indian-American politician Kshama Sawant",
      "summary": "Kshama Sawant, an Indian-American politician and a critic of India’s Hindu Right, has “urged” the country’s political Opposition to speak up for critics like her, saying it is in their interest to do so.\n“We have not had such an outcry from the political opposition,” Ms. Sawant, a former City Council Member of Seattle, said.\nAnd it’s a similar case in India,” Ms. Sawant said.\nMs. Sawant said she is exploring a legal challenge to her visa denial, but hasn’t begun the process yet.\n“There is no viable opposition,” Ms. Sawant said, “the only way out is an independent working-class movement.”",
      "url": "https://www.thehindu.com/news/national/opposition-parties-must-speak-up-for-modi-critics-says-indian-american-politician-kshama-sawant/article69189083.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/gulvx/article69189607.ece/alternates/LANDSCAPE_1200/USA-POLITICSSEATTLE"
    },
    {
      "news_number": 2,
      "title": "INDIA allies sharpening knives, Congress’s ‘all about AAP’ claim may not cut much ice",
      "summary": "As expected, the knives are out in the Opposition camp, with some in the INDIA bloc openly blaming the Congress.\n“Our top leaders addressed a public meeting in Delhi along with INDIA bloc leaders to protest against the arrest of Arvind Kejriwal in March last year.\nBJP workers celebrate election results at the Delhi BJP office in New Delhi.\n(Express Photo by Praveen Khanna) BJP workers celebrate election results at the Delhi BJP office in New Delhi.\nSeveral INDIA parties believe the Congress has failed to take along everyone or to give a direction to the bloc.",
      "url": "https://indianexpress.com/article/political-pulse/aap-defeat-blow-india-knives-sharpen-congress-delhi-elections-9824738/",
      "imgURL": "https://images.indianexpress.com/2025/02/india-bloc.jpg"
    },
    {
      "news_number": 3,
      "title": "Who is Kshama Sawant, the Indian-American politician involved in visa row?",
      "summary": "advertisementAt the heart of the row lies the denial of an emergency visa to Sawant, a former Seattle City Council member.\nWHO IS KSHAMA SAWANT?\nadvertisementBorn in Pune, Kshama Sawant completed her bachelor's from the University of Mumbai in 1994.\nEven though her bid to enter the Washington House of Representatives in 2012 failed, she was elected to the Seattle City Council the next year.\nAmid the visa denial row, Sawant has started an online petition demanding that India grant her a visa.",
      "url": "https://www.indiatoday.in/world/story/who-is-kshama-sawant-indian-american-politician-visa-controversies-caa-farmers-protest-2676294-2025-02-07",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202502/who-is-kshama-sawant-074031330-16x9_0.jpg?VersionId=fq03mxHF8Iyn36RfsWJ.jLSvw2VuHC6k"
    },
    {
      "news_number": 4,
      "title": "India’s New Political Map: Showcases Surge In BJP Rule In The Nation",
      "summary": "The Bharatiya Janata Party continues to dominate the Indian political landscape with its direct governance in several key states.\nThe latest political landscape of India reflects a diverse mix of governance with states being ruled by the Bharatiya Janata Party (BJP), National Democratic Alliance (NDA) allies, the Indian National Congress (INC), and regional parties.\nAdvertisement · Scroll to continueBJP-Ruled StatesThe Bharatiya Janata Party continues to dominate the Indian political landscape with its direct governance in several key states.\nThese states include:Advertisement · Scroll to continueUttarakhandUttar PradeshArunachal PradeshAssamManipurTripuraOdishaChhattisgarhGoaMadhya PradeshGujaratRajasthanDelhiHaryanaPuducherryNDA-Ruled StatesThe National Democratic Alliance (NDA), led by the BJP, extends its influence to several other states through its coalition partners.\nThe coming years will reveal how these political dynamics shape the governance and development of India’s states.",
      "url": "https://www.newsx.com/india/indias-new-political-map-showcases-surge-in-bjp-rule-in-the-nation/",
      "imgURL": "https://www.newsx.com/wp-content/uploads/2025/02/Copy-of-INDIAS-POLITICAL-MAP-6-2.webp"
    },
    {
      "news_number": 5,
      "title": "Indian lawmakers protest alleged mistreatment of deportees by U.S.",
      "summary": "NEW DELHI — India's Parliament was disrupted on Thursday as opposition lawmakers protested the alleged mistreatment of 104 Indian immigrants deported by the United States.\nThe lawmakers and media reports said the deportees' arms and legs were shackled while on the aircraft.\n\"The flight was into 8-9 hours and an officer informed (us) that we are being deported\" to India, he said.\nOpposition lawmakers, including Congress leader Rahul Gandhi, also protested outside the Parliament as they demanded a response from the government.\nJaishankar, India's External Affairs Minister, told Parliament that 15,668 Indian nationals have been deported back to India from the U.S. since 2009.",
      "url": "https://ny1.com/nyc/all-boroughs/international/2025/02/06/india-lawmakers-protest-u-s--deportees-mistreatment",
      "imgURL": "https://s7d2.scene7.com/is/image/TWCNews/india_AP_25037270325108_NAT_0206"
    },
    {
      "news_number": 6,
      "title": "Kshama Sawant Denied Indian Visa Amid Political Controversy",
      "summary": "Sawant, known for her advocacy against caste discrimination and criticism of the Indian government's policies, has been denied a visa three times since May 2024, with no official explanation provided.\nSawant perceives the visa denials as political retaliation by Prime Minister Narendra Modi's Bharatiya Janata Party (BJP) government.\nThis incident is part of a broader pattern where individuals critical of the Indian government have faced visa denials or revocations.\nThe Indian government has not officially commented on Sawant's visa denials.\nSawant's situation underscores the ongoing tension between the Indian government's policies and international activists advocating for human rights and social justice.",
      "url": "https://www.deccanchronicle.com/nation/kshama-sawant-denied-indian-visa-amid-political-controversy-1860110",
      "imgURL": "https://www.deccanchronicle.com/h-upload/2025/02/09/1889086-scpr.jpg"
    },
    {
      "news_number": 7,
      "title": "Kshama Sawant alleges political vendetta as India denies her visa, clears husband's",
      "summary": "Indian-American politician and former Seattle City Council member Kshama Sawant has alleged that the Indian government has denied her an emergency visa to visit her ailing mother in India.\nSawant stated that her application was rejected without explanation, while her husband, Calvin Priest, was granted a visa without any issue.\nSawant has attributed the visa denial to political retaliation by the Indian government, citing her strong opposition to Prime Minister Narendra Modi’s policies.\nDespite her repeated requests for an emergency visa, Indian authorities have remained firm in their decision, fueling speculation that the rejection is politically motivated.\nLike Sawant, Swain has an elderly mother in need of medical attention.",
      "url": "https://www.thenewsminute.com/news/kshama-sawant-alleges-political-vendetta-as-india-denies-her-visa-clears-husbands",
      "imgURL": "https://media.assettype.com/thenewsminute%2F2023-09%2F314dcb7b-0403-497f-87cc-8c24a04ce2d0%2FKshama_Sawant_Ians_150923.png?rect=0%2C0%2C499%2C262&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100"
    },
    {
      "news_number": 8,
      "title": "Modi’s BJP romps to Delhi power after 27 years, in big blow to opposition",
      "summary": "Narendra Modi’s BJP finally takes Delhi, India’s political heart, which until now has remained out of its reach.\nIt is our guarantee that we will leave no… — Narendra Modi (@narendramodi) February 8, 2025AdvertisementIn the 70-seat assembly in Delhi, the BJP had won 48 seats.\nAdvertisementThis time, it was Kejriwal’s turn for a humbling moment when, on Saturday morning, his party lost the Delhi assembly to the BJP.\nBut the saffron party needs to be cautious, he warned, as Delhi has changed since the BJP last won the assembly election in 1993.\nSircar said: “The BJP has not governed Delhi that looks like this or feels like this – a modern cosmopolitan imagination.”",
      "url": "https://www.aljazeera.com/news/2025/2/8/bjp-has-system-sewn-up-kejriwals-aap-loses-delhi-in-assembly-elections",
      "imgURL": "https://www.aljazeera.com/wp-content/uploads/2025/02/AP25039324656760-1739013163.jpg?resize=1920%2C1440"
    },
    {
      "news_number": 9,
      "title": "Why Kejriwal's hubris was both bad politics and economics",
      "summary": "It was nimble enough to finetune strategy to make the Delhi election both local and national.\nBJP got a taste of the blowback from cockiness in Lok Sabha elections, but it wasn't a crippling blow.\nNow Kejriwal has faced a full electoral backlash and is out of government in Delhi, his launchpad to national fame.Kejriwal lost for two major reasons apart from hubris.\nThe budget's tax sops helped.Delhi has two attributes that contribute to political hubris.\nHe has the political savvy to bounce back but only if he abandons hubris.",
      "url": "https://timesofindia.indiatimes.com/india/why-kejriwals-hubris-was-both-bad-politics-and-economics/articleshow/118075175.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118087690,width-1070,height-580,imgsize-1302021,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 10,
      "title": "Politics of hope and handouts: Why BJP’s Delhi win will have a national echo",
      "summary": "Story continues below this adPeople wanted Modi for India and Kejriwal for Delhi.\nThere was no other leader the BJP relied on in Delhi as it did on Modi, in what was a virtual referendum on AAP supremo Arvind Kejriwal.\nEven as caste and community have not disappeared as voting imperatives in different parts of India, Delhi holds out lessons which other states can ill afford to ignore.\nThe Delhi outcome is bad news for the entire Opposition, for it gives new heart and new impetus to the BJP.\nMost regional parties in INDIA chose to support Kejriwal — and not the Congress — in Delhi, as the two parties fought separately.",
      "url": "https://indianexpress.com/article/political-pulse/delhi-election-results-politics-bjp-win-9825703/",
      "imgURL": "https://images.indianexpress.com/2025/02/narendra-modi-1600-1.jpg"
    },
    {
      "news_number": 11,
      "title": "Indian PM's party celebrates landslide win in New Delhi",
      "summary": "India's Hindu-nationalist ruling party led by Prime Minister Narendra Modi celebrated a landslide victory Saturday in key elections in the capital province of Delhi, with the former chief minister suffering a crushing defeat.\n\"Development has won, good governance has won,\" Modi said after the city's ex-leader — a key opposition figurehead to the premier — was confirmed as having lost his seat.\nModi's Bharatiya Janata Party (BJP) is in government in the national parliament but has not controlled the local legislature in the capital since 1998, so it is a symbolic and strategically important victory.\nArvind Kejriwal lost his seat to Modi's BJP, reflecting wider damaging losses by the Aam Aadmi Party (AAP).\n\"Our victory is a sign of the people's faith in Prime Minister Modi's vision of progress,\" interior minister and BJP stalwart Amit Shah said in a statement.",
      "url": "https://www.japantimes.co.jp/news/2025/02/09/world/politics/modi-bjp-victory/",
      "imgURL": "https://www.japantimes.co.jp/japantimes/uploads/images/2025/02/09/451081.jpg?v=3.1"
    },
    {
      "news_number": 12,
      "title": "Caste in Plates: Politics of Food in India",
      "summary": "India hasn't been able to move away from its casteist roots; dominant castes have found ways to discriminate against backward communities in social settings, especially using food.\nCultural laws and food regulations have kept changing based on circumstances in India.\nAs a result of caste-based purity and impurity, Brahmin man was allowed to eat food only if prepared by a Brahmin.\nIn several states of India, Sakshibhojanam' (seeing Bramhin eat) and 'Panthibhojanam' (community eating) was only practised among dominant castes, excluding Dalits.\nSegregation at restaurants and cafes based on caste and religion is one of the many subtle kinds of discrimination that went unrecognised in modern India.",
      "url": "https://en.themooknayak.com/discussion-interview/caste-in-plates-politics-of-food-in-india",
      "imgURL": "https://media.assettype.com/themooknayak-en%2F2023-09%2Fbdaaa052-18cc-4b37-b5d8-b3aa0b6b7fdd%2FVeg_Non_Veg_Food_1.png?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100"
    },
    {
      "news_number": 13,
      "title": "The politics of misgovernance",
      "summary": "Sumeet Bhasin’s book The Capital Conundrum: Governance Issues in the Heart of India makes for an important read.\nDivided into seven chapters, the author covers aspects that have shaped the politics of Delhi in the last decade.\nThe simplified style of writing makes it easy for the reader to understand the layered political complexities of the national capital.\nAs the director of Centre for Policy and Planning, Bhasin uses data extensively to make the reader understand the reason behind the growing opposition AAP has faced in the last one year.\nIt mentions the ‘deteriorating healthcare services and facilities in the national capital posing a grave challenge that demands urgent and decisive action’.",
      "url": "https://www.newindianexpress.com/lifestyle/books/2025/Feb/08/the-politics-of-misgovernance",
      "imgURL": "https://media.assettype.com/newindianexpress%2F2025-02-08%2F97lyxkiy%2FGiTS4rhXsAAp484.jpeg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100"
    },
    {
      "news_number": 14,
      "title": "Parvesh Verma meets L-G amid speculation over BJP's CM face",
      "summary": "Hello readers!\nAAP on Saturday suffered a heavy defeat in the Assembly elections in Delhi, paving the way for the BJP to come to power in the national capital after nearly three decades.\nDelhi CM Atishi on Sunday then resigned from her post, while deliberations are under way in the BJP to pick its CM face.\nBJP's winner from the New Delhi constituency, from which Arvind Kejriwal contested, also met the Delhi L-G amid speculation over the saffron party's CM face.\nStay tuned to DH for all the latest political updates across the nation.",
      "url": "https://www.deccanherald.com/india/india-politics-live-latest-news-bjp-narendra-modi-congress-rahul-gandhi-nana-patole-amit-shah-nda-maha-yuti-delhi-assembly-elections-2025-aap-arvind-kejriwal-atishi-3397074",
      "imgURL": "https://images.deccanherald.com/deccanherald%2F2025-02-09%2Fogh7uu93%2FPTI02082025000383A.jpg?rect=0%2C0%2C3712%2C1949&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop"
    },
    {
      "news_number": 15,
      "title": "Indian Consulate Denies Visa To US Politician Kshama Sawant. She Says It's Because..",
      "summary": "The Indian Consulate in Seattle was faced with a law and order situation over the emergency visa denial to Indian-American politician Kshama Sawant.\n\"Today, the Consulate was forced to deal with a law and order situation arising from the unauthorised entry by certain individuals into the Consulate premises after office hours.\nDespite repeated requests, these individuals refused to leave the Consulate premises and engaged in aggressive and threatening behaviour with the Consulate staff,\" the Consulate General of India in Seattle said in a post on X.\nToday, the Consulate was forced to deal with a law and order situation arising from the unauthorized entry by certain individuals into the Consulate premises after office hours.\nShe had also moved the resolution outlawing caste-based discrimination in Seattle while she was a member of the Seattle City Council.",
      "url": "https://www.ndtv.com/world-news/indian-consulate-denies-visa-to-us-politician-kshama-sawant-she-says-its-because-7656499",
      "imgURL": "https://c.ndtvimg.com/2023-02/9k3gjs1o_kshama-sawant-_625x300_21_February_23.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738"
    },
    {
      "news_number": 16,
      "title": "Explained: The political history of Delhi",
      "summary": "Congress secured 39 seats, the Bharatiya Jana Sangh (predecessor of the BJP) won five, while the Socialist Party won two.\nDelhi Assembly is abolishedThe young CM, however, soon clashed with the Chief Commissioner — much like Delhi CMs in recent years have been clashing with Lieutenant Governors (LG) appointed by the Centre.\nOn November 1, 1956, Nihal Singh resigned, the Delhi Assembly was abolished, and Delhi became a Union Territory.\nSheila Dikshit (Express Photo/Prem Nath Pandey) Sheila Dikshit (Express Photo/Prem Nath Pandey)Dikshit strengthened the Congress’s hold over Delhi, and went on to become the longest serving woman CM in the history of independent India.\nDikshit also championed Delhi buses switching to CNG, privatised power distribution companies, and trifurcated the Municipal Corporation of Delhi.",
      "url": "https://indianexpress.com/article/explained/explained-politics/political-history-of-delhi-9809940/",
      "imgURL": "https://images.indianexpress.com/2025/01/SheilaDikshitArvindKejriwal.jpg"
    },
    {
      "news_number": 17,
      "title": "India’s ruling BJP poised for comeback in Delhi state election, exit polls show",
      "summary": "Indian Prime Minister Narendra Modi’s Bharatiya Janata Party (BJP) appears poised to wrest the state of Delhi from the decade-long rule of the Aam Aadmi Party (AAP) in the country’s recent high-stakes regional election.\nVoter turnout for the Delhi state election on Wednesday was at 60.4 per cent.\nAam Aadmi Party chief Arvind Kejriwal shows his inked finger after casting his vote at a polling station in New Delhi, India, on Wednesday.\nPhoto: EPA-EFEAfter 10 years in power, the AAP is on the back foot because of voter fatigue, according to Shastri.\n“When the party first came to power [in Delhi], it projected itself as an alternative to mainstream political parties, but today it is not in any way different,” he said.",
      "url": "https://www.scmp.com/week-asia/politics/article/3297675/indias-ruling-bjp-poised-comeback-delhi-state-election-exit-polls-show",
      "imgURL": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2025/02/06/63594b43-fac2-40a7-84ab-32781f94af70_d645cc72.jpg?itok=Tndh7jxP&v=1738853633"
    },
    {
      "news_number": 18,
      "title": "Arvind Kejriwal entered politics to change it. Then, politics changed him",
      "summary": "Arvind Kejriwal entered politics to change it.\nThen, politics changed himAvijit GhoshTNN Feb 9, 2025, 11:41 IST ISTOnce upon a time, Kejriwal was an icon of hope for a new, fearless India.\nAnd, on February 8, the after-effect was seen in the outcome of the Delhi assembly pollsOnce upon a time, there was an Arvind Kejriwal .\nHis first swearing-in ceremony at Delhi's Ramlila Maidan in the winter of 2013 didn’t feel like a momentary celebration of people’s power.\nIt was more like the beginning of a movement for positive change in the way politics was conducted in the country.",
      "url": "https://timesofindia.indiatimes.com/toi-plus/politics/arvind-kejriwal-entered-politics-to-change-it-then-politics-changed-him/articleshow/118083918.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118084233,width-1070,height-580,imgsize-27672,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 19,
      "title": "Delhi Election Results 2025 LIVE Updates: Who will be the next Delhi CM? Where will AAP and Kejriwal go from here?",
      "summary": "AAP and BJP battle it out -- who will make it?\nDelhi Election Results 2025 LIVE Updates: The Bharatiya Janata Party (BJP) won the Delhi Assembly elections and will return to power in the National Capital after 27 years.\nCould it be Parvesh Verma, the son of late Delhi CM Sahib Singh Verma, or one of the two woman Lok Sabha MPs?\nECI Delhi Election Results LIVE 2025: Check HereWhat this means for the BJP: A return to power in Delhi shakes off the shadow cast on the BJP by the Lok Sabha results, less than a year ago.\nIt has shown up the fault lines in the INDIA bloc, of which the AAP and the Congress are a part.",
      "url": "https://indianexpress.com/article/political-pulse/delhi-kejriwal-aap-analysis-9823826/",
      "imgURL": "https://images.indianexpress.com/2025/02/Delhi-Assembly-Election-Results-2025-Analysis-feature.jpg"
    },
    {
      "news_number": 20,
      "title": "Essence Of Political Seva Is In Dissolving Ego",
      "summary": "This becomes particularly significant as the results of elections to Delhi's legislative assembly will be declared today.\nRenowned for his unwavering commitment to justice and compassion, King Shibi once offered his flesh to save a dove being pursued by a hawk.\nThe essence of political seva lies in dissolving one's ego and dedicating every action to the betterment of society.\nDrawing from the ideal of introspection, they must examine their actions and strategies, seeking to understand where they fell short.\nTheir duty is to hold govt accountable, not out of spite but as an act of seva to the nation.",
      "url": "https://timesofindia.indiatimes.com/speaking-tree/daily-ecstasy/essence-of-political-seva-is-in-dissolving-ego/articleshow/118064886.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118064928,width-1070,height-580,imgsize-17826,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 21,
      "title": "BJP’s Delhi win shows rejection of politics of lies & loot: Yogi",
      "summary": "\"I extend my heartfelt congratulations to all the winning candidates in Delhi and to every dedicated BJP worker.\nHe said that deceptive politics had masked true welfare initiatives and the misrule of both Congress and AAP had been exposed.\nHe attributed the \"historic\" win to the leadership of PM Modi and his all-inclusive development policies, dedicated to public welfare and uplift of all.\n\"Congratulations to all the winning candidates and congratulations to the people of Delhi who love good governance!\"\nthe CM said.",
      "url": "https://timesofindia.indiatimes.com/city/lucknow/bjps-delhi-win-shows-rejection-of-politics-of-lies-loot-yogi/articleshow/118075437.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118075433,width-1070,height-580,imgsize-57352,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg"
    },
    {
      "news_number": 22,
      "title": "Indian politicians are becoming obsessed with doling out cash",
      "summary": "W HEN THE Aam Aadmi Party ( AAP ), which leads Delhi’s government, unveiled a new programme handing out 1,000 rupees ($11.50) a month to most women in the capital, the response from political rivals was predictable.\nThe opposition Bharatiya Janata Party ( BJP ), which runs the national government, staged a protest and called the scheme a “deceitful act”, a ruse to win local elections in February.\nEven more predictable, though, was the BJP ’s unveiling on January 17th of its own scheme, one that outgunned the AAP ’s with a promised handout of 2,500 rupees.",
      "url": "https://www.economist.com/asia/2025/01/23/indian-politicians-are-becoming-obsessed-with-doling-out-cash",
      "imgURL": "https://www.economist.com/content-assets/images/20250125_ASP003.jpg"
    },
    {
      "news_number": 23,
      "title": "BJP should learn TN will never accept divisive politics and agenda, says Stalin",
      "summary": "BJP should learn TN will never accept divisive politics and agenda, says StalinThe DMK chief also launched a frontal attack against Governor R N Ravi and Tamil Nadu BJP chief K Annamalai by mocking them as “chief campaigners” for his party.",
      "url": "https://www.deccanherald.com/india/tamil-nadu/bjp-should-learn-tn-will-never-accept-divisive-politics-and-agenda-says-stalin-3396841",
      "imgURL": "https://images.deccanherald.com/deccanherald%2F2025-02-08%2Fcwrvzjfu%2Ffile7z9el8nhnmp5ioyfmv.jpg?rect=0%2C0%2C1200%2C630&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop"
    },
    {
      "news_number": 24,
      "title": "Cash, Kidnappings and Luxury Resorts: A Formula for Power in Modi’s India",
      "summary": "But first came an invitation to have dinner in the suburbs with a senior official from their party in the Indian state of Maharashtra.\nThey would share a car ride, and Mr. Deshmukh could catch the train from there.\nThat, Mr. Deshmukh said, is when he realized he was being kidnapped.\nMr. Deshmukh had become a pawn in what is known as “resort politics,” a longstanding practice unique to India’s rough-and-tumble democracy.\nTo ensure that they would stick to the plan, the lawmakers were moved to other states and isolated in luxury resorts.",
      "url": "https://www.nytimes.com/2024/11/23/world/asia/india-resort-politics-maharashtra-election.html",
      "imgURL": "https://static01.nyt.com/images/2024/11/23/multimedia/00india-money-01-bhlw/00india-money-01-bhlw-facebookJumbo.jpg"
    },
    {
      "news_number": 25,
      "title": "The Resilience of India’s Fourth Party System",
      "summary": "India’s third party system, in place from 1989 to 2014, was synonymous with an era of coalition politics and the absence of a core political party around which the party system revolved.\nThe 2014 election ushered in a new, fourth party system and a return to a dominant party era, with the BJP occupying the central position previously held by the Congress Party.\nThe distinctiveness of the fourth party system is readily apparent when contrasted with the core principles of the third party system.\nVoter turnout in the first party system averaged 60.1 percent (1952–1962), dipping slightly to 59.6 percent in the second party system (1967–1984).\nClosing Gender Gap in TurnoutA second dynamic that came into view during the end of the third party system and the advent of the fourth party system does not pertain to overall turnout levels but to the composition of who comes out to vote.",
      "url": "https://carnegieendowment.org/research/2024/09/india-election-bjp-party-politics",
      "imgURL": "https://carnegie-production-assets.s3.amazonaws.com/static/media/images/modi-india-bjp-elections-GettyImages-2155414775.jpg"
    },
    {
      "news_number": 26,
      "title": "BJP sweeps Delhi: Experts discuss what this means for Indian politics",
      "summary": "The BJP won a resounding victory in the Delhi assembly elections, defeating the incumbent Aam Aadmi Party (AAP).\nThe BJP won 48 out of 70 seats in the Delhi elections, while AAP won 22 and Congress failed to open its account for the third time in a row.\nSo, what does this mean for Indian politics?\nWatch as panellists share their thoughts on the Delhi election's impact on national politics.",
      "url": "https://www.indiatoday.in/programme/newstrack-with-rahul-kanwal/video/bjp-sweeps-delhi-experts-discuss-what-this-means-for-indian-politics-2676989-2025-02-08",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/video/202502/lotus-085127579-16x9_0.jpg?VersionId=ELZYmZQ7UxPBszCFoH6wbItgkzS6O5LB"
    },
    {
      "news_number": 27,
      "title": "The Divine, the Digital and the Political at Humanity’s Largest Gathering",
      "summary": "High above the millions of Hindu pilgrims walking the grounds of the Maha Kumbh Mela, Prime Minister Narendra Modi of India beams down from giant billboards and posters as far as the eye can see.\nElsewhere, there are life-size cutouts of the leader, luminous at night, with his hands folded in greeting.\nThe Maha Kumbh, a spiritual festival widely considered the largest gathering of humanity, is taking place this year in the city of Prayagraj, where the Ganges and Yamuna Rivers meet.\nThrongs of devotees take a dip in the holy waters in the belief that doing so will purge them of sins and grant them salvation.\nThere are ash-smeared monks, naked ascetics, priests with vermilion paste on their foreheads, ordinary pilgrims, tourists with selfie sticks, awe-struck foreigners, entertainers, small vendors and big advertisers.",
      "url": "https://www.nytimes.com/2025/02/02/world/asia/india-maha-kumbh-mela.html",
      "imgURL": "https://static01.nyt.com/images/2025/02/02/multimedia/02india-festival-promo/02india-festival-kbgv-facebookJumbo.jpg"
    },
    {
      "news_number": 28,
      "title": "Kshama Sawant: The Indian-American politician on ‘rejection list‘",
      "summary": "Previously, Ms. Sawant’s visa application was denied twice in 2024.\nThe officer at the consulate did not give an explanation, simply saying Ms. Sawant’s name is on the “rejection list”.\nMs. Sawant had moved to the US from Mumbai and is a software engineer by profession.\nAfter losing the race for the House of Representatives, Ms. Sawant was elected to the Seattle City Council in 2014.\nThe letter was attached along with Ms. Sawant and her husband Calvin Priest’s emergency visa application three weeks ago.",
      "url": "https://www.thehindu.com/news/national/kshama-sawant-the-indian-american-politician-on-rejection-list/article69191517.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/cvky87/article66535432.ece/alternates/LANDSCAPE_1200/Caste_Debate_American_Diaspora_34152.jpg"
    },
    {
      "news_number": 29,
      "title": "AAP -- India’s once-vaunted third party has lost its shine",
      "summary": "AAP -- India’s once-vaunted third party has lost its shineFor a party with a hold on the politics of just two of India’s states, the AAP still talks a big game.",
      "url": "https://www.deccanherald.com/opinion/aap-indias-once-vaunted-third-party-has-lost-its-shine-3392277",
      "imgURL": "https://images.deccanherald.com/deccanherald%2F2025-02-06%2Fe69wqu3c%2Ffile7z1bc9iyvrmt09dfhya.jpg?rect=0%2C45%2C1200%2C630&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop"
    },
    {
      "news_number": 30,
      "title": "INDIA bloc rifts widen as Congress gets 'spoiler' tag in Delhi",
      "summary": "Adding insult to injury, the Congress now also battles its 'secular brethren', slapping it with the 'vote katwa' tag, something the Grand Old Party used to taunt Asaduddin Owaisi's AIMIM with.Given the absence of any credible attempt to revive the Delhi Congress' organisational structure in the past five years and its last minute election preparation, the grand old party's dismal show surprised none.\nShe fought and survived but turned bitterly against Congress and ended even her courtesy visits to 10, Janpath.\nNow, a wounded and defeated Kejriwal may turn more hostile against its INDIA bloc ally Congress.\nThey are betting hopes that AAP's defeat will eventually \"open up' the Delhi space for Congress' recovery and that the Delhi results will also weaken the AAP in Punjab.\nDelhi has now been added to that Congress challenge list.",
      "url": "https://m.economictimes.com/news/politics-and-nation/india-bloc-rifts-widen-as-congress-gets-spoiler-tag-in-delhi/articleshow/118072955.cms",
      "imgURL": "https://img.etimg.com/thumb/msid-118073059,width-1200,height-630,imgsize-105106,overlay-economictimes/articleshow.jpg"
    },
    {
      "news_number": 31,
      "title": "Countries' FMs Meet in India",
      "summary": "Greek Foreign Minister George Gerapetritis is in India on a 2-day official visit where he met with his Indian counterpart, Subrahmanyam Jaishankar to strengthen Greek Indian relations.\nAthens considers the visit significant, especially in view of Greece’s participation in the United Nations Security Council for the 2025-26 term.\nApart from his meeting with the head of Indian diplomacy on Thursday, Gerapetritis is also scheduled to meet with India’s National Security Advisor, Ajit Doval, on Friday.\nReinforcing cooperation in the tourism sector is another key issue of interest in strengthening Greek Indian relations.\nThe Memorandum of Understanding on Migration and Mobility between Greece and India, currently under negotiation, is regarded as a significant step forward in this regard.",
      "url": "https://www.tovima.com/politics/greek-fm-gerapetritis-in-india-for-important-talks/",
      "imgURL": "https://www.tovima.com/wp-content/uploads/2025/02/07/gera.jpg"
    },
    {
      "news_number": 32,
      "title": "In UK, rise of Indian-origin extremist ideologies risks deepening divisions: analysts",
      "summary": "A leaked UK Home Office report has, for the first time, identified Indian-origin Hindu nationalist extremism, Hindutva and the Sikh separatist movement as domestic security concerns.\nAdvertisementAnalysts said the United Kingdom must navigate these ideological tensions carefully, as unchecked extremism risked fuelling further violence and deepening divisions within diaspora communities.\nThe UK Home Office’s report, commissioned by Home Secretary Yvette Cooper in August 2024, was recently leaked to the right-leaning Policy Exchange think tank.\nThe report called Hindu nationalist extremism “an extremist ideology that advocates for Hindu supremacy and seeks to transform India into an ethno-religious Hindu state”.\nAdvertisementThe report noted: “Tensions between Hindu and Muslim communities in the UK are still evident and the events in Leicester show how disinformation can play a role in offline action.”",
      "url": "https://www.scmp.com/week-asia/politics/article/3297492/uk-rise-indian-origin-extremist-ideologies-risks-deepening-divisions-analysts",
      "imgURL": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2025/02/05/40aa468f-84f7-4089-9c37-e10b801183e7_33f6beaf.jpg?itok=ic5zQHZx&v=1738752314"
    },
    {
      "news_number": 33,
      "title": "'India needs fresh blood to purge politics of deceit': PM Modi invites youth to join politics",
      "summary": "arvind-kejriwal 'India needs fresh blood to purge politics of deceit': PM Modi invites youth to join politics The Bharatiya Janata Party (BJP) has secured a resounding victory in the Delhi Assembly Elections 2025, ending AAP’s decade-long rule in the national capital.\nAs BJP workers erupted in celebrations across Delhi, Prime Minister Narendra Modi arrived at the party headquarters to address supporters.\nThe BJP headquarters turned into a sea of saffron, with thousands of enthusiastic party workers cheering, waving flags, and chanting slogans.\nJoining the celebrations were Union Home Minister Amit Shah, BJP National President JP Nadda, and other senior party leaders, who hailed the victory as a historic mandate for development.\n'India needs fresh blood to purge politics of deceit': PM Modi invites youth to join politics.",
      "url": "https://www.moneycontrol.com/elections/assembly-election/delhi/india-needs-fresh-blood-to-purge-politics-of-deceit-pm-modi-invites-youth-to-join-politics-videoshow-12934703.html",
      "imgURL": "https://images.moneycontrol.com/static-mcnews/2025/02/20250208155947_Modi-Speech-Byte-VOD-0802.jpg"
    },
    {
      "news_number": 34,
      "title": "Staff threatened: Indian consulate as politician protests against denial of visa",
      "summary": "The Indian Consulate in Seattle on Friday said that it faced a law and order situation after certain individuals tried to enter the consulate premises without authorisation after office hours.\nWhile the consulate did not explicitly mention what the incident was about, the statement suggested that it was linked to protests staged by Indian-American politician Kshama Sawant over a denial of a visa.\nadvertisement“Today, the Consulate was forced to deal with a law and order situation arising from the unauthorised entry by certain individuals into the Consulate premises after office hours.\nIn a series of posts on X, Sawant said that she and members of Workers Strike Back engaged in a “peaceful civil disobedience” at the Indian consulate, demanding an explanation about why her visa was rejected three times.\nadvertisement“My husband and I are in Seattle Indian consulate.",
      "url": "https://www.indiatoday.in/world/story/indian-consulate-seattle-on-visa-denial-to-indian-american-politician-kshama-sawant-2676218-2025-02-07",
      "imgURL": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202502/kshama-sawant-071141754-16x9_0.jpg?VersionId=yUR55ruwkLQqbeZHN4l3fBv2ULWZ3Sca"
    },
    {
      "news_number": 35,
      "title": "Contemporary India: From Domestic Politics To Foreign Policy And Beyond",
      "summary": "The Hoover Institution hosts Contemporary India: From Domestic Politics to Foreign Policy and Beyond on Wednesday, November 20, 2024, from 12:00 PM PT to 1:30 PM PT.\nThis event will highlight the entire spectrum of India’s current politics and policies using the recently published Oxford Handbook of Indian Politics as its platform.\nThe Oxford Handbook of Indian Politics, edited by Sumit Ganguly and Eswaran Sridharan, covers key political institutions, major political parties, and processes such as elections and coalitions in India.\nSpeakers:Dr. Šumit Ganguly, Senior Fellow, Hoover InstitutionŠumit Ganguly is a Senior Fellow at the Hoover Institution and Director of the Huntington Program on Strengthening the US-India Relationship.\nDr. Philip Zelikow, Botha-Chan Senior Fellow, Hoover InstitutionPhilip Zelikow is the Botha-Chan Senior Fellow at Stanford University's Hoover Institution.",
      "url": "https://www.hoover.org/events/contemporary-india-domestic-politics-foreign-policy-and-beyond",
      "imgURL": "https://www.hoover.org/sites/default/files/styles/facebook/public/2024-11/Oxford%20Handbook%20of%20Indian%20Politics.png?h=3522c921&itok=j_hp6W8k"
    },
    {
      "news_number": 36,
      "title": "AAP and Arvind Kejriwal: What next for India’s biggest political startup and its founder after crushing Delhi defeat?",
      "summary": "A fledgling political party that promised new beginnings and was granted the status of national party in April 2023 is in fear of losing that coveted title.\nFinancial woes in Punjab During the election campaign in Punjab, AAP’s key promises were 300 units of free electricity and a monthly stipend of ₹1,000 to women over 18.\nThe AAP in Punjab is not as strong as the AAP in Delhi.\nBeyond Punjab, AAP’s attempts to gain ground in BJP’s stronghold of Gujarat could also suffer a setback.\nAnalysts agree that AAP’s political strategies have often made the BJP uneasy.",
      "url": "https://www.livemint.com/news/aap-and-arvind-kejriwal-what-next-for-india-s-biggest-political-startup-and-its-founder-after-crushing-delhi-defeat-11739016674749.html",
      "imgURL": "https://www.livemint.com/lm-img/img/2025/02/08/1600x900/Arvind-Kejriwal-16_1738343087047_1739017141623.jpg"
    },
    {
      "news_number": 37,
      "title": "Indian Politics and Hindu Temples: Three Historical Moments — Center for Asian Democracy",
      "summary": "Hindu temples feature prominently in today’s Indian politics, most visibly in Prime Minister Narendra Modi’s consecration and patronage and of the Rama Temple in Ayodhya.\nProf. Richard Eaton highlights moments in India’s precolonial and colonial past to illustrate how the ghosts of those periods haunt, and inform, the present.",
      "url": "https://louisville.edu/asiandemocracy/news-and-events/indian-politics-and-hindu-temples-three-historical-moments",
      "imgURL": ""
    },
    {
      "news_number": 38,
      "title": "Party Instability and Political Violence in India",
      "summary": "A new book by the scholar Aditi Malik highlights political parties, specifically party instability, as the principal culprit.\nIn Playing with Fire: Parties and Political Violence in Kenya and India, Aditi highlights how the levels of party instability informs the decisions of political elites to organize or support violence.\nShe studies political violence, gender-based violence, social movements, and contentious politics.\n“Paul Staniland on the Surprising Decline in Political Violence in South Asia,” Grand Tamasha, October 7, 2020.\nAditi Malik, “Playing with Fire: Parties and Political Violence in Kenya and India,” Fifteen Eighty Four (CUP) Blog, August 14, 2024.",
      "url": "https://carnegieendowment.org/podcasts/grand-tamasha/party-instability-and-political-violence-in-india",
      "imgURL": "https://carnegie-production-assets.s3.amazonaws.com/static/media/images/GT_Simplecast-NEW.png"
    }
  ]
}