{
  "india": [
    {
      "news_number": 0,
      "title": "Visualizing the international reach of U.S. funding cut by Trump",
      "content": "President Trump has announced plans to dismantle U.S. foreign aid efforts, with over 90% of its spending frozen for nearly a year. The Trump administration has denied claiming the U.S. government is the largest humanitarian donor but claims that only a small percentage of the U.S. congressional budget goes towards it.\n\nKey areas affected include emergency food programs in countries like Ethiopia and the HIV prevention program, PEPFAR. Meanwhile, the U.S. has closed off many of its global payments to other nations' healthcare systems, affecting efforts to provide medical services globally. There is bipartisan support for local governments, allowing them more control over health programs.\n\nThe U.S. has also invested heavily in other regions, targeting areas like Ukraine and Europe, but some concerns are about missing payments when it comes to programs in regions where the United States is not a major supporter. International groups like Proximity International express fears that the freeze could disrupt payments for contractors working on international aid projects.\n\nOverall, the freeze highlights U.S. efforts to build stability in areas affected by conflict while acknowledging significant changes and modifications in its global support system.",
      "url": "https://www.washingtonpost.com/world/2025/02/09/trump-usaid-foreign-funding-cuts-rubio/",
      "imgURL": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RUGLRTKULZB6XPESJMXXJVLTDI.jpeg&w=1440",
      "date": "2025-02-09T00:00:00"
    },
    {
      "news_number": 1,
      "title": "India need 305 to defeat England in second men’s one-day cricket international – live",
      "content": "The Indian team faced a thrilling 11:07 p.m. cricket innings against England at Cuttack Stadium. Here’s a concise summary of the critical moments:\n\n- **Rohit Sharma’s dismissal**: After 49 overs, Rohit Sharma dropped Virat Kohli for four runs in the first over.\n  \n- **India’s early dominance**: The team took significant advantage with Shubman Ganguli scoring 35 runs off three deliveries and Ravi Jadeja adding three key catches.\n\n- **Key events**: England managed to score 297 runs in their innings, missing only 8 runs from the 49th over, while Virat Kohli dismissed Shubman Ganguli for four runs in a critical moment.\n\n- **Final scoreline**: India secured 304 runs, with England having fallen short by 6 wickets and 5 runs. The innings was decided by England's early dominance and their ability to counter the fast-moving Indian batsmen.",
      "url": "https://www.theguardian.com/sport/live/2025/feb/09/india-v-england-second-one-day-international-live",
      "imgURL": "https://i.guim.co.uk/img/media/68782a80a9c71b866bb17e1dff719e5b25974c1e/0_89_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=1c4221183193c76b3dc9cd890bfea235",
      "date": "2025-02-09T00:00:00"
    },
    {
      "news_number": 2,
      "title": "ICC: Dozens of member states back top criminal court after Trump sanctions",
      "content": "Trump announced sanctions onICC officials during his first term, after visiting Israeli Prime Minister Netanyahu since taking office. Dozens of countries, including the UK, Germany, France, and others, expressed \"unwavering support\" for the court due to its critical role in international justice. Trump called for the court to remain a vital pillar of the global system, while White House staff cited it as essential for stopping war crimes. The sanctions, which include financial and visa bans on individuals involved in ICC investigations, could impact the court's operations. Trump emphasized a dangerous precedent setting and criticized the court's moral equivalency with Hamas. He also called for Israel to remain a democracy with strict military laws. However, plans to take over Gaza have sparked concerns among many.",
      "url": "https://www.bbc.com/news/articles/cx2p19l24g2o",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/b9ec/live/979bc1e0-e526-11ef-a319-fb4e7360c4ec.jpg",
      "date": null
    },
    {
      "news_number": 3,
      "title": "Pope Francis reminds armed forces to ‘always respect international laws’",
      "content": "Sign up for breaking news alerts via email. Pope Francis addressed a tombola mass at home with difficulty breathing, continuing activities indoors except Sunday. He emphasized Second Vatican teachings on soldiers being servants of their homeland and expressed caution over international law use. A new peace appeal targets global conflicts including Ukraine, Middle East, Myanmar, and Sudan. Recently, he used a walker or cane and fell twice, injuring his arm and chin. Speculations about his health and past Bronchitis cases remain constant in Vatican circles.",
      "url": "https://www.independent.co.uk/news/world/europe/pope-francis-vatican-war-israel-ukraine-b2694915.html",
      "imgURL": "https://static.independent.co.uk/2025/02/09/11/Vatican_Pope_09874.jpg?width=1200&height=800&crop=1200:800",
      "date": "2025-02-09T12:44:41+00:00"
    },
    {
      "news_number": 4,
      "title": "Stop international work, Trump administration tells ocean agency",
      "content": "On Feb. 5, 2025, the Trump administration requested the National Oceanic and Atmospheric Administration (NOAA) to halt international engagement work. During a briefing in the Oval Office, employees were told to stop discussing or meeting with international colleagues. The edict prohibits email exchanges with foreign national colleagues. This action is part of NOAA's broader effort as a U.S. Department of Commerce to foster collaboration across regions and borders.",
      "url": "https://www.opb.org/article/2025/02/08/trump-noaa-stop-work/",
      "imgURL": "https://opb-opb-prod.cdn.arcpublishing.com/resizer/v2/AOG2OGOYOJADZAZR6MZHOTUL2M.jpg?auth=965dfd3acf52cd3f81dea5a7bc5f0551710844b63fea7786a1c19381e7b4f970&width=1200&height=675&smart=true",
      "date": "2025-02-08T00:00:00"
    }
  ],
  "health": [
    {
      "news_number": 0,
      "title": "NRDC Analysis: Climate Action Can Improve Health in Rural India",
      "content": "The article explores the growing threat of environmental health risks in India due to increasing climate change. Key points include widespread environmental hazards such as heatwaves, erratic rainfall patterns, and harmful ozone pollution. These factors worsen as temperatures rise, threatening public health and well-being. The role of government actions is emphasized, including initiatives to reduce energy use (Heat Action Plans) and improve climate preparedness through biogas projects. Specifically, the Hariyali Gram project in rural areas aims to enhance indoor air quality and improve household energy efficiency using solid fuels and biogas systems. NRDC's collaboration with SEWA highlights a promising approach to scaling up climate action in rural settings. The article provides early insights from a March 2024 survey, showing improvements in health outcomes such as reduced indoor pollution and enhanced thermal comfort, promising broader implementation efforts.",
      "url": "https://www.nrdc.org/bio/vijay-limaye/nrdc-analysis-climate-action-can-improve-health-rural-india",
      "imgURL": "https://www.nrdc.org/sites/default/files/styles/social_sharing_1200x630/public/2025-02/blog.png?h=93ccc1d0&itok=004WCL7w",
      "date": null
    },
    {
      "news_number": 1,
      "title": "Researchers link India’s food program to better health and stronger incomes",
      "content": "Despite global advancements and the world's economic connectivity, malnutrition remains a pressing global issue. The United Nations estimated in 2023 that 2.33 billion people faced moderate or severe food insecurity. Researchers at UC Santa Barbara, the Indian Institute of Management, and the University of Calgary examined the effectiveness of the largest global food assistance program in the world, the USP (United States Public Distribution System). Their findings reveal health and economic benefits far beyond caloric content—showing how PDS can improve quality of life for millions worldwide.",
      "url": "https://news.ucsb.edu/2025/021738/researchers-link-indias-food-program-better-health-and-stronger-incomes",
      "imgURL": "https://news.ucsb.edu/sites/default/files/2025-01/India-PDS-iStock.jpg",
      "date": null
    },
    {
      "news_number": 2,
      "title": "MediBuddy to develop health IoT devices and more India briefs",
      "content": "MediBuddy is collaborating with Japanese electronics maker ELECOM to develop health IoT devices, aiming to manage users' health data and generate personalized health insights through AI-driven solutions. In a media release, Dr Hada highlighted the system's use of Wi-Fi and Bluetooth for body composition scales.\n\nFitness company GOQii has teamed with Acrannolife Genomics for an AI-enabled post-organ transplant care program called GrafCare, which uses AI, genomics data, and personal health tracking. It provides financial support, preventive care strategies, and access to specialists, and also offers continuous vital monitoring.\n\nBabynama, the first digital paediatric care platform in India, secured $700k through a seed funding round led by Good Capital. The startup focuses on 24/7 paediatric support, parent education, and community engagement, aiding 200,000 parents. It plans to introduce third-trimester care and interactive workshops with parents.\n\nKey points: MediBuddy with ELECOM IoT devices, AI GrafCare, Babynama expansion.",
      "url": "https://www.mobihealthnews.com/news/asia/medibuddy-develop-health-iot-devices-and-more-india-briefs",
      "imgURL": "https://www.mobihealthnews.com/sites/default/files/web_xl-1061984054.JPG",
      "date": "2025-02-06T22:44:42-05:00"
    },
    {
      "news_number": 3,
      "title": "Reconceptualizing menstrual health and hygiene among young women in India",
      "content": "**Summary of MHH Access Disparities in India Based on NFHS-5**\n\n1. **Overall Disparity**: The top 20% of districts in India have significantly higher MHH access than the bottom 80%. This large gap reflects various socio-economic factors influencing access.\n\n2. **Factor Analysis**:\n   - **Statistical Significance**: Factors like education level, wealth index, area of residence, and region of residence are significant, with some being non-significant.\n   - **Key Variables**: Wealth index is positively associated with high MHH access, while asset index (like income) negatively impacts low quintiles. Region of residence also plays a role, especially in urban areas.\n\n3. **Fairlie Decomposition Analysis**:\n   - The 72% disparity explained by the model includes asset index, area, and region.\n   - Specific contributions: Asset index explains 36.5%, region 23.6%, place of residence 16.7%, and education level 6.3%.\n\n4. **Unmeasured Factors**: The remaining 27% suggests other variables, such as knowledge, stigma, or specific MHH interventions, are influencing disparities but not captured by the data.\n\n5. **Regional Insights**:\n   - Urban areas likely have access through proximity to cities, while rural areas may rely on healthcare systems.\n   - Rural and low-income districts lack adequate healthcare facilities compared to urban settings with better infrastructure.\n\n6. **Practical Applications**: Urban populations in India may benefit from strategies tailored to their distance from cities, whereas rural areas could leverage existing healthcare networks.\n\n**Conclusion**: While socio-economic factors significantly influence MHH access, unmeasured variables also play a role. Understanding these nuances can guide targeted interventions and resource allocation for equitable healthcare delivery in India.",
      "url": "https://www.nature.com/articles/s44294-025-00056-0",
      "imgURL": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs44294-025-00056-0/MediaObjects/44294_2025_56_Fig1_HTML.png",
      "date": null
    },
    {
      "news_number": 4,
      "title": "The indefatigable ASHA worker, central to India’s healthcare system, seeks proportionate compensation",
      "content": "ASHA (AccredSocial Health Activists) workers were crucial for improving maternal and child health, immunization rates, and overall community well-being. They were selected through a rigorous process by the NRHM from communities of various backgrounds. Their role included spreading awareness about nutrition and sanitation facilities. During COVID-19, their workload expanded with increased salaries and incentives. Despite these challenges, ASHAs faced criticism for low pay and systemic inequalities in incentives, but they maintained community bonds among themselves, providing resilience even during harsh times. Their story highlights the importance of systematic reforms to ensure fair compensation and safe working conditions.",
      "url": "https://www.thehindu.com/sci-tech/health/the-indefatigable-asha-worker-central-to-indias-healthcare-system-seeks-proportionate-compensation/article69195177.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/hi020m/article69195474.ece/alternates/LANDSCAPE_1200/AFP_36T93ZA.jpg",
      "date": "2025-02-09T01:30:00+00:00"
    }
  ],
  "sports": [
    {
      "news_number": 0,
      "title": "Where to watch Super Bowl 2025 in India: Streams, TV channel, start time for Chiefs vs. Eagles live and on demand",
      "content": "Super Bowl 59 will be a thrilling showdown between the Chiefs and Eagles at New Orleans' Caesars Superdome on Monday morning, aiming to secure three consecutive titles. The Chiefs, led by Mahomes and a dominant defense, are poised to make history as their seventh franchise Super Bowl champion and fifth in five seasons. The Eagles, with Hurts and Barkley key players, will return for revenge after their 57-loss loss.  \n\n viewers can catch the game on DAZN NFL Game Pass or Star Sports 1/2 HD, with early access for $80. Key highlights include Kendrick Lamar’s performance in \"Not Like Us\" andams from Taylor Swift and Ledisi. The pre-game will feature tributes to Chris Bleszynski and Deiontay Bracken.",
      "url": "https://www.sportingnews.com/in/nfl/news/watch-super-bowl-2025-india-streams-channel-time-nfl-live-demand/a43846088ce15e92bd0688f1",
      "imgURL": "https://library.sportingnews.com/styles/crop_style_16_9_desktop/s3/2025-02/Chiefs-Eagles-SB59-face-off-FTR.jpg?itok=VejB51xE",
      "date": "2025-02-09T14:27:01+00:00"
    },
    {
      "news_number": 1,
      "title": "India England Cricket",
      "content": "Mary Louise Kistner Stone, M.D., passed away on February 6, 2025. She was born in Philadelphia, PA, in 1952, received her medical degree from the University of Pittsburgh Medical Center, and founded Bluefield Hematology & Oncology, Inc., in 1986. She served as a practicing physician in Bluefield until her retirement.",
      "url": "https://www.bdtonline.com/sports/national_sports/india-england-cricket/image_19de8e4b-a100-5a62-a985-6898a2e1363d.html",
      "imgURL": "https://bloximages.chicago2.vip.townnews.com/bdtonline.com/content/tncms/assets/v3/editorial/1/9d/19de8e4b-a100-5a62-a985-6898a2e1363d/67a85ebd5cdd9.image.jpg?crop=1166%2C612%2C0%2C581&resize=1166%2C612&order=crop%2Cresize",
      "date": null
    },
    {
      "news_number": 2,
      "title": "India England Cricket",
      "content": "A comprehensive list of 50 states across the United States includes their zip codes and capitals. Key entries are Alabama (35102), Alaska (99486), Arizona (85720), Arkansas (74001), California (91732), Colorado (19710), Connecticut (62001), Delaware (19669), Florida (35207), Georgia (38203), Hawaii (96796), Idaho (19444), Illinois (62501), Indiana (62001), Iowa (61603), Kansas (62503), Kentucky (70405), Louisiana (79002), Maine (79101), Massachusetts (corrected from 88650 to 13981), Maryland (71231), Michigan (89806, corrected), Minnesota (55401, corrected), Mississippi (73804), Missouri (41201, corrected), Montana (15102, corrected). States in the Pacific Northwest include California, Washington D.C., Oregon (97203, corrected from 96796), and states in other regions like Texas (77528) and New York (14101).",
      "url": "https://www.wvnews.com/sports/pro/india-england-cricket/image_ab39c3ea-59b5-5eb6-8a90-ec6472746bf1.html",
      "imgURL": "https://bloximages.chicago2.vip.townnews.com/wvnews.com/content/tncms/assets/v3/editorial/a/b3/ab39c3ea-59b5-5eb6-8a90-ec6472746bf1/67a8811db9769.image.jpg?crop=1175%2C617%2C0%2C573&resize=1175%2C617&order=crop%2Cresize",
      "date": null
    },
    {
      "news_number": 3,
      "title": "India England Cricket",
      "content": "The article lists U.S. states with their respective zip codes: Alabama (35205), Alaska (99807), Arizona (60834), Arkansas (72912), California (97103), Colorado (80301), Connecticut (61103), Delaware (19708), Florida (35205), Georgia (30403), Hawaii (98906), Idaho (86699), Illinois (62104), Indiana (62117), Iowa (62404), Kansas (62404), Kentucky (62404), Louisiana (70705), Maine (98235), Massachusetts (12306), Michigan (48203), Minnesota (55201), Mississippi (48103), Montana (48701), Nebraska (48001), New Hampshire (48501), New Jersey (07001), New Mexico (87126), Texas (75901), and West Virginia (30401).",
      "url": "https://www.hjnews.com/sports/nation/india-england-cricket/image_d92833a8-1aad-514d-b9fe-b176d2f0f7b2.html",
      "imgURL": "https://bloximages.chicago2.vip.townnews.com/hjnews.com/content/tncms/assets/v3/editorial/d/92/d92833a8-1aad-514d-b9fe-b176d2f0f7b2/67a88214ce083.image.jpg?crop=1175%2C617%2C0%2C573&resize=1175%2C617&order=crop%2Cresize",
      "date": null
    },
    {
      "news_number": 4,
      "title": "India vs England 2nd ODI Live Cricket Score Streaming Online: Where to Watch IND vs ENG Cuttack match free?",
      "content": "The 2nd ODI between India and England will be live-streamed on Star Sports, featuring Rohit Sharma and Virat Kohli returning to the squad after a successful performance at the ODI World Cup. The match is set in Barabati Stadium, Cuttack, on February 9 at 1:30 PM IST. India, heading to Ahmedabad for their Champions Trophy, faces England's second ODI against them.",
      "url": "https://indianexpress.com/article/sports/cricket/india-vs-england-2nd-odi-live-cricket-score-streaming-9825366/",
      "imgURL": "https://images.indianexpress.com/2025/02/IND-ENG-23.jpg",
      "date": "2025-02-09T17:07:06+05:30"
    }
  ],
  "finance": [
    {
      "news_number": 0,
      "title": "UPSC Ethics Simplified | Integrity in Finance: Money talks—But what does it say about ethics?",
      "content": "**Financial Ethics in Context**\n\nThe article emphasizes that financial ethics are not confined to wealth and taxes but extend to everyday financial decisions. **Nanditesh Nilay from UPSC Essentials** explores this theme by discussing how financial integrity can be examined through topics like money and ethics, using a 2024 essay as an example.\n\n**Case Studies in Financial Tenderness**\n\nThe article highlights two key cases: the 2024 White House incident, where large companies accepted huge sums without new issues, showcasing financial temptation. It also points out multi-crore scams in India, illustrating corruption through bribery or crony capitalism.\n\n**Ethical Implications of Indian Administrative Service (IAS) Institutions**\n\nThe author contrasts ethics in IAS institutions with executive roles, highlighting that while ethical principles guide decisions, the executive often prioritizes profit over compassion. This underscores the need for ethical governance and accountability in financial contexts.\n\n**Modern Capitalism and Social Welfare**\n\nThe article questions whether modern capitalism inherently poses ethical risks, pointing to the erosion of social welfare through consumerism. It advocates for ethical funding in elections, emphasizing transparency and clear principles to avoid empty figures.\n\n**Conclusion on Financial Integrity**\n\nUltimately, the text concludes that money devoid of moral reasoning is merely a figure, becoming significant when it transforms into '1.' In governance and elections, ensuring financial integrity involves using transparent methods and clear principles.",
      "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-ethics-simplified-integrity-finance-money-budget-economy-9826145/",
      "imgURL": "https://images.indianexpress.com/2025/02/UPSC-essentials-Nanditesh-Nilay-feature-8.jpg",
      "date": "2025-02-09T15:56:28+05:30"
    },
    {
      "news_number": 1,
      "title": "India’s Economic Aspirations: A Conversation with Finance Minister Nirmala Sitharaman",
      "content": "Dr. John J. Hamre, CEO & President of Center for Strategic & International Studies (CSIS), will join H.E. Nirmala Sitharaman, Union Minister of Finance and Corporate Affairs, at a meet-in-person event on October 25th in Mumbai. The event begins with remarks, followed by a moderated session led by Dr. Hamre from 5:00 to 6:00 pm. After the session, there will be a private reception from 6:00 to 7:00 pm. Sitharaman has served as Finance Minister since May 2019 and delivered her Budget Speech in July 2024. Dr. Hamre specializes in international relations, particularly in the Middle East. The event is free and supported by CSIS's general funding. Seating is limited; register early.",
      "url": "https://www.csis.org/events/indias-economic-aspirations-conversation-finance-minister-nirmala-sitharaman",
      "imgURL": "https://csis-website-prod.s3.amazonaws.com/s3fs-public/2024-10/241021_India_Econ_Banner.jpg?VersionId=IDMpOrdv.aa0vHSWvtjTosMuKhlHqDLY",
      "date": null
    },
    {
      "news_number": 2,
      "title": "Budget: Tax relief for Indian middle class",
      "content": "India's middle class benefits from a significant income tax exemption upgrade, targeting individuals earning up to 1.2 million rupees, making those earnable through taxes entirely free. This move aims to address urban consumption slumps and stimulate the economy by boosting corporate profits. The government also plans to increase infrastructure spending, with targets on track despite some contraction in actual spending. For nuclear energy, a goal of generating 100 GW by 2047 is set, along with adjusting compliance rules. Small industries, accounting for 35% of manufacturing, receive fiscal support and subsidies, creating millions of jobs and private investments. A high-level committee will reform regulations in non-financial sectors to ease business concerns. The budget also aims to boost foreign insurers' interest in the growing insurance market.",
      "url": "https://www.bbc.com/news/articles/cx25k05p1y1o",
      "imgURL": "https://ichef.bbci.co.uk/news/1024/branded_news/478b/live/b01fe450-e06a-11ef-b59b-45d387e1d31a.jpg",
      "date": null
    },
    {
      "news_number": 3,
      "title": "ChatGPT, Deepseek Usage in India: India’s finance ministry asks employees to avoid AI tools for official purposes",
      "content": "The Ministry of Finance has advised officials to strictly avoid using AI tools, such as ChatGPT and DeepSeek, on official devices due to potential confidentiality risks for government data. Sam Altman, OpenAI's CEO, is attending India to meet Prime Minister Modi. DeepSeek, a Chinese AI model launched in January 2025, will soon be hosted on Indian servers, with details of the setup pending confirmation. The circular was issued by DoE on Jan 29, 2025, and Ashwini Vaishnaw, the Union Minister for IT, noted that DeepSeek will be hosted on Indian servers by Jan 30, 2025. A training session held by DoPT in October 2024 remains to address the use of AI tools.",
      "url": "https://www.thehindu.com/sci-tech/technology/indias-finance-ministry-asks-employees-to-avoid-ai-tools-like-chatgpt-deepseek/article69183180.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/th0rtx/article69183717.ece/alternates/LANDSCAPE_1200/Deepseek_China_Security_57262.jpg",
      "date": "2025-02-05T08:19:41+00:00"
    },
    {
      "news_number": 4,
      "title": "Raising the Bar: India’s Push to Increase Ambition on Climate Finance",
      "content": "In 2021, the 26th COP26 in Glasgow led the UNFCCC by launching the Ad-Hoc Work Programme on the NCQG (NCCHGC) between 2022 and 2024. The initiative aims to address climate change goals with a focus on quantity, structure, quality, contributors, recipients, timeline, revisions, progress tracking, and the Paris Agreement's long-term climate finance objective.  \n\nKey elements include:  \n1. A public finance target of at least $1 trillion annually in grants or concessional funds for developed countries to expand contributor bases beyond D&D groups (G77 + China + LMDC).  \n2. India submitted a proposal emphasizing private finance, avoiding expanded contributor bases and recipient differentiation.  \n3. India opposes multilateral processes based on past commitments not delivering climate finance, viewing the NCQG as an opportunity for developed countries to demonstrate accountability.\n\nIndia is likely to push for higher public finance targets and accountability from D&D countries.",
      "url": "https://www.nrdc.org/bio/vyoma-jha/raising-bar-indias-push-increase-ambition-climate-finance",
      "imgURL": "https://www.nrdc.org/sites/default/files/styles/social_sharing_1200x630/public/2024-11/UNFCCC-Bonn-climate-talks.jpg?h=827069f2&itok=LLIpCdwZ",
      "date": null
    }
  ],
  "politics": [
    {
      "news_number": 0,
      "title": "Analysis | ‘Chindia’ returns as India and China prepare for a Trump earthquake",
      "content": "A U.S. military plane carrying Indian illegal immigrants landed in Amritsar on Wednesday, handcuffed and legs chained throughout the journey. India chose discretion as valour despite criticism from Colombia, which initially refused to accept soldiers without proper authorization. Despite this,印度对哈雷迪 bell的关税偏颇，特朗普曾将印度从75%降至50%，这次印度不接受任何回流行动。美政府通过Expo 2012展示印度产品，巩固了其在新政府中的位置，并应对特朗普的tariffs。",
      "url": "https://www.scmp.com/week-asia/politics/article/3297836/chindia-returns-india-and-china-prepare-trump-earthquake",
      "imgURL": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_analysis/public/d8/images/canvas/2025/02/07/e8edeb35-aeef-409c-af55-592fd6b8fe65_7dcf37b9.jpg?itok=yne331-J&v=1738928537",
      "date": "2025-02-08T08:00:09+08:00"
    },
    {
      "news_number": 1,
      "title": "Opposition parties must speak up for Modi critics, says Indian-American politician Kshama Sawant",
      "content": "Kshama Sawant, an Indian-American politician, argues that Indian political opposition should speak out against critics like her to prevent support for Trump and Modi. She highlights the U.S. success in electing top officials despite immigration policies, linking it to India's need for a unified agenda. Sawant also points out denial of visas for figures she called \"modi critics,\" noting issues with Indian immigration laws. However, she successfully passed a federal minimum wage bill, emphasizing labor rights. She accuses liberal parties and Indian political groups of abdication in both countries, aiming to end working-class unrest.",
      "url": "https://www.thehindu.com/news/national/opposition-parties-must-speak-up-for-modi-critics-says-indian-american-politician-kshama-sawant/article69189083.ece",
      "imgURL": "https://th-i.thgim.com/public/incoming/gulvx/article69189607.ece/alternates/LANDSCAPE_1200/USA-POLITICSSEATTLE",
      "date": "2025-02-06T18:04:06+00:00"
    },
    {
      "news_number": 2,
      "title": "Why Kejriwal's hubris was both bad politics and economics",
      "content": "Delhi: The 2019 Delhi elections saw the BJP regain power after 27 years, with Aam Aadmi Party (AAP) securing some seats but facing significant challenges in others. AAP's performance was inconsistent, losing seats without a proportional loss in vote share, while the drop in AAP's seat count mirrored only the loss of votes for CM Arvind Kejriwal. Kejriwal faced backlash and potential loss of his CM position, which he intended to shed following election failure.  \n\nThe article highlights AAP's hubris, using high revenues to build front-page ads and self-promotion, rather than seeking national fame. Similarly, the Congress struggled with managing its resources elsewhere while running in Delhi. The Delhi model was seen as a political strength but also a source of questionable governance, leading to its eventual rejection.  \n\nThe BJP's campaign strategy centered on improving education and healthcare through freebies, which initially proved beneficial, but these efforts were shown not to lead to lasting change. Meanwhile, Kejriwal's over-ambition led to his loss, while AAP faced challenges in its own orbit, with the party's success being questionable elsewhere.  \n\nIn summary, Delhi elections presented challenges for AAP and Kejriwal, highlighting issues of hubris and resource management crucial for future campaigns.",
      "url": "https://timesofindia.indiatimes.com/india/why-kejriwals-hubris-was-both-bad-politics-and-economics/articleshow/118075175.cms",
      "imgURL": "https://static.toiimg.com/thumb/msid-118087690,width-1070,height-580,imgsize-1302021,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
      "date": null
    },
    {
      "news_number": 3,
      "title": "INDIA allies sharpening knives, Congress’s ‘all about AAP’ claim may not cut much ice",
      "content": "The article discusses the reaction of the Indian bloc to the Lok Sabha elections in Haryana and Maharashtra, highlighting tensions between the opposition camp and the Congress. The opposition is reporting that its results have declined due to a recent Congress victory in Delhi, despite an AP win there during Modi's term. The Congress has tried to show opposition by fighting against its supporters in Delhi but faces criticism from its leaders for not receiving enough votes.\n\nKey points include:\n- The Congress saw a 2% increase in their vote share to 6.34%, not a significant boost.\n- They have prepared for a potential Congress government in 2030 but are still facing internal conflicts with the AAP.\n- Some Congress leadership is unhappy, calling their tactics targeting Kejriwal instead of addressing issues like AP performance.\n- The lack of votes for key positions by Congress leaders has led them to doubts about their ability to maintain dominance.\n- Various reactions: RJD leader Jha praised the result as \"episodic,\" while Indics are pushing for AAP leadership, while Bharat Rashtra Samithi gave congrats but did not support.\n- The TMC is preferring silence and has sent leaders to campaign for AAP issues.\n\nThe article paints a divided bloc with some opposition pulling the strings in Delhi against a more radical opposition like AP.",
      "url": "https://indianexpress.com/article/political-pulse/aap-defeat-blow-india-knives-sharpen-congress-delhi-elections-9824738/",
      "imgURL": "https://images.indianexpress.com/2025/02/india-bloc.jpg",
      "date": "2025-02-09T09:16:51+05:30"
    },
    {
      "news_number": 4,
      "title": "Kejriwal era of no-ideology politics ends. Contradiction of being in INDIA & targeting Congress base",
      "content": "Kejriwal, the prominent political figure in India, is central to ongoing conflicts between the Indian National Congress (INC) and the Bharatiya Janata Party (BJP). Kejriwal, once a Hindu nationalist, has been involved in these disputes since his transition to office as vice-president of the INC during the 2017-18 general election. His anti-elitism is evident, often manifesting through his opposition to policies that limit political representation.\n\nKejriwal's efforts include opposing bills such as Jan Lokpal Bill (JLB) in Delhi and attempting to gain seats in states like Gujarat, Goa, Himachal Pradesh, and Punjab for the AAP. Despite this, he resists being part of both parties, which has strained their alliances. The article highlights his efforts to secure seats in Haryana and Punjab but faces criticism for not compromising his demands on national issues, where the Congress is winning more seats.\n\nKejriwal's actions have significant consequences, as he tries to win seats while resisting the growing divide between INC and BJP, particularly with the Congress gaining a majority. His history of earning attention and influence underscores his pivotal role in shaping political dynamics in India, especially regarding Delhi, Punjab, and other major cities.",
      "url": "https://theprint.in/national-interest/era-of-kejriwals-no-ideology-politics-is-over-his-image-of-unfocused-cynical-politician-cost-him-delhi/2485885/",
      "imgURL": "https://static.theprint.in/wp-content/uploads/2024/03/NI-22-March.jpg",
      "date": "2025-02-08T16:11:20+00:00"
    }
  ]
}